{
    "0": {
        "id": "NNcYBmtiZAhYPtWPH9ye1w",
        "name": "Ping Pong",
        "category": "chinese",
        "servesCuisine": "Dim Sum",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "South Bank, Southwark",
            "streetAddress": "Festival Terrace\nSouthbank Centre\nLondon SE1 8XX\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/qp2gHk4vfQlfyCcjIGmdwQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7960 4160",
        "review": [
            {
                "reviewId": "QxV5G75qXQYkwqWMpBJIHw",
                "author": "Soomin R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great dimsum in a fun area, perfect for meals before or after a play at The Globe or the National Theatre. We had an assortment of dimsums and tea, all of which were decent. Note, this isn't an authentic dimsum place as such, but it's a neat westernised atmosphere if you're not feeling like going to Chinatown. My favourite were the chicken with cashew nuts and the hargau. \nService was decent, though it was generally busy in the restaurant. Allow for extra time before and after if you want to make it to a show.",
                "datePublished": "2018-07-01"
            },
            {
                "reviewId": "k9j1EIBh1XLIB53M8DfQSw",
                "author": "Dennis W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I enjoyed our visit to Ping Pong and would definitely stop back for some dim sum!  I'm kind of curious why they chose the name Ping Pong, but I won't lose any sleep over it!  Just remember this:  Dim sum is not an arithmetic calculation gone wrong, its the name of steamed, bite-sized, Chinese dishes with a variety of selection to please any palate. \nThe pre-selected order had a nice variety, but the server also recommended the beef and kimchi dumplings. This was by far my favorite dish of the evening!  The perfectly seared dumplings might as well have been little fireworks exploding with flavors in my mouth. There was the right amount of spice, heat, and flavor to make my tastebuds smile like the Cheshire Cat. \nI fell in love with the decor, but I'm a sucker for koi. If I lived in London I'm sure you'd find me here regularly... I can't wait to come back.",
                "datePublished": "2017-09-24"
            },
            {
                "reviewId": "iKgp-NxpCL5QkjVfT-7Zdg",
                "author": "Arti G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Best dim sum I've had! We went here on my first day in London and the food and drinks were outstanding! \nWe tried pork buns, veggie dumplings, prawn crunch, mushroom chicken over rice, etc. The only thing I did not like was the sticky rice.",
                "datePublished": "2017-08-01"
            },
            {
                "reviewId": "XkoLr64hThfOt1IkmOEiQQ",
                "author": "Thuy Dung N.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "The dim sum here is average. I love dim sum but their dim sum only looks nice in presentation and is rather commercial. Nothing about the taste really stood out and it was quite plain. The table service here was alright. Although one guy in particular could have provided a better service, because they did a mistake with the menu which caused us paying for something that wasn't worth it. If taken the price into consideration, I'd say a definite no. \nSo briefly, food average, service average, price not justified. \nIt's not a horrible place, but also has nothing I can recall that would make me want to come back.",
                "datePublished": "2018-02-08"
            },
            {
                "reviewId": "vWJcaNKBiFDy61-kfkGv5A",
                "author": "Bobby S.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Ping Pong is confused. I don't think this restaurant knows what it wants to be. The servers lacked knowledge and made more than a few mistakes during our time dining with them.\nWe both the Ping Pong sampler dish, which got us three dishes: a rice/meat bowl, a fried component, and a steamed component.\nWe were told to order more because the portions were small and we wouldn't be filled. Because they said this, I ordered a fried spicy chicken addition.\nIt was more than enough. We were both very hungry and ended up being full and ordered too much food.\nThe ambience doesn't match the look of the store. The music was light house music and it felt like someone was going to ask me to try to drop acid or something.\nIt was odd and the worst dining experience of my London trip.",
                "datePublished": "2017-05-21"
            },
            {
                "reviewId": "klKOOiOBwGLHX5DCLUhcWw",
                "author": "Katherine M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The dim sum was not good. Half of the items off the \"Ping Pong Selection\" tasted like plastic. The food is definitely overpriced for the quality! Maybe my standards are high because I'm chinese, but also maybe this is just extremely average food.",
                "datePublished": "2018-08-16"
            },
            {
                "reviewId": "y1gkZ3JSn4Ehp8BjyfYQgQ",
                "author": "M G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The staff were very helpful and friendly. They even made sure that I got a meat free menu. I had lovely cocktails and dim sum and will definitely come back!",
                "datePublished": "2018-06-01"
            },
            {
                "reviewId": "shMFf5N0E4jGkILQt54iIw",
                "author": "Martha L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Absolutely loved this place. It was super crowded but still, the service was extremely nice, polite, helpful and fast. \nThe atmosphere was great, interiorly is cool, DJ was amazing, but it was definitely loud and wouldn't be a place to go for a calm, private candle dinner. Also not a place for kids (in the evening) at all. \nThe food was great and there were some extraordinary pieces we loved. \nDrinks were really good. The bathrooms were clean and had nice hand cream available. \nWe later had a problem with the credit card and my bf had to try and call his bank, then walk to the next station for cash and then that didn't work and then I paid with my card. The whole ordeal took probably 30 min and none of the servers got impatient or rude. \n100% recommend. You can eat late night here and then move on to the bar down the street for a fun night.",
                "datePublished": "2017-12-21"
            },
            {
                "reviewId": "FX0pAwX5eFNy9e_gvFIe-w",
                "author": "Briona L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This was my first time eating Dim Sum! It was amazing quality and great flavor. The prices also were pretty great. My best friend and I ventured into ping pong on a whim and it's safe to say we loved it. I will be bringing my sister here as well! \nEverything was so soft and tasty. The menu is a la carte and everything is definitely shareable. They also have set menus that are done per person. I'd say experiment a bit and go with the a la carte menu. The potato and edamame cakes were amazing! We also ordered chicken and prawn + spicy veggie dim sum. It was so good. \nHonestly, I can't wait to go back!!",
                "datePublished": "2017-01-12"
            },
            {
                "reviewId": "Frxp_2dobRQpS3ngTdG9AQ",
                "author": "F S.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I love dim sum but this is mass-produced and not well done. Service was average. We had several different waiters yet it was difficult to catch anyone in particular to order more food, drinks or the bill. We ordered a second round of dim sum which became confusing on the order sheet but rather than clarify with us, the waitress just put in an order for 6 extra dim sum of which 2 items were forgotten and 2 were wrong. She put through higher priced items that we didn't order which was irritating and we received no apology or offer to re-make correctly. I hate service charge being added to the bill and in a place like this it seems to discourage any effort from the staff. The area has many better options nearby which I recommend you try instead. A very small plus - the flavoured ice-teas were good, so the 2 stars are for the tea.",
                "datePublished": "2018-04-14"
            },
            {
                "reviewId": "67Cj-1vQklki1-t_n5o52w",
                "author": "Cai G.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Went there after riding the London eye...mediocre food and drinks. Great environment though. But other than that everything was pretty run-of-the-mill...",
                "datePublished": "2018-01-26"
            },
            {
                "reviewId": "A0mI8ani1vBERDCBlzMAVA",
                "author": "A B.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Ping Pong is an abomination. Never have I been more outraged with an eating establishment. Here's why\n1. Fake Chinese food - ingredients, seasoning and executions are poor imitation of Chinese style food\n2. Dumplings are flat with small fillings\n3. Tiny servings\n4. Inconsistent timing. First dish served, wait. 2nd dish served, another wait. The remaining dishes served simultaneously. Either served single dish back-to-back or everything together.\n5. It's winter where hot noodle soup would have been a popular order. Yet all such dishes have been struck out of the menu, why?\n6. Expensive\n£70 later, 2 adults + 2 kids left hungry\nDim sum is a well-regarded specialty cuisine that Ping Pong fails to deliver, don't come for the food",
                "datePublished": "2017-12-29"
            },
            {
                "reviewId": "AisgjLy0sUa-3BeJE-FUbA",
                "author": "Monique S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Not mentioned anywhere on the menu, but EVERYONE at the table has to order the bottomless bellinis in order to participate. Otherwise, you pay for them individually (6.95) instead of the 13.00 upgrade.",
                "datePublished": "2016-11-13"
            },
            {
                "reviewId": "79KNhnW6fo4uhrW5KFLmAw",
                "author": "Tamara C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "If you're in this area of London and you want dim sum or ANY Asian food, you should just leg it across the river to Chinatown instead. I won't say the food was terrible, because it wasn't. In fact, the soft shell crab bao dish was really nice!! The dim sum though was... not great... Granted, coming from South East Asia my standards are probably higher than most, I can still count several other places that have daily dim sum that are better. For example, har gau is meant to look like a shiny jewel that you can just about see the prawn through. The har gau here was far too thick so it felt like the insides were not enough. I mean it tasted good, but considering the portion was as small (3 pieces) and not superb, I was let down. The iced teas were really nice so there was that. \nTL;DR - You want dim sum? Go to Chinatown.",
                "datePublished": "2016-11-15"
            },
            {
                "reviewId": "2D3x9JPXCc7mPBG8iUIVXA",
                "author": "Thalie A.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Very nice for a Sunday brunch with friends.\nI pre-booked a table because that's how we roll. Easy peasy.\nKeep in mind, they advise that they turn tables but we were not pushed out as the turnover was steady and they always seemed to have an empty table to accommodate other arriving diners.\nThe initial drink service was slow and mind you, 2 of us opted for the bottomless Bellini's - we did start to wonder if they were being slow because of that, hence limiting how many we would actually get. Hmm\nAnyway, the food was tasty and there are more than enough options on the All You Can Eat Dim Sum (aka Lazy Sunday) to satisfy anyone.\nLovely - we'll be back!",
                "datePublished": "2017-03-24"
            },
            {
                "reviewId": "dO-GnPvSlLjr8qkg99Sfbg",
                "author": "Jamie T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I've tried the lazy sumdays menu and was quite full after. Unfortunately, the quality of some of the food was not that great. However, I'd recommend the rice bowls and thai soups though.\nThe xiao long bao and shu mai's weren't really that great compared to China Town.",
                "datePublished": "2016-05-09"
            },
            {
                "reviewId": "LtCRxpvhGFKsqu6QzY3xsA",
                "author": "Lisa C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hands down this was the best dim sum I have ever eaten! We came in for an early dinner and we were promptly seated and the process was explained (to me anyway, my boyfriend is a dim sum aficionado).\nI ordered the hibiscus spritz which comes in two parts, with a flower frozen in an ice cube and a tower for the drink. It was amazing, sweet and refreshing with a unique presentation. \nWe sampled a variety of food and the first out was the shrimp balls. They were filling with a good mix inside, though difficult to eat since fried bits were on all ends. The dipping sauce that came with this was fantastic. Next up were my boyfriend's favourite the char sui bun, which was good. When I tasted the har gau I thought that would be my favourite of the night but the last up crab and prawn dumpling trumped it. Everything we had was delicious and we left completely stuffed. \nOur waitress was attentive, the drinks were expertly crafted and all the food we tried was phenomenal. If you are looking for a good meal in London I would definitely recommend coming here.",
                "datePublished": "2015-04-15"
            },
            {
                "reviewId": "j5xnNml1fqnAzAN9cx1cig",
                "author": "Brian C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I hadn't been to this branch for over a year, and I'm sad to say that it's still a pretty poor example of a Ping Pong. While the food is on point (try the new pork soup steamed dumplings - I can't spell it but you'll see it on the menu), the ambience is rather lost when you have to sit outside because they still have those awful eight people tables in the main dining area.\nBut at least we managed to avoid those again. Instead we ended up on a rather small two person table outside - which was made better once the nearby heat lamp was turned off as suddenly it felt like we weren't being cooked.\nFood was fine but the manager who took the order slip from us didn't notice we had ordered two portions of the pork buns. So once our waiter realised it was rectified but came a while after everything else.",
                "datePublished": "2015-10-07"
            },
            {
                "reviewId": "wD7Ej577Mx-sfx2dAgTlGg",
                "author": "Lisa R.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "One of the worst meals ever.  Located near Royal Festival Hall, this is a very happening spot.  Dim sum and swanky modern decor, the wait was long and the food looked good.  We had high expectations and the anticipation was exciting.  Our server was not very friendly and seemed shocked we did not want anything but tap water.  The ordering process is like a sushi bar where you mark your own list of dim sum.  We picked items and tried to flag our server down.  She comes back, took our order sheet, then a while later says they are out of a ton of stuff, crossing out several of our order list and other items....okay thanks.  We decided to stick with the remaining first and ended up adding one item (shrimp toast).  \nThe food took forever to come out and when it did, it looked pretty good but tasted terrible.  Sometimes the temperature was off (our first dish was the honey chicken on rice and it was partially hot and partially cold).  As my mom put it, the food got worse with each dish.  The duck spring rolls were mushy and bland, the beef lettuce wraps (a special) were just boring plain shredded beef with no flavor, and it was just so disappointing.\nUnfortunately, it was pricey too, and we left spending way more than we should have for a meal that was barely edible.  Don't be fooled by the crowds and go somewhere else!",
                "datePublished": "2014-07-11"
            },
            {
                "reviewId": "KABgpeAT1tmXxh90XpOn_A",
                "author": "Kristine T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ping Pong has always looked so stylish from the outside so I was excited to go in and try the food.\nOrdering can be a bit tricky, as you are called to fill out a form with all the items on the menu. We were four people and 3 of us went for the set menu so when the items started arriving it took a while for us to figure out which one belonged to what menu and explain to the waitress she would have to tell us what was what.\nThe food itself was very satisfying, I particularly enjoyed the fried selection  but the dumplings and vegetables were quite nice too. The black tea was a bit bitter but full of flavour so I enjoyed that without needing to add any sugar.\nI felt quite full after that meal but the guys in the group (the other two set menus) did mention they could still eat more so you may want to keep that in mind and order a couple more dishes. I'd say ordering lots of things and sharing would be the best option.\nIn general it was a lovely place for a midweek lunch with my team and I hope we go back again.",
                "datePublished": "2015-09-17"
            }
        ]
    },
    "20": {
        "id": "NNcYBmtiZAhYPtWPH9ye1w",
        "name": "Ping Pong",
        "category": "chinese",
        "servesCuisine": "Dim Sum",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "South Bank, Southwark",
            "streetAddress": "Festival Terrace\nSouthbank Centre\nLondon SE1 8XX\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/qp2gHk4vfQlfyCcjIGmdwQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7960 4160",
        "review": [
            {
                "reviewId": "EGt1LV4kKPw29cmqcU74mw",
                "author": "Erica U.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I love ping pong for mommy get togethers. There's rarely a fuss over prams or kiddos running amok which is good for me and the food is really good. Or so it tastes better because I have limited time and usually rocking a pram to sleep or running after my toddler with a delicious pork rib in hand. Either way, i'm a huge fan!\nThe chicken and crunchy peanut salad is really good. Avcocado, crisp lettuce, chicken, and a great peanut sauce thats still light. Well done. \nThe spicy prawn bao is a build it your own asian style taco thing that was super tasty as well. I'm not keen on build it your own stuff but this wasn't messy or anything so that is a plus. \nThe Mocktails were also really nice. I had the jasmine and mint, the jasmine had gone a bit bitter as it was brewed a while but i'm not sure if i'm just a tea snob or not. I take that back, i'm a total tea snob and i know what over brewed tea tastes like. That being said, it was still nice. \nThe staff were really nice too. Can't help but love staff that fix all that 3 toddlers destroy. Bless them.",
                "datePublished": "2016-03-22"
            },
            {
                "reviewId": "P9pEXLYXBb7h0MBdBP6lUg",
                "author": "Lizzie F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "One of my favourite places to eat, they really are little parcels of heaven! They have great set menus to help you choose but my personal favourite is the all you can eat sumdays (on a Sunday) all you can eat bar the specials and desserts. I have been known to graze for hours on. Lovely Sunday afternoon and the south bank branch has a little outdoor seating area which is great for people watching. Highly recommend! \nOh and if you love it get a loyalty card, I've had many a free lunch of the lazy sumday points!",
                "datePublished": "2016-05-19"
            },
            {
                "reviewId": "H9TGBeaMOP7O16kDDFoaeA",
                "author": "Brandy C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "How can I not love this place?!!!!\nIt's the fusion Chinese restaurant with unique style. I love the bar while you are waiting for your seat. \nThe dim sum here are delicious. Worth the wait.",
                "datePublished": "2015-06-27"
            },
            {
                "reviewId": "vh9IDmrc7zI3aaOxiyV3MQ",
                "author": "Inci T.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Really no need. Dumplings have been made with more taste and variety in any Chinese Restaurant. This place is very Europeanized and modernized. For posh people and young couples. Good coctails but dark , noisy, expensive restaurant.",
                "datePublished": "2017-01-26"
            },
            {
                "reviewId": "-rVYAlbwRco9-OKB6zmupQ",
                "author": "M. D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Quality dim sum, affordable prices, good service.\nThe dishes are creative and they have either set menus or a la carte.  Really nice concept for a restaurant which we'd eat at often if it were close to home.\nDefinitely would stop back again and again!\nDelicious food and a decent atmosphere.  I'd recommend.",
                "datePublished": "2016-09-14"
            },
            {
                "reviewId": "pv9JmmodmcmTYtnzFSePKQ",
                "author": "Sarah V.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Really good food and great value. Steamed pork rolls were a particular highlight!\nWe went on a Friday night and had to wait about 40 mins - not too bad as we were able to sit in the bar upstairs. But get there early if you don't want to wait!",
                "datePublished": "2015-03-11"
            },
            {
                "reviewId": "rfK5Vu2zBFqKObX8_qc-5Q",
                "author": "Christie K.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "For the longest time, I was very anti-Ping Pong.  I've been here a couple of times before and never felt very keen to come back but have to say my view (or taste buds) have changed for this place.  I came here for lunch recently and ordered the Super 8 lunch special which I thought was pretty good.  For the group, we had the pork puff pastries and spare ribs.  \nEverything was actually quite good and would consider coming back.  I think it's a good alternative - also they have a lot of good veggie options.  I do like the modern look and feel of the place and such a good location.",
                "datePublished": "2014-09-22"
            },
            {
                "reviewId": "MfKvgR1_36uMIK7E_2acFg",
                "author": "J P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is a decently trendy place, a while back at another branch a waiter told me that the owner hired the same interior designer who did mega trendy and expensive Nobu's interior  and Ping Pong's is almost copy.  However here they seem to have refreshed from then and the concept and the design has moved on since then to keep it current.\nThe main waiter was great, making sure we had everything we needed and really  attentive. Although the other staff were nice, they did have that disturbance of feeling a bit rushed.\nThe dim sum is superb, this is a chain though so the food does feel a bit like it is made to a formula, but is good.\nIt is starts at about £26-£30 because will need to order a lot as it is a few dim sum with each order.\nA good dim sum place that will not dissapoint.",
                "datePublished": "2015-08-10"
            },
            {
                "reviewId": "MkSc_fh6DVbxnHkdo39mXA",
                "author": "Nickie C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Ah, Ping Pong. I want to love you. I really, really do. Lots of the food is yummy and while it's a bit expensive, we can still usually get out for around £30 for 2 (no alcohol). \nUnfortunately I'm not a big fan of this branch. It's big and loud and we're almost always put at a table for 8, all scrunched around with strangers and no room. I get that it's how it is there but it's not really my thing.\nWe went last week with another couple, and were at a nice table for 4. The service is usually quite good but on this occasion, our waiter just could not be bothered. Since we wanted separate bills, each couple did their own ticking off on separate papers. The waiter insisted that he had to combine them and that he couldn't bring us each our own bill. After much arguing, he eventually relented but it set a sour tone for the evening, and our service was pretty awful all night. Luckily we had decent food in good company and it didn't ruin our night!\n(On a side note, the other couple's bill was over twice what ours was - it would have been quite a pain to try to figure it out on our own, especially after a few drinks!)",
                "datePublished": "2014-07-02"
            },
            {
                "reviewId": "940mdH4wvqVSzRISBO0tRw",
                "author": "Isabella M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "My favorite dim sum in town! They have great deals and set menus :) the drinks are awesome and really refreshing, the ginger and lime tea is delicious! \nthe place is also nice and after you fill yourself with food theres nothing better than go for a little walk around the river and appreciate the view while you digest all that amazing food !",
                "datePublished": "2014-09-17"
            },
            {
                "reviewId": "9V9DvIvNggMkMOdeR1R_KQ",
                "author": "Melissa S.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Went for dinner with friends.\nLikes: \n1. Interior very nice\n2. Servers very polite \n3. Ordered the lychee and ginger iced tea was very nice\n4. The duck spring rolls were nice\nDislikes: \n1. Waited a long time for our food \n2. Food came at different times \n3. Found the food very expensive for the portion of food\n4. Music was so loud we couldn't even hear each other speak\nWe were waiting for so long we ended up leaving after a trying a few dishes and had a burrito at wahacca's kitchen food van.  \nOverall I don't think I'll be going back for dinner at ping pong, however if I do go back I'll probably order a set menu instead or just go for lunch.",
                "datePublished": "2014-07-13"
            },
            {
                "reviewId": "dYwO6jNR1GSonRyw0o9M0g",
                "author": "Annie I.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I always say...when going to an asian resturant..look around you and see if its either full of asians or non-asians as it is a good indication of how authentic it is... \nme and my friend were the only 2 asians there lol.\nHonestly the food was not that great...it wasnt bad though~~ but I love my dimsum and was expecting to eat turnip paste cakes (aka carrot cake) which was not on the menu. Its definately a westernized concept. Which is fine for those looking for that. \nThe duck spring rolls were nice, the beef & spinach dumplings too, but disappointed in the pork bun... disappointed in the fried asparagus little dinky dried up strings came out. Disappointed in the bak choy (the cut off the leafy portion for presentation im assuming? Didnt appreciate just the white part of the vegetable... \nThe cocktails looked amazing though~~ didnt have one but presentation was nice~ sat by the bar~ \nWhat I liked: \n1. Staff was really friendly \n2. Ambiance was great, nice place, lots of people\n3. Good location right next to waterloo station by the weekend market stalls",
                "datePublished": "2014-05-09"
            },
            {
                "reviewId": "B5nu82dywIBTHxRhMY78FA",
                "author": "Louisa F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "One day as I got back from visiting my family in France, I realized right off the Eurostar that I had no food at home and had forgotten to place a tesco delivery. I was starving and decided I wanted dumplings and nothing else so I embarked on a Yelp journey to find good dumplings in my neighborhood. Alex's review of Ping Pong was a good enough insurance for me so I ordered various dumplings from Ping Pong on Deliveroo. Literally just dumplings. \nThe delivery came fast and the dumplings were really good. I had a nice assortment of which i can't remember the composition exactly (that review has been waiting for me for a long time now oops). The dumplings came with nice sauces to accompany it. \nI'm sorry I can't write more as I didn't get the full restaurant experience, but I'd definitely try one oof their restaurant if I get the chance.",
                "datePublished": "2016-06-20"
            },
            {
                "reviewId": "Xetuoz7_mOCX_No9wA2rvQ",
                "author": "Jeremy V.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Want Chinese food that's half the quality and twice the price? Well look no further because this is your joint. As an added bonus, the waitstaff will stay as far away from you as possible to ensure your privacy is maintained throughout the meal. Who wants people bothering them with food orders or cluttering your table with food and drinks? \nSeriously, if you're jonesing for Chinese food and your in Southbank then I suppose this place will do. It's good for groups because it's huge and they serve something that resembles Chinese food. But you can really do a lot better in the area.",
                "datePublished": "2015-05-10"
            },
            {
                "reviewId": "ndeswE0ZQ6zPvoeUwJxTCA",
                "author": "Liz I.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "We had such a mixed experience here that I wish I could rate food and service separately.\nFood: 4 stars. The dim sum came out as it was ready, and it was nearly as good as the dim sum we had in Chinatown in Seattle. The Char Siu buns in particular are not to be missed. It was all hot, tasty, and in good sized portions. \nService: 1 star. Absolutely appalling. We were ignored for about 15 minutes, then caught the attention of the very friendly waiter for the table next to us. We asked him about how ordering works, and as he was getting ready to take our order, the grumpiest man alive came over and brusquely asked what we wanted. It was clear that he was meant to be our waiter but had been nowhere to be seen for 20 minutes. He took our order and stomped off. \nThings did not improve. Dishes came out in a timely manner, but it took us flagging down the friendly waiter to order a second round. Hot water for my tea arrived 10 minutes after my dry flowering tea ball. We ordered steamed buns that have broth in them (and are served with a spoon to catch the broth), but no spoons were brought over. We had to use our soy sauce dishes instead (serendipitously, our soy sauce was empty so we hadn't used the dishes yet). 15 minutes after we asked for our cheque, I again had to flag someone down (a host) and ask for it again. It came, and I spent 10 minutes waiting for the grumpy waiter to look at us so I could get him to bring the card reader.\nAll in all, we spent most of our visit being totally ignored by our waiter, who was incredibly unfriendly. We were pretty frustrated with the automatic 12.5% tip, as well, as he definitely didn't earn a penny of it. \nWe enjoyed the food, but because the overall experience was so poor, we won't be returning.",
                "datePublished": "2015-04-10"
            },
            {
                "reviewId": "XKWl6joiVdniBoomQE5ngw",
                "author": "Namita A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I know some people are ehh about chains, but i really really like Ping Pong. I miss good dim sum, and honestly this is a good place to take a bunch of people with a decent atmosphere with good food.  Its not super greasy like the hole in the wall places in San Francisco but not as pricey as the fancy ones I have been to in SF either.  \nFor three of us with plenty of dim sum, wine and tea, it came out to £55 in total, which I actualy think is great.  I am going to come back for sure and especially this one because its in the southbank area (one of the best areas in London in my opinion).",
                "datePublished": "2015-04-22"
            },
            {
                "reviewId": "1vijo4-3d_u-yYZdJCeFvA",
                "author": "Díana B.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The selection of restaurants on the Southbank isn't plentiful - especially when you don't count the markets. Ping Pong is one of the few that I've come to quite a few times because of its relatively speedy service and relatively tasty dim sum. Not the best by far, and definitely not the cheapest. But if you by from the set menu, then you get a decent amount of food for a decent price. Cocktails are sweet, service is friendly. I'll probably end up here again, but I don't purposely seek it out. A solid 3 stars from me.",
                "datePublished": "2016-05-18"
            },
            {
                "reviewId": "hq9pNNf7L9ao4Qn_R653Bw",
                "author": "Jing Shyang Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great atmosphere, decor offset the tasty, but quite small dim sum.\nThis was my first time at Ping Pong. I planned to have a quick lunch armed with my newly registered Ping Pong Loyalty Card, Email for a free cocktail and booking for the Super 8 Menu. The Super 8 menu consisting of a chicken rice pot, tea of your choice, won-ton soup with dumplings, and 5 pre-selected dim sum pieces.\nI opted to sit outside as it was a nice day. It was a little breezy, but every table has a heating element above it, meaning you're not left shivering in late September. I would imagine these would be ineffective when the weather drops below 15 degrees.\nThe staff were pleasant, but there seemed to be a lot of confusion around my cocktail voucher, and to be honest the waiter was clearly new and picking things up. First to arrive was my cocktail. This was a ginger passionfruit crushed ice cocktail. It wasn't very good. Next my complimentary prawn crackers with assortment of dips. Note: you'll need a ping pong loyalty card to get this, but it's free! These were okay. \nThe dim sum arrived shortly after, and I was left slightly puzzled. Normally when I dine chinese, I expect the soup to come first, followed by rice then everything else. I didn't know whether to pick at my tiny dim sum pieces or wait for the soup and rice pot to arrive...after 5 minutes I decide to tuck in. The dim sum was obviously made in house. Both the taste and shapes made it obvious. These weren't your run of the mill production line dim sum. But also left room for skimping on the size. The only one adequate size was the chicken/prawn one. The rest were far too small. If I was paying around £3-4 for 3 pieces I would most definitely be disappointed. However in the context of the deal and extras, it was more than filling. \nAs I polished off 2 of the 5 pieces, the Lychee Red Black scented tea arrived. The aroma was dazzling, and the taste wonderful. Full of flavour and silky smooth without any bitterness. Beautiful. Then finally the rice pot and won-ton soup came. The soup was strange. Tasted nothing like the wonton soup I'm used to and was surprisingly sour. The wonton dumplings were great. Quite large and tasty. The rice pot was the highlight of the meal. The oyster based sauce full of flavour, and plenty of chicken and lots of chinese black mushroom (a delicacy). One of the best rice pots I've ever had. The dipping sauces included chilli oil (all oil, no actual flakes :/), and chilli. The special sauces as a loyalty card holder included chilli black bean sauce (delish), sweet and sour and sesame hoi sin sauce. They were pleasant, but really only the chilli based ones worked with dim sum.\nSo in all, the decor of the place really impressed. Somebody really though about the experience visually. Unfortunately the food (in respect to the dim sum) is below average and the order dishes arrive is a little random. Two things that wouldn't take a lot of effort to improve. Otherwise it has all the small touches I appreciate. Unprotected wifi, loyalty card scheme, lovely interior, unique tea blends. Lets see the major food points fixed, and this place would be an easy 5 stars.",
                "datePublished": "2013-09-29"
            },
            {
                "reviewId": "gnOJfcdD0i8zk2O41TOyCw",
                "author": "Jeni F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is my second visit to a Ping Pong and I'm glad to say that the food was as good as I remember.\nThe dim sum, while not matching up to what I had in Shanghai, is reliable and the restaurant itself seemed easy enough to just rock up and get a table.\nIn the evenings the staff seem pretty rushed off their feet so you really have to be patient when vying for their attention!",
                "datePublished": "2015-04-25"
            },
            {
                "reviewId": "2x4bXMVTU3JJgKvW3oXb_Q",
                "author": "Rebecca P.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "I have been on a Ping Pong hiatus for about two years, but was recently in need of a quick bite before a show at the Southbank in December 2014 and decided to revisit. I was craving steamed buns, so we were determined to get in despite the queue that was trailing outside of the restaurant. We barely managed to get food, however, and our experience was utterly tainted by overburdened staff and misinformation- I can confidently say we will continue to avoid Ping Pong for future as a potential dining venue.\nIn particular, we were told that the waiting time for a two person table would be 20 minutes, but it was at least a 40 minute wait before anyone made any effort to seat us. Only after we complained were we directed to a communal table, so we put our foot down and demanded a two person arrangement as we had originally requested. To our astonishment, we were then swiftly seated. \nWe nearly had to physically grab a server because we were having difficulties getting anyone's attention and were forced to order all of our food in a frenzy while stressing that we only had 20 minutes to dine. The server attempted to be congenial and arrange for our bill to be presented immediately to help speed things up, but was still very slow in manifesting this and to take payment. We had no sauces on our table and asked another passing server for these, but they never arrived and we ended up sharing with our neighbours. Our table was literally so close to both adjacent tables that we were pinned to the wall as well- it was the most stressful and uncomfortable meal I have experienced in recent memory.\nIt must be acknowledged that they did honour an NUS discount and that I have previously eaten at other, smaller and speedier branches of Ping Pong in the past, but the Southbank branch is best avoided if you wish to enjoy a relaxing meal. I can barely recall the quality of the food because we were so dissatisfied with the visit and were forced to voraciously stuff everything in our faces, but I recall that the steamed buns that I did order would have otherwise proved satisfactory as they are a specialty of the chain.",
                "datePublished": "2015-01-05"
            }
        ]
    },
    "40": {
        "id": "NNcYBmtiZAhYPtWPH9ye1w",
        "name": "Ping Pong",
        "category": "chinese",
        "servesCuisine": "Dim Sum",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "South Bank, Southwark",
            "streetAddress": "Festival Terrace\nSouthbank Centre\nLondon SE1 8XX\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/qp2gHk4vfQlfyCcjIGmdwQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7960 4160",
        "review": [
            {
                "reviewId": "twCJIpgKt_B9o4Qh5s60bQ",
                "author": "Kareena S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Yummy Yummy Yummy I am totally in love with this restaurant. I've never tried out any dim sum restaurants before and I was completely shocked to find that this place actually had good tasting food. From the ambience to the cocktails that were decently priced I totally recommend this place You will not be disappointed. Service was fast and my waitress was attentive and very helpful when it came down to explaining their menu. Overall I had a wonderful experience",
                "datePublished": "2014-09-19"
            },
            {
                "reviewId": "MFXFGtan67pgw82-o5X1iQ",
                "author": "Som D.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The Ping Pong menu is a stylised and sterilised form of a dimsum portfolio. So much so that it loses the dimsum edge. Dimsum is a Chinatown thing and should just stay that way. \nThe Southbank Ping Pong is definitely one of the better ones, not just because it looks and feels like cool dining, but also because of the efficient and friendly service level. There's a chance you order might be delayed on busy occasions, but overall, I've never had a bad experience here.",
                "datePublished": "2015-04-01"
            },
            {
                "reviewId": "PjFmqgc6y_dVJGIVg_IkVA",
                "author": "Mark T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Nice environment quirky way of been served you tick the items off the menu & they serve as as soon as its ready things come in cool banquets and you give order 3-4 plates each a share the food which is cool, we were seated on a table with a group of people we didn't know this was nice as you got to interact & chat to people you wouldn't normally. Food was really tasty & dessert was lovley would recommend",
                "datePublished": "2015-06-24"
            },
            {
                "reviewId": "1dAfjK7d-eY4Gy0UNlonNw",
                "author": "Jo K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love their all you can eat offer on their Dim Sum Sundays. It's bottomless dishes (selected ones only) with a complimentary cocktail if you arrive for 12pm. It's perfect for a big party get-to-gether...no faffing with the bills and you can also order whatever you like, however much you want. We also were left alone to enjoy our menu without the pressure of feeling like you are being watched or needed to give your table up for someone else. It's one of my favourite places to go and chill out with my mates whilst enjoying some decent dumplings.",
                "datePublished": "2015-04-27"
            },
            {
                "reviewId": "rSYoHQlBr2PpCm-d3nYmag",
                "author": "Gemma M.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "After this last visit I think I've now given up on Ping Pong, it's overpriced, the service is rubbish and the food is mediocre.\nCame here as I had an offer and even then I get I paid too much, the portions were small and the server pretty much ignored us. We didn't get any free refills on our tea and trying to pay the bill was a challenge. The only good thing is the food was tasty, just wish there had been more of it.",
                "datePublished": "2014-11-22"
            },
            {
                "reviewId": "j6OfzKXxnlCQJJFsdgBYPw",
                "author": "Jennifer S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Just before hitting an event at the Hide&Seek Party event at the Old Vic Tunnels... thought it was a good idea to get some food in my belly as I didn't want a repeat of  my over imbibing session a few days earlier so food was a must!\nI like the modern look of the place. It's not traditional dim sum or atmosphere, still a nice venue and menu. \nSo we stuffed our faces till our bellies were full. Job well done.",
                "datePublished": "2012-09-16"
            },
            {
                "reviewId": "C2F-ki40FZrwSWyE7BOICw",
                "author": "Sanjay B.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Good dumplings but way too expensive for what you get.  Everything comes in portions of 3 which is daft if there's 2 of you on a date...who gets the 3rd one....urggghgh...!!",
                "datePublished": "2015-12-07"
            },
            {
                "reviewId": "nDDnXxACTi4odW1BwGoLTQ",
                "author": "Apoorv A.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "They made us wait 20 minutes and said the food is no longer available. So we changed our order and after 20 minutes they came back saying sorry your food is not available and served us the bill. \nReally really unacceptable and rude service",
                "datePublished": "2014-08-10"
            },
            {
                "reviewId": "FttUqMP7XwqdQroXbWflBw",
                "author": "Kathleen G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great selections, lovely space, good service. I would go back again on a day when I had time to wander along Southbank,",
                "datePublished": "2015-10-19"
            },
            {
                "reviewId": "11Suxr7io_sBBbx5EfUfrg",
                "author": "Simon C.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Bad service and food! If you want real dim sum, just go into Chinatown instead.\nWe went for a friend's birthday on a Saturday afternoon. The manager was really rude to our party and did not seem to want to help.\nThe food is presented nicely but is nothing special.\nVery unlikely to ever go again.",
                "datePublished": "2014-03-25"
            },
            {
                "reviewId": "MIcfKcQhLxxGMOyDoFzlpA",
                "author": "Grant J.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Food was delicious. Service was the worst I have experienced in years. After ordering a drink, we had to remind wait staff twice of the order. It took 45mins for the drink to arrive. Comically unbelievable. Do not go here. Visit another restaurant in the area (I recommend arch duke), or a better ping pong in the city. The wait staff here need to be fired and replaced to save this restaurant.\nIf you do visit, do not sit outside. The wait staff seemed especially incompetent here as the manager could not see these tables. If you are being served by the bald man, leave immediately as your experience will be worse than terrible",
                "datePublished": "2015-06-06"
            },
            {
                "reviewId": "fmli15h_MlRk1kVk145mgQ",
                "author": "Rosie A.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "A run of the mill 3* from me for Ping Pong Southbank. Last night was my second visit to this particular dim sum establishment. We had to wait 30 minutes but we cracked open a bottle of wine upstairs in the cocktail bar so that was fine. \nOur waiter was really lovely and friendly, but a bit useless (ie lots of running around and flapping but not much actual doing). That said, I don't really mind crap service when someone is as nice a fella as this dude was, he made us laugh a few times and that's worth its weight in gold (we're cold as ice Kent girls). \nThe food was good, no complaints, nothing super special I'll warrant though. They forgot a few dishes which we had to nudge them about.  \nI know it's a really lame thing to say but I'm not really into the sharing tables The tables and benches are rounded, and ideal for a group of 8 or so. But for the 3 musketeers alone, nay so good.  With 3 or 4 groups ordering food and wine, there was no space for anything. The chairs don't have backs, which means if you chilling out for the long haul (we were there like 3 hours gossiping away) you're potentially going to be doing a lot of hunching over your table and my back was creaking by the end (I need posture lessons, must Yelp that next).\nIn short, I would go back if someone else really wanted to go. Else, I probably wouldn't.",
                "datePublished": "2013-09-04"
            },
            {
                "reviewId": "qaYrf1BWZJWFsYIjIUgSCw",
                "author": "Chris B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The dim sum is good and the service is usually fine. Lazy Sumdays (all you cut eat) is great, although I very rarely actually meet the charge (they charge you separately if so).",
                "datePublished": "2015-10-28"
            },
            {
                "reviewId": "2qMubTilIYWkxvrJ4u-b8Q",
                "author": "Sandy B.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Good food, terrible service. Our waitress was nowhere to be found, so I had to take my drinks to the bar to get my own refill. I had to walk up to the manager to ask for my bill after waiting for 20 minutes for the waitress. The manager did not care.  Worst part is they put a 12% tip on my bill.",
                "datePublished": "2015-04-12"
            },
            {
                "reviewId": "GT1g3eK9QFdBj9bc7b1FXw",
                "author": "Natalie W.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Ping Pong's dim sum just isn't very good quality or tasty. It's also too expensive. However, it's a nice looking restaurant in a convenient location on the South Bank so you're probably going to end up in here eventually. There's not much more to say really. If you want dim sum in Central London, I'd suggest New World in Chinatown.",
                "datePublished": "2013-05-28"
            },
            {
                "reviewId": "EfD2vQG1aLISOWXee4ft4g",
                "author": "Sally K.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I went with one of my friends when visiting the South Bank Christmas market and was pleasantly surprised by Ping Pong. This is certainly a chain that I'd visit again - the food is fine and I especially love that you can mix and match - and share - different dishes. \nWe went for steamed buns with vegetables, dumplings with shrimps and chive, dumplings with shrimps and coriander, dumplings with vegetables, spring rolls with vegetables, sticky rice with vegetables, and shrimp crackers.\nThe concept is that you fill out on the order card with all your favourites, hand it to the waiter so he can pass your order to the kitchen. Then the waiter returns with your order form, and as the food is prepared and arrives steaming hot to your table, he crosses the dishes out one by one from the list. \nIt's a great flexible system that can accommodate both snacky and havn't-eaten-in-days customers with the same ease as you basically tailormake your own menu. I love it so of course I'll come back!",
                "datePublished": "2013-11-28"
            },
            {
                "reviewId": "YMJLUWqElfzEbQb3nEsy1A",
                "author": "Jen L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Pingpong is a personal favourite and All you can eat Sumday is a treat! You really have to eat a lot to make it worth while financially, but that is just the kind of justification that let's you say \"we'll take one of everything!\". Great location for exploring Southbank",
                "datePublished": "2015-09-02"
            },
            {
                "reviewId": "_iFi5KIJ5alQG4zv4pjIhg",
                "author": "Daniel P.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Now I was EXCITED for this, more than normal when going to try a restaurant! Why, I hear you exclaim? Well I'll tell oh reader (channeling Miranda a little bit there). My FAVOURITE kind of food ever is Dim Sum. Little parcels of heaven, often washed down with a fragrant smelling tea. I and do LOVE tea.\nSo Ping Pong, known in my circle of friends as the upmarket chain dim sum restaurant of choice in London (we are working on a catchier title trust me!). This one is in prime location, South Bank. Also nice decoration and always busy, even upstairs at the bar. That tells me that Ping Pong is doing something right. So I went in with high expectations. A fragrant cocktail at a very reasonable price (hibiscus mojito, why yes I'll have more please) started the evening well. Then we attempted the dim sum. Drum roll please. Well, in my head anyway. \nThe Dim Sum was nice, good selection and tasty indeed. I felt slightly overpriced for what you were getting, especially considering Chinatown isn't a million miles away and hidden in there are some SUPERB cheaper places (if you know where to look). Don't get me wrong, a wonderful evening - don't go for a cheap meal (don't get dim sum if you want a cheap meal to be honest) but I would go again. Mainly for the cocktails, but considering this is my favourite kind of cuisine EVER I was satisfied. Yes readers, that is Daniel P and his high standards... ;)",
                "datePublished": "2013-08-27"
            },
            {
                "reviewId": "tkdJf0sqYYn5oJVsZgRFNg",
                "author": "Jackie B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I had dinner at Ping Pong with some friends while visiting from America. We enjoyed the atmosphere and the staff was friendly. The food was delicious - I chose from the preset menu, and everything on it was great. I didn't like that we couldn't make a reservation unless there was at least 6 of us, and they didn't bring us the checklists back, so we were unsure as to who ordered what some of the time. Overall, a great experience, and I would return when I'm back in the UK!",
                "datePublished": "2015-08-19"
            },
            {
                "reviewId": "OatdfD7U8IlEPIjW2-oCcw",
                "author": "Lindsey A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Second time at ping pong, first time in the one in the southbank centre... second time is a charm because I have just found out they do a all you can eat dim sum sunday menu for around £20!!\n the first time I didnt like it because I spent to much money and left hungry, but now im in love with this place and their extensive menu! cant wait for next sunday! loved the drinks... I had some non alcoholic drinks ie.. the Lemon and Lychee, and iced teas such as the lemongrass and passion fruit and lime... I loved them all. The lemongrass was amazing because it wasn't overly sweet and quenched my thirst and felt less sugar infused. All the dim sums where amazing im getting hungry just writing this.",
                "datePublished": "2013-08-25"
            }
        ]
    },
    "60": {
        "id": "NNcYBmtiZAhYPtWPH9ye1w",
        "name": "Ping Pong",
        "category": "chinese",
        "servesCuisine": "Dim Sum",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "South Bank, Southwark",
            "streetAddress": "Festival Terrace\nSouthbank Centre\nLondon SE1 8XX\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/qp2gHk4vfQlfyCcjIGmdwQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7960 4160",
        "review": [
            {
                "reviewId": "7ov6rYGe6rsjvpVzuHHm1A",
                "author": "Carl-Erik K.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This is the kind of place where I believe timing is essential to your experience. To me, it was busy and loud in all the wrong ways. Coming in on a Thursday night at 7:30PM, I immediately thought to myself that the noise level was way out of hand. Even though we were just three people at the start of the evening, I could not make out what the other two were talking about, even though they were sitting next to me. \nMy grumpy mood might have been affected by my hunger, because it was soon forgotten as  the food and drinks finally arrived. In short, the dim sum was all in all pretty good. Not mind-blowingly good, but for the price I was more than satisfied. The dim sums are a bit \"fusion\" - far from any classic dim sum restaurant in Chinatown, but they cater well to a Western palate with safe choices like honey glazed ribs and the like. No boiled hen feet on this menu ...\nAlthough you can't go wrong with the beers they serve, we definitely went wrong with the drinks. The mojito they serve, of which two of us ordered, was the worst I have had. 90% ice, very bitter, and not a hint of any booze in there at all. We ended up returning ours. We had a couple of others that seemed alright, among those a  passion fruit drink. All in all I just think drinks are not their forte.",
                "datePublished": "2013-10-27"
            },
            {
                "reviewId": "TgvrAFBfFwE1XM638q73Hg",
                "author": "Molly A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "In a word: YUM!!!\nI came here last week with some friends and we loved this place! The overall vibe is trendy, modern, and just generally cool. We arrived at around 8:15pm on a Tuesday night and the place was packed! With the promise of being seated in 15 minutes, we put our names on the list, took a buzzer, and decided to get a drink in the lounge upstairs.\nThe lounge is outfitted with plush seating and sleek wooden tables. While the space looks pretty, it's a bit impractical. The seats are quite low and packed closely together, which is inconvenient for my fellow members of Team Long Legs. Also, the lounge features table service, but there was no clear host/hostess on the night that I visited. I think my friends and I caused a bit of a kerfuffle amongst the staff when we 1) seated ourselves and 2) ordered drinks from someone who wasn't assigned to our table. Welp I don't feel bad because better service procedures would have avoided the confusion.\nWhen our buzzer finally rang 30 minutes later (!!), we returned downstairs to one of the circular family-style tables. Our waitress recommended that each person order five dishes. I'm not entirely sure how ravenous one would have to be to order that much food, but I was very hungry and very satisfied with two dim sum dishes, one rice pot, and a lite bite. All my items were delicious, filling, and well worth the money!\nThe one other issue that I had with Ping Pong was our waitress. Le sigh, here comes the classic \"bad British service\" complaint. But seriously, our waitress rolled her eyes at my friend when she asked for a different liquor in her cocktail, which the lounge hostess upstairs specifically told us was an acceptable request. Then when we asked to split the bill, our waitress handed us a pencil and told us to split it ourselves. I personally didn't have a problem with that because I assumed that doing the math ourselves ensured that everyone paid for their own items. After our waitress took the divided dim sum sheet from us, she returned with receipts that did not match the sums that we calculated for her. On top of that, she added 12.5% gratuity. I did not recall seeing a note about automatic gratuity on the menu. I would certainly expect that for a party of 6+, but not for 3 people! And certainly not for such mediocre service. We all paid it anyways because we didn't want to cause a scene. \nI think I'd return to Ping Pong for the food and the atmosphere, but I'd just avoid that particularly rubbish waitress.",
                "datePublished": "2013-02-03"
            },
            {
                "reviewId": "CBZQ4k1DojqK1YUtE5azLQ",
                "author": "Charlotte T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Yum! If you like dim sum then you'll love ping pong. Such a yummy dining experience. Ok so it's a chain. But the foods good the cocktails are great. Price is reasonable and it's great to share dishes with friends or have to yourself. Give it a go. Oh and they do all you can eat on a Sunday such a good deal.",
                "datePublished": "2015-03-20"
            },
            {
                "reviewId": "omW9fNKHjJDHtoXDSKCpfw",
                "author": "Kip D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is a good option for groups consisting of people with different dietery needs. Dishes are marked gf and vegetarian, and upon request they will bring you a list of what's currently vegan. The location is nice too, and I can it's imagine gorgeous in the summer to sit outside!",
                "datePublished": "2013-04-05"
            },
            {
                "reviewId": "KYKDeSnEUXqcGliwwL2aBQ",
                "author": "Elizabeth H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "First of all, if you want a true dim sum experience, there are better places in Chinatown.  And that says a lot.  You lose that authentic ambiance without the rolling carts bustling about.  Not to mention that the selection is missing a lot of the more \"ethnic\" gems.  I suppose much of this is to be expected given the clientele of the establishment.  *cough*cough* NOT ASIAN *cough*cough*  Ping Pong is more of a white-washed, fusion restaurant catering mostly to bland taste buds.\nWith that being said, if you look hard enough, you will be able to find some tasty options on the Dim Sum menu that take a few steps away from standard Chinese dishes.  Be prepared to use a lot of sauce to capture the flavor though.\n   ~ Five stars:  The Crispy Prawn Balls.  Superb, and unique.  A flaky and crispy shell with a thick, paste of a filling.  Pretty heavy.  These were the favorite of the night.\n   ~ Five stars: Hoi Sin Vegetable Puff.  Also a favorite, crunchy and light.  I could have eaten five more of these.\n   ~ Five stars: The Honey Glazed Spare Ribs.  So popular that night, that they ended up running out.  I was pleasantly surprised and would have ordered more if they didn't run out.\n   ~ Four stars: Steamed Sichuan Rabbit Dumpling.  Mmmm, rabbit.  This is a seasonal special.  The leanness of the rabbit paired well with the hearty steamed bun shell and syrupy sauce.\n   ~ Three stars: The Crispy Duck Spring Rolls.  It's actually an egg roll.  Still, I pretty much love anything with duck, so long as it's prepared right.  The Hoi Sin Sauce is obviously what made this dish delicious, but I also found the duck to be tender and flavorful.  \nNote that each selection comes in a set of three.  So if you're with a party of four, order doubles of each dish?  \nTotal came to around £11 per person for a group of three.  We ordered no drinks, except hot tea.  There is a \"Set Menu for 1\" deal priced at £9.95 per person that includes a single serving portion from 10 different dishes, but the selection isn't that fantastic.\nI'm used to putting up with bland food while I'm staying in London.  The taste buds here are atrocious.  And honestly, though most of the food selections were underwhelming, I was still pleasantly surprised with many of our selections.  Not to mention that Ping Pong is a frequented establishment for many of my friends.  \nWhile I'm sure that at any other time, I would have awarded Ping Pong with just three stars, I found the complimentary hot tea a nice gesture, the overall price affordable and decent, the atmosphere cool and chic, the service fast, the bathrooms clean, and the location convenient.",
                "datePublished": "2011-12-14"
            },
            {
                "reviewId": "f_MvGKq4JIpqGW1MofE82g",
                "author": "Jennifer W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "My boyfriend and I have never had Dim Sum before and many of my friends were ranting and raving about how incredible Ping Pong was ! Being we were near Southbank last night, we figured we would give it a try. The food was absolutely delicious, but the service was a bit poor. There had to be over 5 waiters waiting on our table. We ordered from the set menu for 2 and the food did not come in order. It was crowded and a Saturday night so of course it is going to be busy. At one point we thought they forgot about us. We got complementary tea and coffee from them for being so patient. \nI would definitely go back but I would like to try Ping Pong in a different location to see if I have a different experience !",
                "datePublished": "2013-06-16"
            },
            {
                "reviewId": "K8w7l2NsMsihlnHowbBteQ",
                "author": "Hanni Y.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Good service. All the waiters and waitresses are nice. However as a Chinese from Canton I have to say, the dim sum here is not good. There are a lot of English-Chinese dim sum. We ordered some classic dishes like Ha Gau and it is not salty enough. It's not expensive but I won't go again.",
                "datePublished": "2015-03-07"
            },
            {
                "reviewId": "6bkYI4SMLWWGZELKCnF2Tg",
                "author": "Laura H.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Awful! Dined here twice (second time unavoidable as bday party) and just terrible. The food is second rate P F Chang quality at best, and Panda Express at worst. Not what I was expecting considering its trendy rep and classy ambiance. Very expensive and while the host was charming both times the waiting staff acted like they couldn't care less.",
                "datePublished": "2014-05-12"
            },
            {
                "reviewId": "lSjuzCeal2GlPyKUvYSRmA",
                "author": "Qype User\n afello…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Really love this restaurant. Like a wagamama you sit at tables with other people and get to enjoy the bustling atmosphere as it is always busy.\n Amazing dim sum with dumplings that look like clouds and taste even better.\n You do need to be a non-fussy eater and possibly lover of fish, as the menu is quite fish heavy as well as being dumpling heavy.\n Fresh lemonade with your choice of syrup/fruity flavour is excellent and the flowering teas are amazing!\n Really great place to meet friends for lunch or dinner. Even better if there is a bigger group of you!",
                "datePublished": "2011-04-29"
            },
            {
                "reviewId": "-E4JpHjugE0y1qlHk0utuw",
                "author": "Will R.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Not as good as the original. Food was fine but much more touristy. Probably partly due to the area it is in. Spend the time to search out the original or one of their other venues.",
                "datePublished": "2014-09-12"
            },
            {
                "reviewId": "Y1SkX0DVPwxZrkPOuDO8TA",
                "author": "Sal A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "My first time at a Ping Pong. We had to wait a bit to get a seat so we sat at the bar and waited for a long while to get served- you may need to accost a waiter to get a drink, they seem a little \"toff\" biased.\nHowever, we chose 3 dishes between the two of us, from a VEGAN menu- yes folks, I was really impressed that they had a seperate menu, awesome huh? That's pretty much why I rated high, because I found the food to be really tasty, especially the vegetable-y rice packaged in leaves, and the mushroom parcels. Although, the 3 dishes between us and 3 drinks came to nearly £30, I went home and devoured a sandwich. For a solo meal, perhaps 2 dishes would be ideal as you get 3 bits of each so you can share.\nAnyway, great food, slightly squished seating, the toilets were clean and smelled LOVELY (a bit like bubblegum), and the service was fairly slow getting the order and paying but not sniffy, just busy although the food arrived nice and quickly!\nThe flower teas are beautiful, and if you live in East london near Shoreditch, They even deliver- lucky!",
                "datePublished": "2009-07-09"
            },
            {
                "reviewId": "l5gff07s8ktMmbbfPxWYCw",
                "author": "Natalie P.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I'm a fan of Ping Pong but this is not my favourite branch of the chain particularly due to its location which goes for and against it. \nThe food and drinks are delicious, like in all branches of Ping Pong, and we went recently for the Sunday buffet for £18.99 which was fantastic value if like my friend and I, you believe you can eat your own bodyweight in dim sum and still walk out as if you've eaten a light salad! I've never known defeat like it. \nWhat lets this branch down, though obviously too is a plus, is its location on the busy  chain & tourist fest that is the Southbank. You cannot book, so on one busy Sunday we were turned away, and they are always busy so you have no other choice than to savour one of their delicious cocktails; juices; wines in the bar while you wait. You also need to be prepared to be seated with others while you dine. Sometimes this doesn't bother me but when you are trying to eat your own bodyweight in dim sum and you and your friends want an adult conversation, you'd rather it not be listened in on by tourist's and their young son! \nThe staff were friendly and the service was good / quick considering how busy it was but I would rather not return to this branch.",
                "datePublished": "2012-04-07"
            },
            {
                "reviewId": "S1QkE287JluGu3b3zrOeaA",
                "author": "Michelle B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Loved Ping Pong and plan to return on our next trip to London. I will admit I come from Southern California and we don't have awesome dim sum, so my comparison might be poor, but I thought this dim sum was great, on par with what I can get in the Bay Area, maybe better. We waited about 20 minutes which wasn't bad at all. Price seemed very reasonable. Service was pleasant, our server made some suggestions when asked for that were all happily accepted and enjoyed when served.  And we didn't feel rushed which on a Saturday night is very appreciated. I hate it when servers try and rush you out so they can get their next table, if I'm still drinking they will still get money. I was very happy overall.",
                "datePublished": "2014-09-13"
            },
            {
                "reviewId": "eE9VTnnQg2Z_tn0iJnSnPg",
                "author": "Murray T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I'll keep this one brief:\n- Good selection of dim sum, but expensive.\n- Great cocktails.\n- Fast-paced, busy atmosphere.\nOn Sunday they do a £20 all-you-can-eat deal.",
                "datePublished": "2011-03-14"
            },
            {
                "reviewId": "_ZGZi3kEN1m9StUD2jBqSg",
                "author": "Sophie E.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Delicious Dim Sum. Would heartily recommend the set menus, as they do provide enough food for oen hungry person. But if you're really hungry, add a few items from the main menu. The Honey Chicken rice pot (can't remember the precise name) is absolutely delicious!\nOh, and if you're thirsty, consider ordering a tea. They are served in lovely insulated glasses, and you can get one of the blossoming one, making for a beautiful slow motion show while you eat.",
                "datePublished": "2012-05-02"
            },
            {
                "reviewId": "XOmVRNZPsWXN9QS7pHUniA",
                "author": "Katie B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I am torn.\nMy Chinese half says: \"WAY OVER PRICED!\" Literally double the price of eating at some places in Chinatown London. And more like 2.5X the price of dim sum in LA/Boston/San Francisco/NYC. This same half of me, usually hates nice, pricey Asian places on principal and prefers hole in the wall cheap stuff with good food over good/cool/any discernible attempts at atmosphere. \nMy white side says: \"But, but... its pretty! And there are no chicken feet or weird innards to order around!\" Plus, my non-ethnic eating/vegetarian friends might actually try this. Did I mention that this side of me is also a HUGE sucker for anything chic Asian fusion-y? Plus they DO have some interesting, non-traditional dumplings to try... Ok?\nApparently my less practical side wins on this one. FINE. I'll pay double for your cool atmosphere, Ping Pong. But I won't like it!",
                "datePublished": "2011-03-04"
            },
            {
                "reviewId": "roFMzmU3aS_y55mH_STAHw",
                "author": "Stephen L.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Having lived in Shanghai and visited many Chinatowns in cities around the world...Dumplings here were average at best.  They lacked the differentiating flavor one expects when you take your first bite.  Bland fillings wrapped in a dumpling.  It took 25+ minutes for 3 of 4 of the items I order to arrive at my table.  Worse, they brought me a check before the fourth item I ordered arrived.  Good concept, but poorly executed.  Dumplings were temperature hot.",
                "datePublished": "2015-07-20"
            },
            {
                "reviewId": "ghc_dgObUUE2itPIb8fRKg",
                "author": "Lysh J.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Its a shame to give Ping Pong only 2 stars but its not for the dim sum, its for this branch. There are not enough staff, and the staff that eventually do server you are incompetent. The service is really slow and they never have anything left to serve you from the menu. There are better branches around london to experience the tastiness of Ping Pong's dim sum. I would recommend the branch at St. Katherine's Dock - It is quieter and overlooks the dock at Tower Bridge - Romantic!\nDishes to try, are everything! Ha ha! To be honest, you are really spoilt for choice, however, I would recommend:\nHar Gau\nFish Dumpling \nSpicy Braised Beef Coconut Rice Clay Pot\nCrispy Hoi Sin duck roll\nSpicy Seaweed Prawn Crackers\nVegetable Won ton soup...\n... and NOT forgetting Hot Sake.\nDon't let the crappy service and experience at this branch put you off of going back to Ping Pong in the future. As a general improvement, I would like to see more staff and better opening hours for all Ping Pong branches as the opening hours vary due to the location.",
                "datePublished": "2010-12-27"
            },
            {
                "reviewId": "zNiiU8QRiylczmTv13t1ig",
                "author": "Hannah R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "There are not many places in town where you can write directly on the tabletops of a restaurant.  Ping Pong does not make exception to this rule.  It does, however, defy another semi-truism about London:  It is not always easy to find a delicious meal in a good restaurant for reasonable price.  \nMy family and I ate lunch here.  We were sat at a tale with some other guests - a move I always find cozy and quite conducive to friendly feeling meal.  (Conducive that is unless you are sat next to the Adams Family or Stalin.)  The decor was a zen sand garden, rocks of tables place gracefully among carefully raked sand.  \nMy family and I ordered a variety of dishes as one often does in dim sum.  Some steamed dumplings with prawn, some veggies with spice wrapped in something quite nice made of rice), soup, steamed rice, and more.  All items (soup excluded) came in sets of three like the Triplets of Belleville.  We were more content than a hoard of otters playing in the water.  Everything made our stomachs cry out with joyous choruses of \"hallelujah!\".  \nOur soprano, mezzo soprano, alto and baritone converged into a chorus golden as Orpheus strumming his lyre.  The bill came to about 7 or 8 per person.  We didn't eat heavy, but we ate enough, and walked out light on our feet.  \nThe only deceiving aspect was that no paddles and ping pong balls were provided as a diversion.  Guess I'll have to bring my own next time.  Think they'll mind if I run around the restaurant smacking a small white off the wall?",
                "datePublished": "2008-12-31"
            },
            {
                "reviewId": "OiocsDEu-nPog9CmYIaUmg",
                "author": "Duncan M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I love the style of ping pong restaurants. They are really nice to look at and well staffed. It is expensive for what you get, but can be convenient for a light dinner. Dim Sum is well made and tastes good. I would prefer more choice. Offers loyalty cards which gets you some free nibbles. This place charges 12.5% service",
                "datePublished": "2012-01-18"
            }
        ]
    },
    "80": {
        "id": "NNcYBmtiZAhYPtWPH9ye1w",
        "name": "Ping Pong",
        "category": "chinese",
        "servesCuisine": "Dim Sum",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "South Bank, Southwark",
            "streetAddress": "Festival Terrace\nSouthbank Centre\nLondon SE1 8XX\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/qp2gHk4vfQlfyCcjIGmdwQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7960 4160",
        "review": [
            {
                "reviewId": "KzlO5ToJxBYtWTWcdBWH0g",
                "author": "toussaint d.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Never in the history of Dim Sum have such small parcels of food been so expensive to eat for so many.\nI made the mistake of going here with the family on a Friday evening with no reservation.\nThey found us a table quickly to their credit as the place was rammed. The service, despite the pace of the place was commendable. Fast, friendly with no fuss. \nMy biggest complaint was the food: way too expensive for what it was. \nAs a steamed dumpling fiend, the chicken Shu Mai hit the stomach in the right place and in truth, there's something here for all tastes. Thing is, though there's lot of different things to eat, there isn't a lot to eat.\nCall me old school but i like to have a lot of Dim Sum on a few plates, rather than half a dozen platters holding three so-so parcels each. You'll eat but you won't be getting satisfied any time this side of the Rapture. \nPing Pong's all a bit too sanitised and lacks surprise. As for the drinks make sure you actually receive liquid rather than a tumbler full of ice.\n \nConsidering that there was no alcohol involved, the best part of one hundred pounds for a meal, after which i felt hungry again wasn't a good advert for the popular chain.\nThe saving grace i guess was the location, on London's perennially busy South Bank but you can't eat a view can you?",
                "datePublished": "2010-11-14"
            },
            {
                "reviewId": "IEcywOYPNv9g2ZPtds33Jg",
                "author": "Helen C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I hate Ping Pong. I hate its greasy little fancy 'round' prawn toasts (which just means bread got thrown away, which is a shameful waste). I hate its stupidly expensive menu. I hate that its pork buns aren't as good as any in Chinatown. I hate waiting ages for a table with rubbish bar service in the meantime. I hate the haughty waiting staff. I hate that it seems to have invaded London. I hate that it is so easy to go here, the bill always shocks me, and I feel dirty handing over my money. \nI really like their bubble tea-style champagne cocktail. \nI am weak.",
                "datePublished": "2010-07-20"
            },
            {
                "reviewId": "LUBPkJyxequUGIrl1bWvGQ",
                "author": "Sophia M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "ended up in this restaurant on a hot, sunny and busy saturday afternoon during the summer when there was a culture festival going on on the south bank. \nit wasn't our first choice at all but it was super busy everywhere else. \nthe place was nice inside, really trendy will cool round tables which i like so you can see everyone. the menu is interesting will the tick boxes and the little pencils so you circle what you want, it's fun but it's kind of gratuitous - like being cool and being simple, though actually it's kind of annoying in a big group because no one could decide what was going on! maybe a smaller group would have been easier. \nthen the reason why this is only 3 stars is because even though yes the food was alright it was very expensive and tiny portions. not cool with me! but hey! That's london!",
                "datePublished": "2014-01-29"
            },
            {
                "reviewId": "snJF1LD0F0fqjM2Cthk3mA",
                "author": "Susana P.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "If I were to rate Ping Pong on their interior design I'd be giving them a 5 but I'm sorry to say their food is overpriced for what it is. \nThis restaurant is beautiful and the drinks are fantastic which brought my rating from a 2 to a 3 star. \nThe service I received at the restaurant was ok, and the food was adequate.  In the past year they have changed their menu, and to be honest their old menu was better.  \nOur food arrived quickly and it all tasted good, their dessert menu isn't fantastic, so you might have to follow on somewhere else afterwards :) \nIt is quite expensive considering you may not leave full. \nIn my opinion there are much better Dim Sum places in China town.",
                "datePublished": "2010-05-04"
            },
            {
                "reviewId": "wKVzfszUtXhsGeBcwbRzfQ",
                "author": "Chloe D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "It's taken me years to finally make it to Ping Pong. Don't ask me why -- I've seen it around town and always meant to go, but for some reason I was never able to get around to it until yesterday. I'll set the scene. Its a frightfully Grey and painfully cold Monday. My Monday morning blues are immense and the vibe at my office is bleak, so my colleague and I decide to head out for some comfort food on our lunch hour. We headed for Southbank and the genius revelation to make this the day that I visit Ping Pong for the first time came about. Upon entering we were greeted by a lovely hostess who took us to our table and informed us of their lunch offer. £8 for an 8-item set meal plus a signature tea drink. Amazing and yes please! We placed our orders and I could feel the Monday blues leaving my system immediately. 10 minutes later we were surrounded by a plethora of food. For a mere £8 we each got.....4 steaming hot sticky chicken and prawn dim sum balls, sauteed mushrooms, steamed broccoli, hot and spicy chicken won ton soup, a steaming bowl of honeyed chicken breast and rice and a bottomless flowering green tea. By the end I literally felt like a Dim Sum. I was stuffed to the brim, happy as a clam and....ready for a nap. Sadly, we had to head back to the office, but my £8 delight definitely kept the spirits up all day. \nOur waiter was so lovely as well. He was extremely helpful and attentive and made our meal that much more enjoyable. \nThanks Ping Pong! I'll most certainly be back...but I may have to skip breakfast next time around!",
                "datePublished": "2013-03-26"
            },
            {
                "reviewId": "uUKF6DaFe6AE6zth6UwCpg",
                "author": "Paul G.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Hmmm. Good idea, and nice and buzzy. Reasonable menu, with a few unusual dim sum, although portions are smaller, and prices higher, than Soho. But it's still good value  our lunch for two was £32 with flower tea, four dim sum and pud. Forget the tea with a flower  looks ok but not as nice as proper Chinese tea. I have enjoyed two meals here, but won't be deserting my Soho favourite  Joy King Lau.",
                "datePublished": "2013-04-02"
            },
            {
                "reviewId": "R3uN8Ov7J9uhtKV2TrsfvQ",
                "author": "Sami C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Best dim sum I've ever had? No, probably not. Fun and enjoyable afternoon with good company and tasty food? Yes, definitely!\nOn arrival at Ping Pong, I was nervous that the table that I'd booked for 10 people late last night online via the Ping Pong web site would not be available since I didn't receive an email confirmation. But I need not have worried since as soon as I arrived and asked about \"my reservation for 10 people\", we were whisked upstairs to the lounge/bar/dining area. I have been to this branch of Ping Pong once before, but hadn't realised that there was an upstairs area. However, I was very pleased by this as a) there was only one other group upstairs besides us; b) it was much quieter which allowed us to chat to our hearts' content; and c) the sofas were much more comfortable than the benches downstairs albeit slightly lower. At this point, a big tick for Ping Pong's technological advances and wise decision about seating allocations. \nWe ordered our drinks (all choosing fancy teas of varying fanciness - my favourite of the ones I tried was the lychee and ginger iced tea cooler, which was very refreshing) and settled in to analyse the menu. Another tick for Ping Pong on a special occasion for the wide range of teas that we don't normally have when we go for a traditional dim sum meal.\nThe girls chose a selection of dim sum for the group, which the boys promptly tripled... The food arrived quickly and was served hot and fresh. The flavour complemented each other well - I love Ping Pong for the variety of unusual combinations (like black prawn dumplings). My only criticism is that the steamed dim sum were a bit too sticky, which meant the skins broke and the contents spilled out. We were also slightly disappointed that they did not have cheung fun on the menu. But decent quality food all in all. \nWe also had desserts - the Ping Pong sampler, which I won't describe in detail as it would spoil the surprise - but each mouthful was was delicious and only made you want more. I'm glad I managed to squeeze in dessert!\nOverall, we had a great afternoon - great company and lots of food. However, I think it is over priced (in my opinion, you can get much better traditional dim sum at a very reasonable price), but you do get the more unusual/fusion combinations (like scallop and shitake dumplings, duck spring rolls or seafood pastries). That said, we got what we paid for - a slightly different, very relaxed lunchtime gathering of friends.",
                "datePublished": "2010-01-17"
            },
            {
                "reviewId": "Zw8afwkCF3CpIaFlSZMUNQ",
                "author": "Qype User\n hedgie…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Ping Pong opened the last year I was with my old company, and we had our departmental Christmas dinner at the original branch opposite the London Palladium. It was packed solid, and I remember it was difficult to get a booking. I had the day off due to moving into my new home that day and met my shortly to be ex-colleagues for what was a very fun evening, with delicious, madly affordable food served in a gorgeous setting. My boss managed to give me no sign I was to be fired right after Christmas.\n My fondness for Ping Pong survived this incident and I went back with my now ex-colleagues (minus the boss) for a catch-up about 6 months later, after the legal wrangling was completed. Again, it was fun.\n And I've been back subsequently with very different crowds  once with my houseguests in the summer, after a performance of The Sound of Music at the Palladium, and last week with my brother and the niece and nephew after our Royal Society lecture.\n Both visits were great. I think my older guests enjoyed themselves  the Jasmine tea is always a show-stopper  and they are the type of older visitors who appreciate an experience of 'trendy' London. The dim sum were duly demolished while friendly banter was exchanged with a couple down from the North at our communal table.\n Some critics have sniffily compared Ping Pong to Hakkasan and Yauatcha. I think the Ping Pong dim sum stand up very well, considering Ping Pong is aiming at a completely different market: mostly the post work crowd; with the dim sum hoovering up alcohol consumption.\n The trip to the new branch at the Royal Festival Hall on the South Bank was a wonderful half-term family treat. We arrived just after 8pm, me thinking innocently that there would be a lull as punters left for performances at the Hall. Ha ha ha. The place was hopping, with a queue snaking out the door. We were told we had a half-hour wait but would shortly be moved into a bar area. I asked if the kids could have a snack while they waited, and my brother started complaining we couldn't wait 30 minutes with the children 'at this hour'. I mentioned there was an EAT around the corner  but my nephew bridled at this (EAT is clearly their default pit stop in Cambridge). Also, he had spotted the Chinese script on the ceiling and wanted more.\n We were asked to hang on for 5 minutes and a table was magicked up for us. I was really impressed they even bothered, considering they had flocks of people to spare. Service was brilliant and slick, and the dim sum arrived smartly. Stand-outs were the Har Gau and the squid in satay sauce. The Jasmine tea blew the children away  my little nephew thought it was an alien pod hatching.\n The dim sum are keenly priced for such a glam atmosphere  the most expensive item is £3.99: each menu item comes with 3 portions, allowing easy sharing. My nephew had a series of lemonades with fruit 'shooters'  these were as phenomenally beautiful as the jasmine tea. My brother and I stuck to G&Ts  quite fabulously delicious. These were Tanqueray but on a completely different plane to others I have had recently. 3 G&Ts = half the bill for 4 (12 courses) : £67 including service.",
                "datePublished": "2011-01-29"
            },
            {
                "reviewId": "gGjvC_ep5GwNgb6htyxk8g",
                "author": "Leila A.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Went to Ping Pong last night with a couple of friends. I'm quite a fan but they've certainly gone down hill recently.\nNow we hadn't booked a table and I do have to commend them on getting us seated pretty quickly on a busy night. However, we were told to go upstairs to the bar where we then had to queue for a table. Being in a queue because we're already in another queue really isn't great.\nWe were called pretty quickly but were unfortunately sat outside on one of the coldest nights of the summer so far. They wouldn't switch the outdoor heaters on so we spent a good part of the evening shivering.\nThe food we chose wasn't bad at all but nowhere near as good as what I'd had before. The pork buns were a delight as usual but the rest wasn't much to write home (or a review) about. Much of it was fairly tasteless and much of it all tasted the same. Was it chicken, prawn or something entirely different? It leaves you wondering whether they've labelled the boxes not because people don't know what each piece should look like but because people need help identifying it when they've got it in their mouth.\nDue to the cold we all drank tea to try and warm ourselves up and I had to admit that the lychee tea is rather lovely. The cocktails did look lovely and most are priced around the £6 mark so definitely worth a shot if you're sat out not in sub-arctic conditions.\nThe bill came to £45 between three of us which wasn't too awful although I did have to buy a bag of crisps on my way home to keep my stomach quiet.",
                "datePublished": "2010-07-29"
            },
            {
                "reviewId": "dS4GhPxPWgsrxbsymCOYCQ",
                "author": "Jessica O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I had no idea that this was a chain (you'll see my other experiences with London chains soon - ugh) when my Aussie pal brought me here fo cocktails and endless rounds of dim sum. Being from Vancouver, where Chinese food is practically the local cuisine, I have high standards for my dim sum, and I (mostly) wasn't disappointed!\nThe decor and menu were interesting, and we ordered round after round of the yummy dim sum - 10 orders and prawn chips between 3 of us. \nFavourites included the crispy prawn balls (we ordered a second round of these) and the shu mai. The crab spring roll, shrimp har gow and prawn and shitake dumplings were also delicious. \nFor me, the only miss was the veggie steambuns- wayyyy too sweet for my taste.\nThe cocktail list was fresh and inventive - I tried a fennel and apple martini, a basil, lemon and black pepper martini and a vanilla vodka lemonade that tasted like Lucky Charms. Yum! Just one question - when we order mixed fancy fruity cocktails here in Vancouver, they are generally made with 2 ounces of liquor, but I am sure that these were just made with one. I noticed this a few other places in London - is this standard?\nThe service really petered off by the end of the night - in order to make this a five star experience the wait staff really needs to keep the standards high thoughout the whole night. \nOn the whole, give it a try!",
                "datePublished": "2010-09-15"
            },
            {
                "reviewId": "Wrk9L04JwoxJsTXnz2QwJQ",
                "author": "Minal P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Besides the weird anomaly of having a great Mojito in a Chinese restaurant, there is nothing out of place at Ping Pong. Its stylishly designed over too floors, and upstairs is a cocktail lounge bar where you can meet friends before your meal. \nThe service is very fast, and the dim sum is deliscious. This is a great place to meet a large group of friends - the circular tables allow you to see everyone at the same time. And you can share a large variety of food, and get pleasingly sloshed on the excellent cocktails before taking a short walk along the river to watch a movie. Low lighting and candles make it a good romantic spot in the evening too.",
                "datePublished": "2008-11-21"
            },
            {
                "reviewId": "oLfTSIs9YqWQSm4s7qmgmA",
                "author": "Chris G.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Smack on again Yelp, this place is !-OK. And that's it.  \nThe prices are on par for what you get, it's not expensive per se (we paid 25 pounds each for 2 beers per person and dinner), but that was made  Our German server was hot and cold -- he made some decent suggestions for our meal, but for some reason was unable to pull off little things like bringing water and utensils and had to be asked no less that three times for each of those.  It was slightly upsetting when the bill had a customary 12.5% service charge and we felt that the service had been lacking, but as this was a first meeting for the lot of us no one felt they should complain about it. \nNext time my friend, next time.  \nNah, who am I kidding?  With all there is for me to hit in London, why have a next time at a 3/5 restaurant :)",
                "datePublished": "2011-02-15"
            },
            {
                "reviewId": "4kRBFJ2YaBRmsEKJoqKGfA",
                "author": "Emily Z.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great Place! Very nice people/waiters. Food and Cocktails are great! :D I keep going back for more",
                "datePublished": "2013-01-01"
            },
            {
                "reviewId": "9ES_OB48453J3QOcF6n1HQ",
                "author": "Misty S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Ehhhh.....\nThis is my first time getting Dim Sum anywhere. I live near Boston and Chinatown has its fair share of dim sum but i've never been brave enough to order. Colleagues highly recommended Ping Pong (which I kept calling Polka dot all day.. but that's neither here nor there). I went here with high expectations and left somewhat disappointed.. and 50.00 poorer.. and kind of hungry still. \nHubby and I shared 8 plates and each got soup. My soup was the best part of the meal. I got the hot & Sour soup- flavorful and spicy and very good. For food we got the mushroom oyster (not great), the spicy pork dumplings (decent but really mushy), black bean pastry things (awful, tasted like burnt pie crust), black seafood dumplings (extremely good, but small- order a few!), prawns wrapped in shrimp (ok, but  lacking much flavor), sticky rice wrapped in some kind of tough leaves (not very good), Crunchy spring rolls (good, but standard fried food) and squid cakes (just ok, nothing to write home about). \nEach plate was somewhere between 3-4GBP. altogether we spent almost 50.00 and i left still pretty hungry but not wanting to spend anymore money on food there!\nAtmosphere was nice. Probably wouldn't go back though.",
                "datePublished": "2010-02-15"
            },
            {
                "reviewId": "0UT7nsD2kO0zCHsAm7CVuA",
                "author": "Mark L.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Ping Pong South Bank, I have fallen out of love with you.\n I used to really love this place. The food, the drinks, the decor and ambience. All top-notch.\n I went here on Saturday night - I've been there when it's been busy before, and it was fine, but this time around we should have seen the warning signs when we were handed one of those stupid pager things that Student Unions hand out if you're waiting for a burger and chips. After waiting for a table in the bar, we then had to literally wave at the waiters to get somebody to take our drinks order.\n When we eventually got a table to eat at, we discovered that a lot of food on the menu was 'not available' - much to our disappointment. The food, when it arrived, was delicious as ever, but then when the mains were finished, a bill was whacked down on our table, without even asking if we wanted dessert or tea, seemingly in an attempt to turn the table around quicker. We were given a dessert menu after a request... but then had a bizarrely epic wait to get the bill at the end.\n What used to be a great restaurant is now swamped and understaffed on busy nights - leaving yourself up against a bizarre conflict of staff who one minute seem desparate to get you out of the table, and the next are impossibly hard to get ahold of in order to take orders / provide service. Dining is supposed to be relaxing, not leaving you stressed at constant efforts to get the attention of staff, as you squeeze around a communal table that is simply not big enough for the food of all of the dining groups.\n At £75 for 2 including service, it ends up leaving me with a horribly nasty taste in the mouth. The food was great, but did I have a pleasurable dining experience? Not in the slightest. The staff tried their best, but there just wasn't enough of them.\n I would not go to the South Bank Ping Pong again, at least not on the weekend. I think I'll be returning to a quieter branch in future...",
                "datePublished": "2010-03-01"
            },
            {
                "reviewId": "zd2EoKu7PQHEyNs9ekuoPQ",
                "author": "Laura N.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Ping Pong puts the dim in dim sum.\nWhile I wish I could credit this, um, lil' 12 location establishment with a winning game of tasty morsels of steamed delicious, it was more like a continual back and forth match of disappointment. Nothing was absolutely terrible, but first there was something off with drinks, then service, then texture, then service, then salt, then service, then, then, then... and so went the head shaking evening. The meal was just uncomfortable, even with fantastic company. \nI take it back, there was point of absolute terribleness: the toilets were disgraceful. It's the first time here in London that I've felt the word \"toilet\" aptly described a bathroom.  \nShame too, because I was the female Ping Pong champ throughout school. I have a deep love for the game.  Guess you just didn't come to play.",
                "datePublished": "2009-06-17"
            },
            {
                "reviewId": "3y80ecSIO5jeZdNJE3mTrA",
                "author": "Mei L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Expensive, swankified dim sum is nearly always a disappointment. Ping Pong is no exception.\nImagine a huge restaurant filled with bustling carts piled high with steamers chock full of plump dumplings, plates of just sauteed vegetables, dishes teeming with crispy fried squid, pushed by no-nonsense ladies who don't speak English and cut your taro root with scissors in front of you at your crowded, noisy table of 8 people about to burst with tiny dishes. Makes me hungry just thinking about it. \nPong pong is nothing like that. Portions are small, the decor is trying hard for a lounge feel, and they serve pricey martinis. But even if you really want a chichi martini with your pork dumplings, at least those pork dumplings and those martinis should be good. And you should get more than 3 in an order for a dish costing over £3.\nI realize I have high expectations for Chinese food, particularly dim sum. But this place is a perfect example of promoting atmosphere over taste and charging way too much for something that is designed to be cheap and delicious. If you're not going for the food, maybe you'll love it!",
                "datePublished": "2009-08-05"
            },
            {
                "reviewId": "qJiChknjVKKf-ez761maiw",
                "author": "Rana M.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I was in London town recently and concluding a lovely early evening stroll along the Thames we decided to try out Ping pong. \nI desperately wanted this to be good, with a quirky name and an inviting seating area outside, we decided to give it a go. The result was a very uncomfortable hour after which we were left with nothing but a bill, regret and a stomach asking why oh why did you put me through that. \nThe food simply wasn't up to it. It lacked taste. The steamed rice might as well have been from Tesco's or Asda. I was left not just disappointed but slightly angry at the cheek of serving such mediocre food.  Luckily London saves the day. The day was so enjoyable this mishap didn't make too much of a dint on the old mood.",
                "datePublished": "2010-06-14"
            },
            {
                "reviewId": "cJ2ivQUQPByT0Kj3jT8qXQ",
                "author": "Taras N.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I went to Ping Pong last Sunday with an open mind and bear in mind I've had Dim Sum only once in Chinatown as a reference.\n Ping Pong from the outside looks nice and impressive. Equally the décor seemed okay inside.\n Being two of us they did ask if we wanted to sit immediately if we didn't mind being in the sun. It was absolutely fine I add.\n We considered the Unlimited menu but wondered whether we'd really eat that much bearing in mind the price of £18.79(?) does not cover drinks and some items of the menu.\n Ping Pong do Dim Sum and they do it well. The two most memorable ones were the Black Prawn steamed dumplings and the one with Turmeric. I notice they sell them as three's so one each and then you have to split the third?\n It's not all perfect: I found a piece of clear plastic in my mouthful from one of the Claypot selections.\nI knew I had to highlight this and the waitress quickly said she would get the Manager who apologised and offered us a couple of glasses of wine on the house.\n Prior to this episode, the first steamed Broccoli that was delivered to the table was like mush and was sent back. The second one that came was exactly the same. More about this later.\n We hadn't had breakfast and ate quite a lot, more than we needed to. If we had gone for the Unlimited, we'd have made a small saving each - say the equivalent of one dish so be certain you are going to eat a lot.\n I thought the set menus looked good and took a lot of hassle out of what to order. Any feedback from others on their value?\n Back to Broccoli: When it came to paying I pointed out to the Waitress that the Broccoli had been mush. She just said sorry.\nThen whilst waiting for the other half near the exit the Manager came over to say goodbye and we had a little cordial chat. He asked me if everything else was okay and I asked how the broccoli should have been served. Apparently crispy (with a bite).\nI told him about mine and in reply he told me how hard it was to monitor so much being steamed especially on a Sunday.\n Is that a reasonable excuse? I don't think so. I rarely have fault to complain so never too sure what to expect when I do - not that I was on the Broccoli - I was giving feedback though I should have mentioned that £3.79 for a tiny portion of steamed Broccoli is a rip-off.\n Will I go again? I think I'll give it a miss and find that place in Chinatown.",
                "datePublished": "2009-11-16"
            },
            {
                "reviewId": "hGgcIDKReCJXHGNrTRE5Fg",
                "author": "Matt J.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Ooooooh dear. This really didn't tick the \"tasty dim sum\" box this evening.\nThe main problem here was service. It was *appallingly* slow and inattentive; I literally had to thrust my order into one of the waitstaff's hands in order for them to actually notice we were ready to order and take it. Not good at all. While the food came reasonably quickly afterwards, there was complete failure to clear empty dishes, and we eventually had to ask (twice!) for the bill.\nThe food was merely okay... yes, it was dim sum, but not exactly good dim sum. Their interpretation of bao was undercooked, their jiaozi were quite good but also slightly undercooked, the prawn toasts reasonably good, the wonton broth rather gritty and tasteless (although the wontons themselves were fair)... you get the picture.\nFortunately, the company I was with saved the evening from being a total disaster -- along with the actually quite acceptably tasting (but VERY weak!) cocktails. It's not worth the premium they charge though, I'm afraid. Overpriced, ineffective dim sum -- there are better places to go in London!",
                "datePublished": "2009-06-29"
            }
        ]
    }
}