{
    "0": {
        "id": "H2hMVEI0OM2k5c0v1iBoag",
        "name": "Four Seasons",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "12 Gerrard Street\nLondon W1D 5PR\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6JLOFSkm-1Y1tLgYh9odbQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7494 0870",
        "review": [
            {
                "reviewId": "M_wpHrUOIq1eNp-5V0JDxg",
                "author": "David B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Gerrard Street is where the real Chinatown restaurants are.  (The tourist traps are a block over on Lisle Street.)  This one is said to be renowned for its bbq duck, though I noted that a number of its neighbors also featured that prominently.\nWhat's great about it here is that, if you're a solo diner, you can get a small quantity.  There is, for instance, a lunch rice plate that comes with 1-3 bbq meats of your choice.  I found the duck excellent, juicy and crunchy without being in the least bit gamy as duck often is.  I also had spareribs which were a little dry.",
                "datePublished": "2018-06-04"
            },
            {
                "reviewId": "YDK1yaYwyfzUHG1JIildyA",
                "author": "Kel P.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "The worst service one can possibly have. It's hard to fathom how such customer service can suffice in this day and age. Have it enough chances, think they don't deserve another. Essentially not only do they rush you to order, they also kick you out before you even finish your food.\nFood is just a 3 star I'd say. Not bad but nothing outstanding. Price is high however and way to high for the service they provide.",
                "datePublished": "2018-08-31"
            },
            {
                "reviewId": "u_UpjN95_2Lo9OQxiG5c4Q",
                "author": "Helen H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hubby and I were hungry and happen to be by Chinatown around dinner time one night in London so we stopped in here after seeing a long line here the night before . We wanted to see what the hype was. We noticed they have multiple locations with the first being open since 1990, so we knew the food had to be good. I also double checked on Yelp and noticed most of the bad reviews were non-Asian or complaints about the restaurant, service, or tip. Aka, good food? Im down! \nThe entrance and ground floor is tight but we managed to be lead upstairs to our table. I am glad they gave us a bigger table for our winter jackets, shopping bags, and room for the food we ordered. \nWe asked what were some of the best sellers and ordered two dishes to share. Plus an appetizer of xiao long bao. \nThe xiao long bao was meh, skip it. \nWe also ordered the crispy aromatic duck and lobster. The duck was extremely good. The lobster as quite good as well, but not a good as impressive as the duck. The duck I highly recommend getting when visiting here. Next time I will get the traditional roast duck as it has been deemed by the Financial Times as \"the best roast duck in the world\" lol. That probably means at least in the UK it is the best. \nThe waiter does speak Chinese and English so no worries if you cant speak Chinese. \nThis place is pretty traditional from the food to experience. Dirty, small, dingy restaurant. Waiter is pushy and cranky (what Chinese adult/parent isnt lol). Plating is traditional (plopped on a plate lol). Table side service for the duck. The only thing I didnt do is get a hot bowl of water to clean my utensils lol. \nYou do have to pay for rice and water. Oh, and I think I spotted 20% automatic tip. \n*For my fellow Chinese : Every Chinese person is showing face so wear nice clothes- service is better then - hint hint. \nThis place offers great authentic Chinese food. Get off the high horse and get passed the ambiance/cleanliness, plating, service, cost, etc. and enjoy the good food they have to offer. Its good. It why you go to a restaurant at the end of the day....to eat. Visit and enjoy the Duck!",
                "datePublished": "2018-01-08"
            },
            {
                "reviewId": "AWs6PfA4ZxOw1o2NJXfd-A",
                "author": "Ashley D.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This is a small shop located across Bubblewrap and every time we walked by, their were little to no customers around. I personally feel like this place is more authentic than the other places on Chinatown which may account for why it lacks popularity.\nThe person who served us was relatively polite and nice but one of the ladies working was pretty rude to us. \nWe ordered beef noodle soup, fried rice, Chinese spinach, and seafood soup. The fried rice was good as was the spinach. The noodle soups were just ok and were not anything special.\nOverall, this was a subpar place and I probably wouldn't go to it again. It wasn't awful but it wasn't great.",
                "datePublished": "2017-06-24"
            },
            {
                "reviewId": "bVOONthtemnTlF3LPe9xDQ",
                "author": "Nick Z.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hands down the best roast duck in London, it's a must try. However, the roast duck is a bit high in terms of fat content, may not be to everyone's liking.",
                "datePublished": "2018-06-11"
            },
            {
                "reviewId": "ZREt2Dilr0J-2D-CLneVew",
                "author": "Frank L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I just had dinner with the family here at the Four Seasons for Mother's Day. So first of all, I want to apologize to my mom for taking her here. Our dishes were extremely greasy and salty. I understand that a little use of oil prevents stickiness in the pan but when the vegetable dish is greasier than the meat dish then there's a problem. The couple things that were passable was the steam rice and BBQ pork. The chow fun was drenched with a very salty gravy. I think my doctor would recommend me to stop dining here. \nAlso the men's toilet is the smallest one I've been to. How small is it? Imagine sharing an airplane bathroom with another person. I swear while I was peeing I was rubbing shoulders with the man in the next stall and rubbing cheeks with another man washing his hands. Intimacy is good sometimes but not in the toilet. \nAfter the meal there is complimentary orange slices and mint for your stinky breath. They also add a 12% service charge to your bill.",
                "datePublished": "2017-05-14"
            },
            {
                "reviewId": "c73LKhbaQBKgqcg99HJCgA",
                "author": "Christine H.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "When I arrived, I hear people speaking Cantonese so as a Cantonese speaker I speak to the guy up front in Chinese only to be met with gruff, broken English. We are sat and given water but had to ask for tea at $1.50/pp. When it came time to place our order I asked again in Chinese for 1/4 duck, chicken satay appetizer and the braised beef wonton noodles.\nThe chicken came out first and then the noodles without the beef. I looked confused and said I ordered the beef one. One of the waitresses offered to switch it but I said it was fine. What bothered me was that waiter was adamant that I was wrong. He protested in Chinese \"I'm not wrong! She didn't order that!!!\" Soooooo when I speak in Chinese you pretend you don't know any but when something is wrong you complain in Chinese?? What great customer service...\nThe wonton noodles were soggy and an off putting grey color. It's as if the noodles were pre cooked and just left out - the noodles were still sticking together in clumps in the hot broth. \nThe duck was extremely dry and I was insulted that they would serve it. We were basically given shredded scraps (see pic). Had I not slathered the pancake with hoisin sauce, it would've been inedible. \nThe chicken satay was decent from the one bite I tried but still fairly dry.\nThis establishment provides better service to non-Chinese clientele from what I saw when I was there. \nAlso, I think they sensed I was annoyed and they automatically charged  20% tip to our check under \"Discretionary\" even though we were just a party of 2. What crappy business practices!!!!!",
                "datePublished": "2017-05-28"
            },
            {
                "reviewId": "fTMW2NUW1RyqMmZdAdpSAw",
                "author": "L S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Surprisingly great food in London's Ctown, a place packed with pretenders.\nWe followed where other Chinese went.  The restaurant looked crowded with locals.  They spoke Cantonese.  All good signs.\nThe duck was as good as advertised.  A must, really.  They'll hack it off the bone for you, but that's a very un-Chinese thing to do.  Our other dishes were just as good (Peking-styled ribs, basic stir fry dishes).  Price was pretty good for London.  Service was typically Chinese (mostly good), but we're used it.",
                "datePublished": "2018-07-22"
            },
            {
                "reviewId": "IYx4Wy9Ny0mhwON4l0NCVQ",
                "author": "Lam N.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Overrated restaurant. The food is just like at your average Chinatown eatery - greasy, nothing innovative (at least as per the menu), and so is the service - kind of brusque. Go to a 'premium' dim sum place, a new, higher-quality restaurant (like Xu), or just limit yourself to something simple (like green vegs or dumplings soup).",
                "datePublished": "2018-05-20"
            },
            {
                "reviewId": "eGEdX5WTBCka9D0pnzDHIA",
                "author": "Dee L.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Lousy service.  The food was ok.  There were small portions, and soup was cold!  On top of that Unfriendly waitresses.  We came all the way from Los Angeles to try the Chinese food in London Chinatown.  Kind of disappointed in this place...",
                "datePublished": "2018-03-19"
            },
            {
                "reviewId": "Qc4qvxPaUuKdHJrJA-vamg",
                "author": "Nina B.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "A little wait time, hot and sour soup was pretty vinegary and steamed shrimp dumplings were missing some flavor but customer service was pretty good during bank holiday",
                "datePublished": "2018-08-27"
            },
            {
                "reviewId": "TpycrtcwCb0VdKX8v3xnAA",
                "author": "Hoàng A.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "We came at 9:56pm, the restaurant is serving the guests inside but they refused to serve more even they open until 11:30pm, just say no and without telling me why.",
                "datePublished": "2018-08-15"
            },
            {
                "reviewId": "kHuirb74-tvLXwRRsW7zew",
                "author": "Han V.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Duck, soy chicken, crispy pork--- those are all you need to know. On my trip to London, I came back here twice because my boyfriend and I wanted more! We opted for the three meat plate each time and it was plenty of food to share. Their duck was juicy and not too fatty. I don't think it was a life changing dish but it was solid. What we really enjoyed, surprisingly, was their soy chicken. It was moist and had just a hint of flavor from the soy sauce. Their crispy pork was also solid and a nice textural difference to have. \nAs for their other options, we were not impressed. We also tried their Peking style duck which was too dry and was definitely not worth the price. It honestly tasted like it was sitting out for too long. Their calamari wasn't special and was overcooked. I don't even really remember the other dishes we tried because they weren't that good.",
                "datePublished": "2017-03-28"
            },
            {
                "reviewId": "mK8M2L-nIFp0gGj65jxfaA",
                "author": "Kelli W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "An truly fine local favorite. \nMeandered in as a lost tourist and found the food reminiscent of that in Southern California 626 area. \nThe duck is an absolute must. Tender, flavorful and perfectly balanced. While in most Cantonese joints, non speaking guest will often get the \"bad pieces\" Four Seasons knows no such concept and every single piece was fantastic and no survivors were left on our plate. For our family of four, the half portion did just fine.\nDuring your menu selection be sure to look around at what the locals are eating, we did so and were not disappointed",
                "datePublished": "2017-12-12"
            },
            {
                "reviewId": "R5O8Tt14RgnLNcGBUXBbGg",
                "author": "Jess N.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Four Seasons not to be mistaken for the luxurious Four Seasons Hotel chain, unfortunately did not make four stars during my visit.\nLuckily for us,  a table for two in the center of the main restaurant was available immediately for seating during dinner. (I consider this the best seats in the house) Perfect view and access for service and visibility.\nAccess to the restaurant is conveniently located near the main entrance gate to chinatown.\nThe restaurant is old, as expected. Not a place you want to take someone on for a first date and might be difficult for groups larger than a party of four.\nThe food was decent but we ordered the aromatic crispy duck instead of what we were craving for, the Roasted Peking Duck.\nWhat was ordered:\nPeking Set Meal A\n106 Minimum For 2 Persons (2人以上) £20.50 per person\n酸辣湯 Hot and Sour Soup ,, (uniquely added fishcake, tasty)\n酥炸香酥鴨 Aromatic Crispy Duck (good enough for two as suggested)\n乾炒牛肉絲 Deep Fried Crispy Shredded Beef with Chilli , (not authentic)\n宮保肉丁 Diced \"Kong-Po\" Pork , (Can't taste the pork, too much batter)\n清炒雜菜 Stir Fried Mixed Vegetables (Good)\n蛋炒飯 Egg Fried Rice (Good)\nValue is filling but I recommend you order from the a la carte section.\nThis is probably not my first choice to return but they do offer many selections for duck.\nWhat you need to know:\n- There are three locations, two in Chinatown \n- Tea is charged\n- Three levels \n- Understand the cooking method of duck you want to eat: Roasted Cantonese BBQ style, Roasted Peking Duck or Aromatic Peking Crispy Duck \n- Take time to look through the menu before ordering",
                "datePublished": "2016-03-30"
            },
            {
                "reviewId": "4E2zkxha_Wj7UPdwkA-2_A",
                "author": "Paul M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I like the Four Seasons.\nAlways packed, always a queue wating outside and always a lot of chinese guests.\nThe roast duck, cantoese duck, BBQ Ribs and soy chicken are delicious. \nThe prices are moderate but they charge a compulsory service charge.\nService is chinese style, not overfriendly but efficient.",
                "datePublished": "2017-07-13"
            },
            {
                "reviewId": "xWG_0rmBb5uF5NEFa9EEpg",
                "author": "Sun L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "--- American Tourist ----\n**** This is review of \"Little four seasons\" on 11 Gerrard St., next door!!! ****\nIt belongs to the same owner AND the food is the same AND service is a lot better!!!!! Alert!!! \nWe had roast duck, Japanese creamy  BBQ ribs, wonton, first class taste, first class temperature, excellent service! Even the waitress told us that they belong the same owner AND  they know the next door has worst service. Just don't get it!?\nThat said, venue still tight, bathroom is not handicapped friendly! 4 Stars!\n11 and 12 on the same street, just like twins but very very different personalities.\nWalk into the right one, buddy!",
                "datePublished": "2017-01-18"
            },
            {
                "reviewId": "BvbWlCJRqi6wORhpcOvmmA",
                "author": "Alicia Y.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Crispy fat juicy duck FTW! The duck is worth the queue. If you ain't a duck fan you have other alternative dishes that are equally tasty, but then you'd be wasting your time. I had some friends telling me that it was OK, I think the duck quality varies. I got lucky with mine. I'd skip the crispy pork belly and just go try something else.\nIt's probably a little pricey for my liking but they're portions are huge and generous. If you're in groups of 3-4, make a booking because this place is packed.",
                "datePublished": "2016-11-12"
            },
            {
                "reviewId": "FIQi2pQ9L3rpYrYK3A0t6A",
                "author": "Jennifer B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I come here regularly for the Cantonese roast duck. Always delicious (and you can get it boneless which makes it infinitely easier to eat).\nI didn't used to like squid until I had the salt and pepper squid here. So light and yummy, and not at all rubbery (I tried this dish a few times on my recent visit to Hong Kong and I maintain that Four Seasons does it better).\nService isn't exactly delightful, but it is efficient (although I have turned up with a few people drunk once and we did manage to crack a smile from our waitress).",
                "datePublished": "2017-10-09"
            },
            {
                "reviewId": "fAzn55ryRZl7JAca9fxF2Q",
                "author": "Rona L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "For an early dinner, this place is OK in parts and terrible in others.\nThey're famous for their duck, so we had that with rice and crispy pork. Another of the same, plus chicken. Then 3 starters, meat spring rolls, salt and pepper ribs and dumplings.\nThe rice was a decent portion but the sauce that was wrongly sweet. The duck was OK, the pork was delicious and the chicken came with no skin, no bone and the spring onion came ontop of the duck! Why?? Plus the overall meat portion was small. \nThe starters were appalling and clearly aimed at an unassuming audience who wouldn't know better. The ribs were bone dry and bland, the dumpling skin was thick and fried, but not in the way you'd want. The spring rolls were supposed to be 2 large pork ones but ended up being 4 small ones with non-existant chicken. \nOverall, I'd cone back for their expensive rice dishes if I had no other choice, but the starters were awful. Our waiter was ok but I heard one say \"everyone's tastes are different\" when being asked about portion sizes and what they would recommend.",
                "datePublished": "2017-03-24"
            }
        ]
    },
    "20": {
        "id": "H2hMVEI0OM2k5c0v1iBoag",
        "name": "Four Seasons",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "12 Gerrard Street\nLondon W1D 5PR\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6JLOFSkm-1Y1tLgYh9odbQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7494 0870",
        "review": [
            {
                "reviewId": "5qBGTVkWic-VrsaCvHL1sA",
                "author": "Rod S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The name and address threw off the cabby for a minute. It's not the \"Four Seasons\" we normally think of. I was with a coworker and we were looking for something we didn't have locally. It was time for Duck that wasn't Americanized.\nTo start we have the best Hot and Sour soup we've ever had. What a great start. Among a couple other dishes we ordered the whole duck. We should have only gotten the half duck. There was a LOT of it. It was very good.\nIt's unfortunate Chinese is going through a down period in so many markets because it's not all the generic meat and veg in a brown sauce when done right. They did it right tonight.",
                "datePublished": "2016-08-16"
            },
            {
                "reviewId": "bo7z-JfSdDdOTnARnYaP3w",
                "author": "Tony T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "People come for the duck so get the duck. It's consistently rated as the best in London and we got the boneless Cantonese duck which was very tasty. Also had the pork belly, morning glory & a shrimp fried rice. Food was very good and service was what you would expect in any Chinese restaurant in the Western Hemisphere. The wait was about 30 minutes, which was reasonable.",
                "datePublished": "2016-07-30"
            },
            {
                "reviewId": "Qm-G8VR2x0_GWiIxHML64g",
                "author": "Lloyd M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "One of the best Chinese meals I ever had, can't believe it does not have higher reviews online.  I came for the duck and it was better than I expected.  There are multiple duck options but ordered the half Cantonese duck, seemed to be on the page that they were highlighting.  It was fantastic.  Crispy skin, meatier than expected and in a soy based sauce they really highlighted the duck.\nI also ordered the two BBQ meat combo, with char sui and pork belly.  Both were great.  Char sui was flavorful.  Pork belly was not too fatty and the crispy parts were awesome (it was all tasty).\nI also ordered a vegetable by pointing to a picture as I figured I needed something other than meat.  I wish they had smaller portions (of vegetables) but even it was very good, very garlicky and tasty.  \nOverall, loved it and one of my favorite Chinese meals ever.",
                "datePublished": "2015-06-16"
            },
            {
                "reviewId": "LZQxsEEdgKeIkK3B19pfIw",
                "author": "Jesse P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The food is good especially the lotus stems and shrimp stuffed mushrooms The seafood and tofu hot pot is delicious.",
                "datePublished": "2017-11-12"
            },
            {
                "reviewId": "fNmLKxtTLvS8ziKlnpIalw",
                "author": "Syyu C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "We were in Piccadilly Circus, and decided to swing by Chinatown for our first dinner of the night (yes... vacation means food marathon). Four Seasons was recommended to us by a friend for good crispy duck. There was also a message posted on the window that said \"best roast duck in the world\", so we came with rather high expectations. Arrived around 7pm on a Sunday and the restaurant was very busy. There was not enough space to wait inside so we had to wait outside the door.\nAfter a 15 minute wait, we were seated downstairs, which was a bit cramped and dingy. We ordered the half Roasted Duck and Oyster Pancake. The Roast Duck was good - the meat was tender and juicy, but the oyster pancake was pretty tasteless. Prices were standard Chinatown.\nService was brisk and adrupt - normal for Chinese Restaurants so I had no complaints. However, we did ask for oyster sauce for our oyster pancake, but the waitress gave us Chili Oil. Maybe oyster sauce is more of a US thing and they don't have it in London?",
                "datePublished": "2015-04-06"
            },
            {
                "reviewId": "64cJNzIM8EiyljX_UTBu1w",
                "author": "Daniel F.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Came here late around 9pm on a Sunday to celebrate Chinese New Year and feast on some food after a few beers locally. As with most Chinese restaurants don't expect great customer service. It's not their forte. Though you will get service charge added, so expect that.\nWe got the roasted duck, which it is famed for. I had many recommendations that this was THE place to get duck from in Chinatown. A whole one of course. They had unfortunately run out of crispy pork belly (another rec), so we settled from BBQ pork which was really good.\nThe duck was good. Fatty, juicy, though we kept it on the bone for flavour and this meant it was awkward to eat into. Duck is hard to cut like this, so the pieces er eaten eaten whole or bitten using hands.\nVery nice overall.",
                "datePublished": "2016-02-07"
            },
            {
                "reviewId": "EG0uzLqb2d4FkiaEXrKoNg",
                "author": "Angelica C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Roast duck is a must and is the only saving grace of the meal! Everything else was ordinary and meh.  Veggies were greasy and my friend felt sick after. This is definitely a legitimate Cantonese restaurant, though. \nI've had better elsewhere and for less £",
                "datePublished": "2016-04-05"
            },
            {
                "reviewId": "ORH2lSRySw993H1I5B691A",
                "author": "Steven S.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Came here after recently seeing Jay Rayner live, where he recommended Four Seasons in London, in particular because it apparently has the best roast duck in the entire UK.\nArrived here with no booking, but the place wasn't too busy, so they directed us to go and take a seat upstairs.\nSo off we popped, upstairs, into what can only be described as a storage area of the restaurant that just so happened to have some tables and chairs sitting about in it. \nNot a great impression, but we were there for the food, willing to sit in any condition to taste this supposedly incredible duck.\nIt arrived luke warm, there was a LOT of fat (I know duck is very fatty, but this was a bit much), the skin was just soft and limp, the duck itself was moist and very tasty but unfortunately this didn't make up for the rest of the failings.\nNot cheap either! \nWouldn't recommend. Terrible service, terrible atmosphere if you're sitting upstairs, not great food, go elsewhere.",
                "datePublished": "2016-11-01"
            },
            {
                "reviewId": "BuklB5VWa-vqucoJS809bA",
                "author": "Lexi P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The food was delicious. We're from Markham, Ontario, Canada where we have excellent and authentic Chinese restaurants. The food at this restaurant is very comparable. The beef in black bean sauce on ho fun noodles was really good. The vegetables with garlic were excellent too.",
                "datePublished": "2018-03-15"
            },
            {
                "reviewId": "MARVHOaFyppkxOQDY5G2bg",
                "author": "Jocelyn W.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "While the roast duck was flavorful, the skin was soggy (major no-no in any Chinese kitchen) and the dish of 3 BBQ meats was altogether cold. Our aubergine vermicelli was cold as well and over cooked. \nOriginally I thought to myself, do not judge them too harshly, after all I just came back from a year living in China. But the last straw was when they grossly overcharged us. The meal should have been 21 GBP, but I later discovered my date was charged 40 GBP! I am going back with the receipt.\nUtterly unprofessional and disappointing. I could have bought 4 whole Peking roast ducks of the best quality elsewhere.",
                "datePublished": "2016-10-08"
            },
            {
                "reviewId": "Lkol1HAWcIz3VLgdMdl0yQ",
                "author": "Jenny M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "PROS - When I was little, I was allergic to duck. I would break out in hives all over my face, arms and legs. My mom told me I would just keep eating and didn't care. Thank goodness I'm no longer allergic but even if I was, the crispy roast duck pancakes served here would encourage me to keep eating regardless. The three of us ordered the duck pancakes with a half duck and salt&pepper tofu (beancurd). The duck pancakes were delectable! The half duck was served in shreds to make it easier on us to make our own pancakes with cucumber strips and onion strips. We were given the duck sauce (looks like BBQ sauce) along with a trio of spices to fully customize our heavenly duck experience. \nThe salt&pepper tofu was alright, but it was nothing special so I wouldn't order it again. \nCONS - It's a bit spendy for the amount of duck you get but Four Seasons know they are hot shit compared to other roast duck places around Chinatown so they are \"entitled\" to price their duck that way ;) So the problem lies solely with me and that I should get a higher paying job to eat more duck pancakes, dammit!",
                "datePublished": "2014-04-15"
            },
            {
                "reviewId": "8uAMcoQCS36ddeJZQYmKTQ",
                "author": "Jonny T.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "I just want to say, WHAT?!\nThis place is bad, and not the kind of super-cheap-chinese-restaurant-bad, it is just plain bad. The interior and decoration is disgusting, everything is old and covered in dust. The table I sat at was slanting so much that I felt sea-sick, it was slanting so much that it felt like I was in some kind of fun house at Disney land. But the worst part was that they did all the dishes behind me, yes right over my shoulder. The sound of plastic dishes clashing together was not pleasant at all. And when I thought it couldn't get worse, I saw the waitress drop and pick up clean dish from the dirty floor and put it back on the \"clean\" pile again.\nAnd then again when I thought it couldn't get any worse, I got the most grumpy and angry looking waiter in the world, the only thing he said throughout my experience was \"what do you want\" and \"thank you\" (when we paid). Everything was rushed, the food came out fast but so did the check.\nThe food was very bland/bad, everything was off, the char siu I ordered tasted like hot dog! But hey! the famous duck tasted OKAY!\nI do not recommend this place at all!",
                "datePublished": "2016-01-15"
            },
            {
                "reviewId": "LVfvSKPyUzpF3wbLlPXpxA",
                "author": "Jann L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Went here for lunch and got half soy chicken rice and Malaysian ho fun. The food was decent and I have no complaints except they charge for Chinese tea which should be a staple. They were also skimpy with the rice and charged a ridiculous price for white rice - over £3 per cup.",
                "datePublished": "2017-05-16"
            },
            {
                "reviewId": "Tysy90DfeCOD3I3gsLfIpw",
                "author": "Rajib S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Loved the food , 5 stars. Service was slightly pushy. Overall wonderful dining experience.",
                "datePublished": "2017-06-20"
            },
            {
                "reviewId": "a0IjT5b25xctNVcvv2Rmug",
                "author": "Caitrin O.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "You don't go to Four Seasons for the service or the ambiance, you go to eat delicious roast duck. The service is not great and the restaurant is rather dingy, now let's move on.\nThe food is fantastic. Three of us split the crispy aromatic duck, Peking short ribs, and softshell crab, and were absolutely exquisitely stuffed by the end of the meal. Everything was delicious but the duck stole the show- it was incredibly flavorful and the combination of cucumbers and sauce on the thin little pancake was out of this world. The food here is absolutely fantastic- just manage your expectations about the service, and you will love it.",
                "datePublished": "2015-06-09"
            },
            {
                "reviewId": "_wV3By5lIH08mLmp8gT32A",
                "author": "Cat W.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "We traveled from the United States to London in one week ago, and we had a dinner at Four Seasons.  We only tried one Chinese restaurant in London during this trip, so I am not sure the quality of Chinese food in other restaurants in London.  This restaurant is definitely not recommended because the food and the service were really bad. \n1.  This restaurant has minimum cost for every person ($8), and the waiter will force you to order more if you didn't order enough food.\n2.  This restaurant will charge you tip automatically.\n3.  The service was really bad, the attitude of the waiters were the worse that I have ever seen in my life.\n4.  The flavors of the food were bad, the portions were small for that price.",
                "datePublished": "2017-01-05"
            },
            {
                "reviewId": "pUjIosdbMhkA8X0P43Aemg",
                "author": "Betsy L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This one was recommend by my friend as one of the best places in London for Chinese food. We visited here at approximately 7:30pm and there are already a lot of customers in here. We got 3 main dishes, 1 fried rice and 1 appetizer for 3 people, and the size of the main dishes are as little bit small. The one with eggplant was good and it also has fish in it.\nOf course, they are famous for roster duck but we tried their fried pork and duck, which is also really good.\nIf you want some authentic Cantonese good in London, try this one. The waitresses are also from Hong Kong lol",
                "datePublished": "2015-07-13"
            },
            {
                "reviewId": "AuZ2-Ot4Ypvz6a2B5CWWHg",
                "author": "Dee G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "One of the best roast duck dishes I've ever had. We arrived around 8pm on a Sunday night. Pity they ran out of the roast pork as we heard it was delicious too. We ordered a whole roast duck (£24), sliced beef (which was savory and slightly sweet, but so juicy and delicious), choi sum vegetables stir fried with garlic, tofu with prawn stuffing, and a herbal pork soup with black and white pepper which was a milky white color because of the carnation milk they added (we took a chance with the soup because it was so cold and we were so glad we did, it was so yummy and helped clear out my sinuses).  The total bill was around £100 but the food was amazing,  definitely one of the best I've ever had from both the U.K., and the USA.  The restaurant was fairly old and small even though it has two floors. We sat in the first floor and there were 6 tables. The staff was incredibly attentive. When we arrived, they took a few minutes to set up a table for us (3 adults and a toddler) and the toddler seat was set up before we even asked for one.  Once, we had dropped a chopstick, and the owner (manager?) immediately  grabbed us a new pair of chopsticks. When all our dishes arrived, our table was quite crowded and they quickly lifted up the extension of the table and gave us more space.  The staff spoke both Cantonese and Mandarin and I felt completely at ease conversing with them in Cantonese as they were extremely friendly and customer oriented. Would definitely recommend this to anyone looking for amazing Cantonese food. They also own \"Little Four Seasons\" which was more on the main side of Gerard Street but I have not yet tried it.",
                "datePublished": "2018-02-26"
            },
            {
                "reviewId": "lhpX8PhLNa6gf22v1T2vAg",
                "author": "Alice C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Super nice service or because I'm Chinese too? We had the combo of meats and it was delish! Oh you get oranges after the meal. :)",
                "datePublished": "2015-04-08"
            },
            {
                "reviewId": "lZxtflS8WpPljHxxY8cuWw",
                "author": "Magdalene L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Definitely a 5-star experience.  My friends had been raving about the roast duck from the moment we started our Channel crossing on the Eurostar train, and I was thinking: how good can duck be?  Turns out it was so good that I dragged them back for a second round of duck in our 4 days in London.\nThe duck (GBP22) was suitably tender and well flavoured, and the gravy complemented the taste well.  Other dishes were typical Chinese fare that was above average.  We ordered 2 types of Chinese soups that were typical standard for Europe: barely passable but that's so not the point of being here.  \nThe staff were somewhat curt but very efficient.  They managed to quickly get us a seat on the ground floor (important as a friend was hobbling with a walking stick) when we walked in on a Sunday afternoon.  The queue on Wednesday dinner was long but we solved the problem by ordering out - the main thing we were interested in was the duck anyway.  \nStood eating on the streets before our theatre show (restaurant is walking distance to many musical/ theatre venues), and decided there and then that \"duck followed by theatre\" shall be part of my next London routine.",
                "datePublished": "2015-07-26"
            }
        ]
    },
    "40": {
        "id": "H2hMVEI0OM2k5c0v1iBoag",
        "name": "Four Seasons",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "12 Gerrard Street\nLondon W1D 5PR\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6JLOFSkm-1Y1tLgYh9odbQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7494 0870",
        "review": [
            {
                "reviewId": "jA7ZfhMZ_vLTEVHyKfoPGg",
                "author": "Lloyd S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I would put this place in the catagory of \"another Chinese restaurant in China town\" in general pretty unremarkable. The food was ok, the service was what you learn to expect in many \"Chinese restaurants in China town\" - sit, eat, leave.... The latter at their insistence. \nIt's supposed to be well known for their duck, it's not my dish of choice but I tried it and it was good (very fatty, but I hear that's the best part). \nThe restaurant is of a  reasonable size and they maximize the number of seats which means your pretty close to the next table. \nMy personal opinion is the best Chinese restaurants aren't in China town, but for quick eats this place meets the requirements.",
                "datePublished": "2016-01-12"
            },
            {
                "reviewId": "QS4sl_t1a6xlIo6T7Swe0g",
                "author": "Stephanie T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Since there were mixed reviews on the duck by yelpers from HK and LA, we just asked them if they could make \"fire duck rice noodle\" instead. It's a good bowl of noodles when it's cold outside and you had enough of \"ghost people\" food and want some \"people eat gei food.\" The soup is a bit heavy with star anise so be prepared. \nWe also ordered the \"pig stomach chicken pot.\" This hotpot was very heavy with white pepper so be prepared your throat will burn. It's a good dish for the cold winter though. \nAlso, this place was crowded with tourists so we went to the modern looking one next door which bears the same name and serves the same duck. Much more quiet and better service there.",
                "datePublished": "2015-11-11"
            },
            {
                "reviewId": "UsC42rm6ZmLSIkarMbelsQ",
                "author": "Vu L.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "The worst service I've ever encountered!  Not only did they charged us for food we didn't ordered, but they cursed us out in Cantonese when we told them about food we didn't received!  When we complained about the service, they threw the change on the table and said bye bye, in a nasty, condescending way. Don't come here!",
                "datePublished": "2017-07-09"
            },
            {
                "reviewId": "V_MzTGG889D8dTk-w5m_cQ",
                "author": "Tim M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Hearing reviews that this place was known for their duck, we made a specific trip to Chinatown to experience it for ourselves. Unfortunately, it felt like another restaurant at any Chinatown where the food was bland and just average.\nOur main dishes were the Roast Pork/Pork Belly, BBQ Pork, Roast duck. All the food was served at room temperature. We had some greens but nothing spectacular or memorable.\nMaybe it is a London Chinatown practice, we were shocked to be charged GBP 2.5 for a bowl of rice. Given we ordered 5 entrees, we assumed that we would get a bowl per entree and were disappointed when our bill arrived.",
                "datePublished": "2015-11-25"
            },
            {
                "reviewId": "eJ7Nnncy9FRTV9ebyWIZow",
                "author": "Callum H.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "We visited tonight (Friday 16th March) at around 7PM in a group of 7, having heard so much about the famous duck. I was well aware the place was run down, however didn't mind if the duck was as good as was said.\nWe purchased a whole peking duck (£38) and several other side dishes (Fried rice, Sweet & Sour chicken etcetera). The waitress was very rude from the off, asking us what we wanted after literally only just sitting down. When she did take our order she was very blunt which set the precedent for the rest of the night.\nOn arrival we all remarked how little meat there was on the duck and even double checked it was in fact a whole duck, to which she replied it was. The duck ended up being about 2 legs worth of (lukewarm) meat, the rest was just skin and a base of prawn crackers which were used to pad the dish out.\nWaitress collected plates as people were still eating, poured most of the wine down the side of the glass/on the table, and didn't say thank you to any member of the party after paying our £170 bill.\nTL;DR - Rude servers, expensive food, small portions. Would have rather paid £12 for all you can eat at any of the other generic Chinese restaurants in Chinatown.",
                "datePublished": "2016-03-18"
            },
            {
                "reviewId": "lNo06pS_f1LRWZDJw8XbVQ",
                "author": "Samuel A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "\"Best roast duck in the world\" by FT, and in my view, best I've had outside Hong Kong. Delicious yummy roast duck with tender meat, crispy skin well marinated with herbs, a highly recommended stop in central London near Leicester Square and West End. Casual eatery, brusque service, real attraction is the world class roast duck!",
                "datePublished": "2015-12-08"
            },
            {
                "reviewId": "P6i5woDGQs_3lg0GdfSCXA",
                "author": "Ethan C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Don't come here expecting an intimate ambience, fine dining or good service. This is simply good Chinese food cooked for those in need of a Chinese fix, which is greatly appreciated if you've lived in Europe too long. The roast duck is absolutely divine; the skin is crispy and the fat melts in your mouth. The hot plate beef - I suggest the black pepper sauce - is also recommended. Finally, you can't go wrong with some Yangzhou fried rice.",
                "datePublished": "2015-12-20"
            },
            {
                "reviewId": "CA5KzKo03qDX3y655J_tGA",
                "author": "Natalie W.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Was pretty disappointed with our experience here. Firstly, I know a lot of Chinatown restaurants aren't pretty at the best of times, but the basement here really is pretty basic. \nFood wise, the actual food wasn't bad, although I realise now that we stupidly ordered crispy duck when we should have gone for their famous roast duck...oh well. The real problem was that should have come first but instead they brought out our brisket stew, with no rice, so it went cold while we waited. Then the pork we ordered actually arrived cold, and had to be sent back. Duck arrives at this point. We ordered more rice but that never turned up (nor on the bill, which was something). Overall, very poor service and I think that's the first time I've ever had to send something back to the kitchen to be heated. I would hesitate to come again, even though I'd like to try the proper duck!",
                "datePublished": "2013-10-20"
            },
            {
                "reviewId": "c6NLxGXLdwdu2Fs-QQyGSQ",
                "author": "Gina K.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Come here for the food, not for the ambiance nor for the service.\nIt's a great spot for a pre-theatre dinner if you order their duck.  You'll be in and out pretty quick and it's what they're famous for their duck.  Though their aubergine with minced pork hotpot and black bean beef ho fun was pretty good as well.\nIn terms of service, they operate like a well oiled machine. Notice the handsfree earpieces.  How many restaurants in London have you seen those in?  if everything goes well.  They'll seat, serve and get you out asap.",
                "datePublished": "2011-04-23"
            },
            {
                "reviewId": "0DbgKgE52ewHD5r_U20YjQ",
                "author": "Erin L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I've always been skeptical about chinatown in London when it comes to food, because I've always been let down - until last night. Oh man - this is hands down the best duck in London - crispy, yet juicy, and the sauce is insanely good. Definitely recommend. Don't go if you're looking for a romantic ambience or a trendy location - but if you want no-frills, delicious duck, then get down there. It's incredibly reasonable, too.",
                "datePublished": "2016-02-06"
            },
            {
                "reviewId": "JFRJ1_erMDRwp4QVJhCm4g",
                "author": "Wesley H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Food was okay, but it was more a factory than a restaurant...\nWe came in about 19.10, ordered a soup and a main dish. 19.30 the bill was presented to us (which they took back with them). When i asked for the receipt i got a grumpy face and a not so friendly 'bye\"",
                "datePublished": "2015-09-09"
            },
            {
                "reviewId": "WpuHuFSg2jFoYCehBhf12g",
                "author": "Christian F.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "We were lured into this restaurant due to the number of people queuing up but we can only advise people to queue up at other restaurants. \nTerrible service. The waiters all look like grumpy teenagers who snatch the food in front of you without asking if you are finished eating!\nWe were two and I had finished my dish before my girlfriend but instead of waiting for my girlfriend to finish her food, they just took the food from her without asking. \nOh, and stay away from their char siew. Only choose barbecued duck as topping, but honestly the food looked like something you could expect from a fast food joint. \nCannot recommend! Avoid this place!\nWe are never coming back!",
                "datePublished": "2014-10-21"
            },
            {
                "reviewId": "1N3V8xKzZhB7JT1kW7Mf4w",
                "author": "Kaydee C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I went there with my family during the weekend,which is understandably busy. The food was meh. The duck is the only saving grace for the night. We asked for the green chili and the waiter came back with the regular one,and when we pointed it out,he got frustrated and told us \" I have to walk back and forth for you\", and then went on rambling in Chinese,and I didn't understand a single word. Like I don't get how that was acceptable for a waiter to be pissed at us when I was more that sure that all of us were very polite asking for thing. Still not impressed, the only thing that saved the night for me was the duck.",
                "datePublished": "2016-07-20"
            },
            {
                "reviewId": "0Wey7UDXvx07pra7G3dXnQ",
                "author": "Lisa C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "This is the most disappointing meal I've had in a while. My friend and I were looking to grab a simple dinner in Chinatown, and when I looked up restaurant reviews, they were all around 3.5 stars out of 5 and I wondered how they could have all been so poor. There is nothing that is 4 stars or above. I've been here a few times to get barbecued meat or roast duck for takeaway, which somehow always managed to set me back £10-15, but it's well regarded for having the best roast duck in London and the char siu and crispy pork belly was always solid too. It's expensive, but on the bright side it's the same price to eat in, so that is probably the best option at this restaurant. The other items on the menu were outrageously expensive - the highlight was that plates of seasonal vegetables will send you back £9, when clearly the cost at the supermarket next door would be something like £2. We got stir fried prawns with seasonal vegetables (which turned out to be broccoli, not even anything special) for £10, but at least there were prawns. We also got the crispy duck with pancakes, which was nice because we could order ¼ duck, which you can't with the Peking duck, but the crispy duck was a dry, shredded, indistinguishable version of the normal glazed and juicy roast duck glory. I wouldn't recommend it. The table next to us got the Peking duck and I had serious food envy. Our last dish was the young chow fried rice. The disappointing part about this was that it was served lukewarm. The whole meal costs us nearly £40 in total, which is terrible value and you should definitely be able to do much better in Chinatown. I might come here for the barbecued meat or roast duck takeaway, but it's not worth your while to eat in.",
                "datePublished": "2016-01-07"
            },
            {
                "reviewId": "xy9mEHwNvnY9I6I6avxbJQ",
                "author": "David K.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "We could not eat here. We saw a tray of noodles used as a door stop to an outside entrance to a walk up to sidewalk level. All the dirt and soot from the street could land on the food. Ugh.",
                "datePublished": "2016-03-23"
            },
            {
                "reviewId": "874jY2EbvHNuw--TCZeS1g",
                "author": "Kevin C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Let's get this straight. Four Seasons will give you the best roast duck in the world. However I decided to give 4 stars because of their service, which should be better. \nAs a student based in Leeds, I go to London from time to time to watch football, and usually before that, I would go here for lunch. \nQuite a lot of times, I went there and it's a 50/50 chance the service would be good or bad. I've had the good service twice and the\nbad service twice. \nBut for food, the duck is the best around. No question. The aubergine with fried pork meat is amazing. And for the price, it was worth trying. It's just that the service could be better.",
                "datePublished": "2015-03-03"
            },
            {
                "reviewId": "qO_nqPNT0TC87PpN5WIMSA",
                "author": "Christopher L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I used to here all the time for roast duck, unfortunately I think the standards here have dropped a bit.\nObviously service is never great here, so I come here just for some comfort Chinese food. I've been twice recently and the food is not as good as I remembered\nPerhaps it's because I went towards the end of the night, so everyone's tired and the choice cuts of meat are gone. The roast duck I was served was extremely fatty, some pieces were 80% fat, 10% skin and 10% meat. I like fatty duck but this is pushing it a bit\nAlso, the egg noodles in my soup was a big block, all stuck together! I am quite sad writing this as I have no idea where else to go now!",
                "datePublished": "2014-09-23"
            },
            {
                "reviewId": "SdbFwIruU9xJQeVaMbpOgA",
                "author": "Uli B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "If you come here I'd recommend you eat the BBQ'ed duck...I prefer it de-boned already, because that way I can indulge in it without having to suck the meat off of its natural scaffolding. I cannot say that any of the other dishes have blown me away, but typically what we order is a bunch of BBQ'ed duck (or pork), some rice (to soak up all the juices) and one or two orders of vegetable - I recommend Morning Glor, Bok Choy or Peashoots.\nAs for the decor and service of this establishment - this is your typical run-of-the-mill Chinese restaurant with rather oblivious service and crappy decor...nothing to rave about. But I don't come here for these things...all I want is to tuck into my duck as fast as possible! \nQuack, quack...",
                "datePublished": "2012-04-11"
            },
            {
                "reviewId": "MWpOSKrS8M7zCieMFn0T2w",
                "author": "Simon L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The food was good but the waiter had a bad attitude. We went as a group of four and when taking the order the waiter came across as quite aggressive as my friend was taking a while to choose an order from the menu (vegan). The food was good and the atmosphere here is \"cosy\", you will be more or less joined to the people on the table next to yours. We enjoyed the trip but dropped the service charge. Also notable was that I had to return a spoon as it was presented dirty.",
                "datePublished": "2016-03-19"
            },
            {
                "reviewId": "-oSPsCfXmsuKBdEujsFDBQ",
                "author": "Yang D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ordered duck takeaway, it was excellent as usual. Not sure why they were rated the best duck shop, but I do agree that their drippings are nicer than other restaurants. Very small but successful restaurant, gotta enjoy my dinner at home then ;)",
                "datePublished": "2015-08-08"
            }
        ]
    },
    "60": {
        "id": "H2hMVEI0OM2k5c0v1iBoag",
        "name": "Four Seasons",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "12 Gerrard Street\nLondon W1D 5PR\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6JLOFSkm-1Y1tLgYh9odbQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7494 0870",
        "review": [
            {
                "reviewId": "NXIRd0NSNZgXMgtQofxVMQ",
                "author": "David T.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "This place did do great Cantonese food and it's reputation in Soho and even London proceeds it,  I found this place from a top off from a chef many moon ago.... but..... \nRecently I took my girlfriend for the first time and it was a pretty good experience,  endulging in the world famous Peking duck,  crispy pork belly,  soft shell crab and yummy noodles and rice. We were seated quickly and the experience was noisy but enjoyable. But somehow the noise adds the feeling of a bustling busy restaurant which is fine... So we went back a week later. \nAnd.... \nI don't think a restaurant could drop the ball any further... And they weren't even as busy as usual.... Maybe that's a sign of the times. \nAfter 40 minutes we received our duck pancakes,  the duck was nice but seemed to be dry from sitting out too long,  then..... Nothing.... 20 mins later we received cold soft shell crab.... Ten minutes later Kung Po... Very tasty.... But cold.... No rice.... 10 mins later... Rice.... What's the point \nNo apology just an interest to take money and run. Also the pricing is higher than most Chinese restaurants so we left feeling like we paid for their reputation not there service and sadly not their food. \nWe won't be going back. There's plenty more tables in London serving exotic Cantonese wonderment.",
                "datePublished": "2014-03-28"
            },
            {
                "reviewId": "irZ8jIP8A7-NhCyITVt8Ig",
                "author": "Julie D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "LOVE IT HERE! The BBQ duck is so delicious, wonton soup is fab as is the sizzling filet. Service is quick, not overly friendly but efficient. Queues get really long so we always go early. China Town can be overwhelming but you can't go wrong here!",
                "datePublished": "2014-05-31"
            },
            {
                "reviewId": "1Kh-VN9vHDZPQvZ76Z0R1A",
                "author": "Ottilie L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I can image that I'll be here for lots of time in my following four years. Lovely Cantonese food that always remind me my hometown! I truly recommend this restaurant to you but please avoid a peak time, otherwise the service will be even worse :(",
                "datePublished": "2015-11-04"
            },
            {
                "reviewId": "NrPWoiU0GSOiKnG3OkCRbw",
                "author": "Kevin Y.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The food was average in my opinion. \nWife was craving noodles and after some really bad ramen at Wagamama (we went there because it was close to our hotel and we didn't want to travel far. Now we know to never go!) So she looked up Yelp and she decided to give this place a shot. \nWe arrived before dinner rush and there were already people waiting. Since we were a small group, we were promptly seated in the basement section. My wife ordered her noodles, a tofu with veggies, the mixed plate of duck and pork. \nIts decent Chinese food. We did order the famous duck that everyone is raving about and its good - I have to give it to them, but its not \"the best I had\" kinda good. Think HK, NY, or SF! Maybe its consider the best in UK (maybe Europe)?\nThe pork was not as good because it got soggy from soaking in the soy sauce mixed in with the duck. The surprise was the tofu veggie that I really liked. Sorry - I don't know the official English name because the server recommended it in Cantonese. \nAnyways, I think this restaurant is decent. Wouldn't mind going back again if I was craving Chinese food in London.",
                "datePublished": "2015-09-14"
            },
            {
                "reviewId": "P0_4MUaOX6na2gp5anG3hw",
                "author": "Piona T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Quite busy. I came around 9pm. If you don't come for the service, but just for the tasty roast duck. Then you'll love it :))",
                "datePublished": "2015-11-27"
            },
            {
                "reviewId": "H5Sy2CR1rJr2mx511bMcog",
                "author": "Raphael E.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "More like One Season.\nI don't mind a grubby Chinatown restaurant, hell I don't even mind rude service as long as the food is good. But all of above combined left me fuming.\nI visited Four Seasons on a busy Friday night with the missus and after a short wait we were seated. Not much to say about the interior or staff, so we promptly ordered our food.\nStarters were brought out after the Mains. Our Roast Duck was tepid, and judging by the sauce that had dried on the plate it had clearly been sitting out far before we had arrived. When we explained that it was cold, they took it away and warmed it up in the microwave, my initial bite mark that returned with the dish proved this.\nTerrible all around. Your better off ordering from your local Chinese takeaway.",
                "datePublished": "2013-08-14"
            },
            {
                "reviewId": "Mhq7v1-P6ZDTfgsLT-7SNg",
                "author": "Philip D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Having spent some time in China and Hong Kong, I can honestly say this place meets the standards pretty well. It also meets the service standards, but this is the kind of place you simply go to only for the food, not necessarily for the \"restaurant-experience\" (this is not a place to dress up for a Saturday night).\nTheir roast duck, pork belly, soya chicken (in that order) are all fantastic, you can have a meat selection but make sure you order enough duck. We ordered the beef noodles and Singapore fried vermicelli with it and these are equally great. \nWhether you're new to the Cantonese kitchen or have high expectations, this is the place to go to!",
                "datePublished": "2014-04-09"
            },
            {
                "reviewId": "Z0SIUzyuOlMHKMBrI3Umiw",
                "author": "Mark P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "If I were only reviewing food I'd give this place 5 out of 5. Because without a doubt the food here is good, tasty and worth the asking price.\nThe main detraction however is ambience. My partner and I were sat downstairs in a small white box of a room, packed with tables and customers. This I can deal with, but when the number of patrons impacts the service I start to become wary.\nMy meal was excellent, tasty and felt authentic. However the venue for the meal lacked any ambiance or class.\nI came here because of the good reviews, and my food lived up to them. The over-all experience though was tainted by the lack of ambience and friendly service. Don't get me wrong - the service was good. I just wasn't classy enough to make me smile.\nIn a nutshell, if you want tasty Chinese food in Chinatown you can get it here. If you want a more pleasing environment in which to experience it go elsewhere!",
                "datePublished": "2014-06-05"
            },
            {
                "reviewId": "QSXQDAgmPicfQyrSSqKOFw",
                "author": "Ela T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is my other half's favourite haunt for roast duck. It's not hard to see why as their Bayswater branch is famous for it, they have won countless awards (and glued these to their window and walls, including newspaper clippings for you to read while you wait!)\nA quick summary before we begin:- If you want tasty roast duck, come here. If you want excellent service to go with it, please look elsewhere because you will not find it here.\nTo elaborate, the roast duck is the juiciest duck you will ever taste. Sometimes it may be overly fatty but the fat is what makes it taste so good. The soya sauce that comes with it is really sweet and I can only imagine the amount of sugar that has gone into it. However, I cannot complain as I have a sweet tooth and generous helpings of this sauce with the roast duck makes me a happy bunny.\nI usually get the roast duck for takeaway to eat at home, unfortunately the price has gone up recently, it's around £18.50 for a whole roast duck. If you are ordering takeaway please ignore the queue outside and just go straight to the till to order. \nSometimes if you come really late in the night (I actually mean 9pm) they would have sold out of roast ducks. Have no fear, they opened another branch about 3 min walk away down the end of Gerrard Street, at Wardour Street. They usually have a few roast duck hanging up even though this branch has run out.\nOnto the issue of service. Inevitably you will see a queue start forming here as early as 6pm. The restaurant is tiny and there are just too many people trying to eat here all the time that you end up freezing outside while you wait. If you do manage to get a table, you will get one of these two:- get ignored by the waiter for refills of drinks, or get hurried by the waiter to pay up and leave so they can sit someone else down. If you are lucky you will get both treatments!\nTip: maybe stick with takeaways and cook your own rice at home!",
                "datePublished": "2014-02-07"
            },
            {
                "reviewId": "7Mzzd9BwFsnLI7m7iwjYAQ",
                "author": "Cuong V.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Don't expect service at all. If one come for the boneless duck - one will be in heaven! Who knew duck could be so tasty and tender! Shut up and take my money even though your service sucks big time and you even charge for service.",
                "datePublished": "2015-11-16"
            },
            {
                "reviewId": "OB1RgyWSTn34M61zH73shQ",
                "author": "Christian S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Went to this restaurant for lunch with work. We had heard great things about the duck and rice and we all ordered this along with vegetables. Very tasty and excellent service from the staff.",
                "datePublished": "2015-08-18"
            },
            {
                "reviewId": "nytYO39WUjnkbJI9EF8FpA",
                "author": "Omar A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I usually give 4 stars for good restaurants but I will start giving 5 till yelp sorts it's self out with having more detailed review options as in a rating for ambiance, food and service etc. \nNow to the review call me racist but when I go to Chinese restaurants I don't have any expectations of your European standard \"good service and hygiene\" it's just a cultural thing I guess. \nBut this so far is my favorite roast duck joint and has the sweet and sour chicken the other day and was great. \nPro tip:\nWas told by my old lecturer back at Uni ( he was Chinese obviously) if you want to know how good a Chinese cooks food is ask him to prepare it with out msg. So ye give it a go taste the difference. Ofc the pre made stuff can't have the msg omitted.",
                "datePublished": "2014-04-30"
            },
            {
                "reviewId": "oyKbPP5VbGGEyA_p3oYP3A",
                "author": "Hazel N.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Post ECC cocktails my friend and I were a little peckishand wandered right next door to the Four Seasons.\nIt's just your standard Chinese Restaurant, nothing special, white wall, Asian Pictures, etc...  Service was curt, food was palatable.\nEnergy levels restored and we stepped out into the dark and rainy night.",
                "datePublished": "2013-11-21"
            },
            {
                "reviewId": "RjYkjO0aMTFM1-yUatEDKQ",
                "author": "Joy L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "For good and well-priced Cantonese cuisine, this is the place to go. I have been here many times and have even brought my Cantonese parents when they were crazing home-cooking. \nIf you're a meat fan, order the sample plate where you get the BBQ pork, soy sauce chicken, duck, and fatty pork. It's incredible... my favorite is the first three because the fatty pork can be dry sometimes. The noodle dishes (stir-fried rice noodles with beef) are a must, and their seafood (pineapple shrimp) is not bad either. \nBe wary of the waiters though because if they think you're tourists, they will try and get more tip by falsely claiming their added service charge is for the government, not for the restaurant... completely absurd. I was a bit insulted but it hasn't happened again and the food is so good, so I will definitely go back here.",
                "datePublished": "2013-11-21"
            },
            {
                "reviewId": "DnGYqzC1llpDkpgU9khH8Q",
                "author": "Mike J.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Distinctly average.\nCramped seating (downstairs anyway), average-tasting food, a bit expensive, so-so service. With so many other restaurants in Chinatown, I can't see myself coming back. My advice is to only eat here if everywhere else is full and you can't be bothered to wait.",
                "datePublished": "2015-09-04"
            },
            {
                "reviewId": "esInWBUQq8I_-8RIRbtqAA",
                "author": "Darren N.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Had take out as I heard that the roast duck with rice was the best here. Therefore, I walked out with that one item. \nIt was amazing and the sauce was even more amazing.",
                "datePublished": "2015-08-10"
            },
            {
                "reviewId": "Sb7ctJhif8Be8VaS77-GtQ",
                "author": "Ploychompu S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I don't know about their regular menus but the duck is one of the best I've tried so far. Really really good.",
                "datePublished": "2013-12-04"
            },
            {
                "reviewId": "mdVKvGKbl2SzsRwlWVQQdQ",
                "author": "Maisie L.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Absolutely appalling services. Will not be returning. Although the food is decent we cannot put up with the services! There were five of us and we were placed at a table for four (which is quite crowded) and we asked whether we can moved to a larger table when it was not busy and they refused with a terrible attitude. When we sat down as well, no one offer any tea or drinks to us - which is typical in a Chinese restaurant- and the attitude is horrendous. When we were ready to order the waiters just ignored us and carry on to talk instead of coming over and help us. When we trued to order more plain boiled rice, they \"forgot\" and we had to ask them again before giving us the rice. \nThe most disgusting thing is that they charge a compulsory 12.5% service charge and even ask for more tips at the end. Why would we pay any tips for the appalling services they gave us?",
                "datePublished": "2014-04-10"
            },
            {
                "reviewId": "ZNi6vbPqcmRTi7pQIm5fNw",
                "author": "Calvin T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I'm a huge fan of the duck which is out of this world, unfortunately the service is a hit and miss (most likely miss). Typically rude Chinese service that I expect if I am in Asia but not when I'm in London. Oh and don't bother turning up in the evening after dinner hours as the meat has gone cold and chewy.",
                "datePublished": "2014-10-02"
            },
            {
                "reviewId": "egGU836VcKBaHNIhlj2okw",
                "author": "Lauren W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "On a international trip to London with my gals, we were HIGHLY recommended to go to this restaurant by an American ex-pat living in London. Many of us tried the same things, but there are some things that I have had at this restaurant that stand out as being the best Chinese I've ever had in my life. We all split the duck with the pancakes. I was quite hesitant to try duck, as I never have been fortunate enough to see this variety in my daily diet. It was amazing! The pancakes (of course, I had not known what this was since Americans have a different cultural knowledge of pancakes) complemented the appetizer so well, that I wanted more! But I'm really glad we didn't. Our main course came, and we all sampled the variety of duck and chicken in many different sauces: sweet and sour, orange, and kong-po. I know there were some other dishes that were ordered, but I do not recall at the current moment. We had visited here on our first day in London, and decided we loved it so much that we made reservations for the last day. What a great decision! When I come back to you one day, London, I will enjoy this wonderful restaurant again!",
                "datePublished": "2013-01-10"
            }
        ]
    },
    "80": {
        "id": "H2hMVEI0OM2k5c0v1iBoag",
        "name": "Four Seasons",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "12 Gerrard Street\nLondon W1D 5PR\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6JLOFSkm-1Y1tLgYh9odbQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7494 0870",
        "review": [
            {
                "reviewId": "6p-pDvJ_YD1vFrHwcVfUMw",
                "author": "Andrew Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Restaurant which specialises in Roast Duck. If you go here, you MUST have the duck. It is absolutely delicious. I like duck anyway but this is just lovely. My mouth is watering now thinking about it!\nPS - I would rate this 4.5 if I could but Yelp doesnt allow half marks.\n(Few days ago I wrote review for the wrong Four Seasons. Sorry about that. I have removed the other one now).",
                "datePublished": "2010-05-22"
            },
            {
                "reviewId": "Ri6Fpt80hwAf8gYGaTbW-g",
                "author": "Elizabethe A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Fending for myself on the mean streets of London for a few days, I had no idea where to go or what to eat. When I finally exhausted the recommendations of friends, I went in search of something undeniably delicious that I knew wouldn't disappoint me and I wound up in Chinatown, in a well reviewed restaurant, where they waste very little time on decor and atmosphere and they spend all their time on what's important. Roasted Duck.\nSimply food. Walk in, sit down, order half a duck with white rice, sit, and feast. The skin was crispy and fatty, the meat was tender and plentiful. I could not have asked for more on a rainy London day.",
                "datePublished": "2012-10-09"
            },
            {
                "reviewId": "khqQmCHEq7-vc00Pq_OF_w",
                "author": "Joey T.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Terrible service! Food wasn't delicious and even their signature roasted duck was just mediocre...wouldn't come back again",
                "datePublished": "2014-10-21"
            },
            {
                "reviewId": "QQpkdOzMyX7Htkq10IpQUA",
                "author": "George W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Roast duck. Crispy skin, fat, and juicy. Do I need to say any more?",
                "datePublished": "2015-11-28"
            },
            {
                "reviewId": "MsNM-aX_Lnm58Rs5Exvl6g",
                "author": "Icha S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Oh Chinatown, no matter what city and country I'm in the service just as bad. Can't complain I suppose, although I have to admit this was the rudest asian restaurant I've ever been to. The food however makes up for most of the crappy service. I recommend the boneless ROAST DUCK. The sweet soy sauce just PERFECTION drizzled on. Every time I'm in town I stop by Four Seasons. Though, if you do takeaway they don't give you the veggies that comes with the order when you eat in :( I'm a bit sad when i found that out. If you're bringing buggies you might be yelled at since the restaurant is small, which is really RUDE. I still have to give a 4 for that duck, coz even LA's chinatown got this beat from the get go. :)",
                "datePublished": "2014-07-14"
            },
            {
                "reviewId": "0JXfkxWCThy7YwSO1_jtJQ",
                "author": "Sapna A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Wondering how we missed this Chinatown gem for so many years! Missed their signature roast duck, all finished just as we arririved.  We ordered their seasonal menu and the food was delicious! I ordered frog legs with bitter melon and minced grilled pork with lotus root, hubby ordered spare ribs and conegee with pork and oyster! Shame we couldn't order more.\nPortions are generous but what's the harm in getting a doggy bag to enjoy it at another meal!",
                "datePublished": "2014-10-04"
            },
            {
                "reviewId": "WQ8avagNzTjZn96m1Gd-Ng",
                "author": "Amanda H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This place is known for its Roasted Peking Duck (with pancakes) and it was excellent.  The hot and sour soup was also delicious, however, the seafood udon did not have much flavor.  The service here is pretty rushed (most is in this touristy part of town).  While the duck was a bit pricey for the portion size, I'd come back again but skip the udon.",
                "datePublished": "2015-12-26"
            },
            {
                "reviewId": "g9iwTrt03nRiLIhPwbYKiA",
                "author": "Najah Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "\"Do you like duck?\"  This was the question that was asked of me (quite randomly I might add) by my friend while I was visiting him in London.  I do happen to be a fan of duck, so when he recommended we go to the Four Seasons in Chinatown, I was all for it!\nThe place is fairly small and looks like most Chinese places I've been to.  There were seven in our group so we were sat at one of the larger tables in the back that have rotating glass in the center (very good for family style sharing).  Since my friend had been here before, we let him do most of the ordering.\nWe started with hot and sour soup (one of my personal favorites) which was much spicier than what I've had here in the States.  I'm a huge fan of spicy food so that was no problem for me!  We then moved into our main courses of whole roasted duck and BBQ duck, both of which were absolutely delicious.  The whole duck came with thin tortilla-like wraps that we used with veggies and sauces to make our own duck wraps.  I'm not such a fan of the BBQ duck as it's a little fatty for my liking.\nWe also had a shrimp dish which was pretty yummy.  For whatever reason, someone thought it would be a good idea to order Lychee wine.....yeeeaaaahhhh....not the best.  It was way too sweet, strong, and just overall not good.  Wouldn't recommend it.\nFor dessert we had just plain old Lychee which WAS delicious.  Those sweet little balls made my mouth very happy (that's what she said).  When you're done with your entire meal, they bring you oranges (kind of like an after dinner mint).\nThe service wasn't too bad.  It was a little slow at times and one of the smaller dishes we ordered never made it to our table, but they were very nice about taking it off our bill.  Overall, I would have to agree with the masses and say that they have the best duck around.",
                "datePublished": "2010-01-09"
            },
            {
                "reviewId": "gNDn4831aLyPaQPuiqtxHw",
                "author": "Qype User\n cerule…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I have to confirm that their roast duck Cantonese style is delicious. It's the their speciality here. The skin tastes good, the flesh is tender and juicy. We ordered half of a duck (£11) but we could not even finish it! Fortunately they do takeaway.\n The rest of the menu is not interesting. We had some Fu-jian rice, with carrotts, asparagus, duck and scallops; it was greasy and insipid. I would rather come back for the duck only!\n The room is clean and commonplace, the service is OK.",
                "datePublished": "2010-07-13"
            },
            {
                "reviewId": "kymgPJ3rxBkbvX4R-hJUtw",
                "author": "Qype User\n jdripp…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The best place we have tried on the main china town sreet so far. \nGood food, reasonable sized portions for what we paid. The service was also good. \nThe duck is especially good.",
                "datePublished": "2012-05-06"
            },
            {
                "reviewId": "zHbOhGrbu0462RUpNIB8_g",
                "author": "Laurie P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This was quite the experience!  Loved the food.  Service was spot on, if a bit brisk. Fun to watch the staff do their thing.",
                "datePublished": "2013-07-16"
            },
            {
                "reviewId": "smx2pXiK_mM6YVdnLHAkNQ",
                "author": "Hannah G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I'm always a little wary of China Town which really annoys me. I think it's because I always get lost and have had one to many bad experiences of all you can eat buffets served in a trough! I want to be one of those people that can navigate themselves round windy streets and no the best place to get Crispy Duck and any time of day or night. Alas, I am not... until now. \nOK, so there wasn't much street winding going on considering Gerrard Street is the main street in China Town but none the less I am now quietly confident I can challenge any China Town veteran to the 'best duck ever' stakes. \nI came to meet my boyfriend and his Mum here, the previous night we had had a fight, now I was running late and screaming down the phone because I was lost. The ambiance was not great. No matter, once I got into the restaurant the waiters were so friendly and instinctively poured me a glass of wine that I suddenly began to feel more relaxed. \nThere was no pressure to hurry in this place which I think is one of the most important things. We were able to order our Duck and starters and take our time over them. The Duck was as good as I have ever had, really meaty, we ordered a half and we got a big half! \nAfter a leisurely start we were obliged to order mains, even though we were actually all full. Ordered was: Mixed Seafood and Noodle Soup, I thought this tasted like pond water but everyone else seemed to like it, weird! Salt and Pepper Squid, this was amazing. Best I've had in a Chinese restaurant. The batter was really light and crispy with just the right amount of chili's, there was way to much for one person but I didn't let it stop me. There was also Sweet & Sour Pork and King Prawns with seasonable vegetables. I presume these were also both delicious as I didn't get a look in. \nFor the four of us with 3 bottles of wine, duck, starters and mains it came to just over Â£100.",
                "datePublished": "2008-11-19"
            },
            {
                "reviewId": "xhZw0azFFWKM2fzIW-ldvw",
                "author": "Emily C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "i'm from a very Asian area in the USA and there are two Chinatowns near my house.  I eat Chinese food all the time, yet this is by far the best roast duck I've ever eaten.  Hands down.\nduck in London is better than most other places because they are naturally leaner.  the duck was roasted well: crispy skin, scrumptious taste/barbecue, lean indeed.  the renowned sauce which is a well protected secret is the best roast duck sauce i've ever had.  it's not too salty and has a tad of sweetness to it.  the roast duck dipped in the sauce is heaven in my mouth.  the sauce over rice is also great.\nthe only downfall is that after a while, the duck gets really oily and the bottom of the box/plate is drenched in oil.\nthe barbecue pork is also extremely delicious, also one of the best i've had.  great marinade/barbecue taste.\nthe roast pork was slightly salty (but then again all Chinese roast pork is).  the skin had a great crunch to it.\ni was vacationing in London for a few days but i had to come here twice!\ni ordered the food to go both times.  the cashier/waiter was friendly and helpful the first time.  but the cashier/waitress was gruff and very rushed the second time.  but i still give this restaurant 5 stars for the best roast duck in the world.",
                "datePublished": "2011-07-21"
            },
            {
                "reviewId": "kRHWl1BQVDRfpPPh5aTzPg",
                "author": "Michelle T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I've been told this is one of the best roast places in London. It is really good for roast duck and soya chicken. I've tried the crispy pork and BBQ pork too, but I have had better back home (Melbourne). That said, it is one of the best roast places in London Chinatown. I buy take away from here regularly and I've come here to eat with a group of friends a few times. It's a good place for a large or small group as you can order mains and share amongst the table.",
                "datePublished": "2014-02-20"
            },
            {
                "reviewId": "G6GpV80IJusZkX686gn99Q",
                "author": "George H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": ":) \nThe roast duck, roast pork, basically anything BBQ was great here. Came here for lunch and dinner and both times I left super full. \nMust try the duck, but I preferred the pork. It was great and so was the service. The prices were decent and the seating was ample. One of my favourites in Chinatown and the host is friendly.",
                "datePublished": "2010-06-21"
            },
            {
                "reviewId": "DbGpt0wG-zY2xEurEbhoSg",
                "author": "Jenn G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Came here for dinner the other day and gotta say, the food was quite good. Had the duck which was really tasty and the meat was really tender. Also had some veggies (up to standard with most Chinese restaurants!) and a fried tofu dish. The food was great and by the time we were done with our meal, there was a queue out the door - that should tell ya something!",
                "datePublished": "2012-12-06"
            },
            {
                "reviewId": "XFtVFaK2ERjPyZTvtg7pdg",
                "author": "Allan C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Okay so saam bo fan (3 bbq meat combination over rice) in NYC won't cost nearly this much, but hey, it's london, and where else can you get this kind of tasty food for £7. \nDon't be silly, get the 3 meat combo (roast duck, roast pork, soy sauce chicken). Use the ginger scallion sauce... all of it - mix it in your rice!\nWe're going back tonight.",
                "datePublished": "2010-05-14"
            },
            {
                "reviewId": "S9DeZ9Ua4to3pptcGregSA",
                "author": "Vicky L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Another Thursday, another Chinese in 25 minutes review.  My rice with bbq duck and roast pork was delicious with about a 5 inch strip of each pork and veggie.  It came with a larger than normal portion of gratuitous chinese cabbage (i.e. more than 1 leaf).  As others have said, the soy gravy that comes with it is quite sweet, but I like it that way.\nThey were nice people there, with 3 types of chillies and gave me soured plum sauce immediately when I requested it.\nThe bad thing was they dumped some oranges on my table before I finished the plate and then dumped the check on the table whiles I was finishing the orange.  They took the bill away the second I reached for the mint and my hand left the bill container thingy.  Although I get that it is busy, I didn't appreciate being literally swept out of the restaurant.  I must say, it was probably them more than me who kept the meal to the 25 minutes limit.\nFood:  Solid 4.5 stars.  Service: (minus 1 star) = 3.5 stars.",
                "datePublished": "2009-11-03"
            },
            {
                "reviewId": "dfRmxGAh5cuS0FeP15rhXA",
                "author": "Max J.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Over many visits to this Chinatown staple I have sampled many of their excellent dishes and I can honestly say that I have never once been disappointed. Four Seasons is known for their barbecued meats and for good reason. Their Peking Duck is succulent and tasty. I also have their Crispy Aromatic duck which is very flavourful and crispy- the most perfect incarnation of this dish that I have ever had. In terms of other starters I have had the Peking Dumplings (strong flavour and very 'juicy') and Vegetarian Spring Rolls (Crispy with a high amount of vegetables inside). In terms of Main Course I have a group of dishes which are some of my favourites in the world. The Pork chop in honey and pepper sauce (from the Chef's Specials) is delicious, the pork chops are always flavoursome with a crispy exterior, the sauce is absolutely delicious and sweet with an almost caramel texture this combined with chopped up onions makes an absolutely stunning dish. The Black Bean dishes are also very good. The Beans themselves are as tasteful as ever and are slightly soft as (in my opinion they should be) and with a kick of chili it is very good. I would recommend the Beef in Black Bean sauce rather than the pork as the Pork is sometimes a tad too fatty for me. The Singapore Noodles are also very good with another hit of Chili to add to the flavour. As someone who is a huge fan of Mushrooms the Chicken with Chinese and Straw mushrooms is delicious and always comes with a hearty helping of various Mushrooms. The straw mushrooms are especially delicious!! \nEven though I have visited many times and have eaten many dishes there, there are still loads of dishes I want to try, the Fish dishes will be next I think. Anyway it has a great range of dishes at very competitive prices; we spent about £25 a head and had more food than we could eat. The only negative for some people may be the service. It is not always particularly efficient and/or 'chatty' but thats exactly what gives this place it's authentic charm.\nOverall:\nPrice: Very good for the volume of food (Around £15-25 a head)\nFavourite Item: Pork Chop in Honey and Pepper Sauce.\nWorst Aspect: I honestly cannot name one.\nWould recommend? Definitely I plan to go back as soon as possible.",
                "datePublished": "2015-01-03"
            },
            {
                "reviewId": "hS0GwC_8f1MxxFnL76u7kQ",
                "author": "Chris O.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Best roast duck in the world? That's what Financial Times writer Nicholas Lander reckons and it was his write up about Four Seasons that led me there. I'm not too sure it's the best in the world but it's the best I've had in London and on par with the roast duck I had at the considerably more upscale Peninsula Hotel in Beijing.\n One piece of advice based on my experience at Four Seasons: forego the rest of the menu and just order the duck. Everything I've tried on the menu is pretty good but nowhere near as good as the duck. Besides there are plenty of other decent Chinese restaurant around Chinatown.",
                "datePublished": "2010-07-04"
            }
        ]
    }
}