{
    "0": {
        "id": "P3k-TuoP7q5j88hoykbKag",
        "name": "Misato",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Leicester Square",
            "streetAddress": "11 Wardour Street\nLondon W1D 6PG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/VTzxvNruI1mJJI6hxdOyDQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7734 0808",
        "review": [
            {
                "reviewId": "G_OXNEGVoigd32C0vlGQeg",
                "author": "Elizabeth C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Misato is easy to miss from the street, but it'd be a shame if you did! In a city where large, comforting portions in a thoroughly unpretentious setting can be hard to find, Misato is a breath of fresh soup. They have a large menu with udons, curries, katsus, tempuras, udons with katsu and curry in it, you get the idea. \nHere's what you should do. Come hungry, with cash, and be prepared to wait for just a short while, maybe 15 minutes. There are many tables and they move quickly but it is very popular, for good reason! Order some tempura for the table and crack open an Asahi Super Dry, or a ramune for the kids. Then enjoy your plate of crispy katsu drowned in curry, or your hearty bowl of udon or soba. Leave with a full belly and satisfied grin.",
                "datePublished": "2018-10-05"
            },
            {
                "reviewId": "rxL_0XJYqOhrSeXcpVT8aA",
                "author": "Jack P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Honest review from going to this place for over 6 years.\nFood:\nThe is generally quite enjoyable with a good variety of Japanese style dishes, although the authenticity of the restaurant I wouldn't say is high, some dishes have their own more unique taste, rather than authenticity Japanese. I suggest dishes with teriyaki sauce, although abit sweet. Ramen/Udon dishes are also a solid option, the sushi tends to be abit dry but overall good. Quite cheap, dishes costing generally £4.50-£7 for mains, £2-£5 for sides.\nAtmosphere/Facilities:\nThe restaurant is often quite busy, more so on evenings during Thursday-Sunday. In the summer the restaurant tends to get quite hot and humid if you need to sit more deeper inside the restaurant, I recommend trying to get a table near the entrance during the summer. The restaurant appearance of the restaurant is dated and would benefit from a refresh such as making all the walls more brighter and the tables/chairs being updated. The toilet is downstairs that could also do with the same treatment as it's quite dark the locks on the doors aren't strong/stable\nStaff: The are generally friendly, some more talkative than others, but always at least polite. The staff can often be busy so you may need to wait to get service. I would say the more polite staff is the male cashier.\nOverall Misato is a cheap spot in Chinatown you get what you pay for, good taste, although not highly authentic, nevertheless give it a shot, you may enjoy it like I have over the years",
                "datePublished": "2018-07-28"
            },
            {
                "reviewId": "4fzHLT6bS8ztYn4fR7IGmg",
                "author": "Dora L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good portions, fast service and the price was very reasonable for the area. I recommend this place if you're looking for a quick meal.",
                "datePublished": "2018-10-15"
            },
            {
                "reviewId": "En23CGhKAZfKsJ8KrksY9A",
                "author": "Alan C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Stumbled upon this little Japanese hole in the wall. Once I saw Katsu Don on the menu, I was hooked! And sure enough it's spot on with ones I've had before! I tried the sushi and that not bad either. Cheap, good eats, good service! Authentic with a great price point!",
                "datePublished": "2018-09-26"
            },
            {
                "reviewId": "iivYt_ijV5CKNPC1TRRSrw",
                "author": "Pamela N.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Good simple food, I ordered udon beef and was a good portion the broth was yummy but the beef was ok",
                "datePublished": "2018-07-26"
            },
            {
                "reviewId": "OHUpt0Fz7aByKKmZtrc6TQ",
                "author": "Jackie L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "So that's what the line was for! Everything is dirt cheap. Don't recommend the fried chicken but the chicken Katsu was decent. The tea was excellent as they gave us a pot so we got our fill. Service was incredibly fast and polite.",
                "datePublished": "2018-04-27"
            },
            {
                "reviewId": "yb7DSofsGh5gRfBgew16fQ",
                "author": "Mariel P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The prices are cheap. I had the chicken katsu curry and it was so good. The portion was decent. I must also add, the service was quick. There can be queues at times, especially during peak hours. This is quite understandable as their food is really legit. I love their home made salad dressing. The only thing is, they do not accept cards.",
                "datePublished": "2018-08-20"
            },
            {
                "reviewId": "0hc6N12x5tdhBm_pyd5L2Q",
                "author": "Irene B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Simple. Inexpensive. Delicious. \nCome here to get your fix for Japanese comfort food. This small joint in the heart of London offers big portions of quality food for more than affordable pricing. \nIt was my GO TO when I lived here and now that I am a cross the world I come here every time that I am in town. \nI had the chicken teriyaki ~$7. Salad, chicken with homemade teriyaki sauce and white rice. \nSalmon and Tuna roll ~$4 for 8 -10 pieces of delicious fresh fish! \nThe restaurant is very small, around 11 tables, expect a 30 minute line at all times. \nThe bathroom isn't the cleanest but good enough. \nI will keep coming back! \nCheers!!",
                "datePublished": "2018-03-28"
            },
            {
                "reviewId": "_Qq7p5Xl9uyVn0uPu2FDQA",
                "author": "Dennis W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "It's always busy, but no matter how busy or how long the queue is they're always very FRIENDLY and their food has always remain a top quality and big portions for a little price.\nCompared to Eat Tokyo this is so much friendlier and staying small has really pay off.",
                "datePublished": "2018-05-13"
            },
            {
                "reviewId": "510LVHb1DK0jWmp_HLO2vw",
                "author": "Hanfang Z.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The food is remarkable with low price.\nThey only accept cash, which is annoying\nThe service and surroundings are OK.\nDon't forget to bring cash， and you usually have to wait because it is not big enough",
                "datePublished": "2018-03-30"
            },
            {
                "reviewId": "tiWkilU--wi1VHW7q4_T-Q",
                "author": "Kevin G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Quick, cheap and delicious. Large plates make it one of the best values in China Town.",
                "datePublished": "2018-07-22"
            },
            {
                "reviewId": "N9-f2kWerW3Qo-QzAh9Frw",
                "author": "Adrian Permata S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I hadn't been to Misato for years and was a little underwhelmed with my return. I ordered the following:\n- Curry beef udon\nThe curry arrived with a neat mound of curry paste in the centre of the bowl which needed to be stirred in which I thought was a nice touch. I like dishes that are left incomplete to encourage an interaction with your plate for the added sense of freshness and satisfaction that you have in some small way contributed to your meal. The taste however was a little sweet for me with nowhere near the amount of savouriness it needed. The half boiled egg it arrives with was also boiled a minute or two too long resulting in no added creaminess which could have helped.\nThe beef slices were tender and the noodles also nicely spongy however so it does have some redeeming features. The staff were also fast and efficient so I may come back in future (perhaps in another few years!).",
                "datePublished": "2018-08-12"
            },
            {
                "reviewId": "Ld_lFLKy4_ZsBOQKNB391g",
                "author": "Deric C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Misato..i visited here I guess a lot of times since it first opening. It has my local favourite restaurant...you can't beat the price here for Japanese foods. That is why they always have a long queue. They still do big plate of dish and rice cost £4.50. I like tori karaage, avocado Maki sushi and chicken or Salmon teriyaki rice dishes here. It is always taste good and satisfy me.",
                "datePublished": "2017-08-21"
            },
            {
                "reviewId": "prL6Aj1KVt0drQKeTRHFyw",
                "author": "Mark L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This place isn't particularly expensive but the quality definitely isn't the best. I ordered a beef udon bowl and it's soup was ok at best. It wasn't rich in flavor. The beef cuts were grainy and were essentially over cooked. However, the low price does justify it a little. I wouldn't recommend this place if you're looking to a date here, maybe as a last ditch affordable restaurant.",
                "datePublished": "2018-09-12"
            },
            {
                "reviewId": "LQQYWGroBRD5phPNlOUW6g",
                "author": "Jacqueline C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "What a great discovery in the heart of Chinatown. A fast and casual Japanese restaurant serving sushi as well as noodles and rice dishes. The restaurant is small and I wouldn't consider the food top quality but people come here for a no frills dining experience - everyone knows the drill, which is to order, eat, pay and leave because you know there's always people waiting. I came here with a friend on a Friday night and only had to wait a couple minutes. The staff aren't the friendliest but they're definitely efficient. \nMy friend and I got the chicken katsu curry. First thing I noticed was the portion size - it was huge! There were about ten strips of chicken next to a heaping pile of rice and some side salad. The chicken katsu was crispy and juicy, and the curry sauce was so flavorful, it tasted like it had been cooking overnight. I was so content after my meal and the best part is, it only costed me £7!\nMisato will become my go-to spot. Definitely come here if you're in the area and craving some fast and easy Japanese food.",
                "datePublished": "2017-07-10"
            },
            {
                "reviewId": "Ne5QF2BX6gdnEZQjhcqMOg",
                "author": "Jenny T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Excellent food and very reasonable prices, service was very nice, tourist friendly...hidden gem!",
                "datePublished": "2018-05-30"
            },
            {
                "reviewId": "WEOP9no-zrQzBfLUqDAG0g",
                "author": "Seo Young M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is one of the best Japanese restaurants in London because of its tastes, price, and portion. It's relatively cheaper than other Japanese places and yet are generous in portion!",
                "datePublished": "2017-05-05"
            },
            {
                "reviewId": "Yyq5xBeskFbqsUrCX8qgxA",
                "author": "Kel P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Awesome food and even more awesome a price! Is it the most authentic? Well not really but hey you won't find authentic at that price point and certainly not in china town. \nI cannot recommend this place more! The curry beef udon, pure yumness!",
                "datePublished": "2016-05-25"
            },
            {
                "reviewId": "-XEUsZPOZZvocd3myULIKg",
                "author": "Adria C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This place wasn't TERRIBLE, but I honestly thought from the reviews that it was going to be some kind of underground experience where the sushi was low key mind blowing. We ordered nigiri (they called it something else on the menu but this what we call it in the States) and the rice was cold and chewy. They were pulling it from a fridge and plopping some raw fish on top. It was cheap, sure, so I suppose you get what you pay for. Not mad about it, but would have def gone somewhere else for sushi and paid top dollar for legit nigiri. I think you're better off going elsewhere for a few bucks more.",
                "datePublished": "2018-05-13"
            },
            {
                "reviewId": "BgehC7sjZkOg1CDRbW2N2A",
                "author": "Katie W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place is my family go-to restaurant for kinda-quick, delicious and filling lunch/ dinner. If you go at lunch, probably 2:00 for less queuing, and if you decide to go for dinner, go at 5pm or 7pm to avoid that traffic of people all wanting a piece of that cheap but delicious food. \nDonburis (less of a rice bowl, more of a rice plate because it's too much to fit in a bowl with the salad, meat and rice). The bento boxes are good but if you go to Misato and want to get your money's worth and feel full and satisfied go with donburis. Bentos are like £11(?) Donburi's like Gyudons cost £6.50 and go up from that. Ramen is alright, nothing really that authentic IMO, broth is clear but meat is lacking when it comes to the ramens, and I wouldn't recommend getting udons as your noodles. \nStaff is an it overworked (dropped a piece of tonkatsu as they brought out my dish) but they're still polite if you're not a total poo towards them. \nThe place is quite small and so you'll share tables unless you're lucky. And the place is cash-only as I recall. \nDrinks are a bit overpriced, ramune drinks (carbonated soda that tastes like lemonade but with a marble inside that reminds me and every east-Asian whether Chinese/Japanese/Koreans of their childhood).",
                "datePublished": "2017-02-26"
            }
        ]
    },
    "20": {
        "id": "P3k-TuoP7q5j88hoykbKag",
        "name": "Misato",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Leicester Square",
            "streetAddress": "11 Wardour Street\nLondon W1D 6PG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/VTzxvNruI1mJJI6hxdOyDQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7734 0808",
        "review": [
            {
                "reviewId": "6nMLenkVAjCaVDiPmX-XyA",
                "author": "Mei S.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Had high hopes for this place as it always seems to have queues outside all the time, so finally decided to try it but went a bit earlier to avoid the queues, and it worked and got a table straight away.  \nWe decided to try a sushi platter to share to start off with and followed by the beef udon, and my companion the Pork Katsu Curry Udon.  The drinks came pretty quickly, a beer and a aloe vera.  Then my companion was served his dish and he had almost finished his meal before I was able to get the attention of any of the waiters who were busy running around at the back of the restaurant or sorting out payments at the front of the restaurant, and at no time look over to where I was sitting and waving for their attention.  Finally, caught an eye of one waitress who said she would check.  Then a long wait before my meal came.  And what a disappointment. The beef was so shredded that it looked like it was the left over bits. The texture was really weird and tasted strange.  I did not enjoy it at all. Also the soup was much too salty.  \nI then had to ask several times for the bill.  After the third time, it finally came.  When I went to pay, I gave them enough to pay for the meal without the service charge and the girl who had just returned from her break, asked if everything was ok, and I said not really, although the sushi was good. \nI have never had a bad Japanese meal, even very cheap ones, so the experience here was very disappointing.  A pity.",
                "datePublished": "2016-03-27"
            },
            {
                "reviewId": "sIhaav6jp3pv-NDFEknIhg",
                "author": "Susannah H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Loved this little Japanese restaurant. Got the chicken katsu curry with rice, pork katsu curry udon, salmon teriyaki with rice, and shrimp tampura. All were really great, and cheap. Each dish is about 6-7 pounds. Highly recommend.",
                "datePublished": "2018-01-02"
            },
            {
                "reviewId": "OlPxjoBj-VxcDFu3inYavw",
                "author": "Linda F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Exactly as advertised: cheap and cheerful. These kind of restos just have a special place in my heart. I just love the hole-in-the-wall-ness and the fact that everyone piling in is there for the good eats. I find that in these cases, everyone queues nicely, politely. You sit, order, eat, pay, and clear out because you know there are people waiting for your seats. There's no pretence, it is exactly what you see, and the event of sit-order-eat-pay repeats itself hundreds of times a night. The servers know their roles inside out, and everything runs like clockwork. \nI had katsu curry and rice, although their bentos looked good too.  Food was hearty and tasty. I was perfectly happy and full by the time I left.",
                "datePublished": "2016-11-03"
            },
            {
                "reviewId": "05ZXaX-_bOEmVpAlwbrfpg",
                "author": "Meg K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Once you eat here you understand why there's a line outside. The fish is so fresh it melts in your mouth like butter. Inexpensive, no flash and all substance. Make it a destination!",
                "datePublished": "2017-07-03"
            },
            {
                "reviewId": "1ri0E5yltYY4CgGcV2xRTQ",
                "author": "Anna A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Misato was a total discovery.\nI was stumbling around Soho, checking the same restaurants, high prices and wondering, where can I get some decent Asian food?\nMisato is everything you can ask for. Japanese inspired cuisine, with HUGE portions and really low prices.\nThe menu is quite wide, rice based dishes, sushi, sashimi, rolls, curries... There are vegetarian/vegan options. Just so you have an idea of how big the portions are, please check the photos.\nThe tofu balls filled with rice, are absolutely spectacular, sweet tofu and well cooked rice on the inside (but really filling beware), and the tofu steak rice is also amazing, it comes with a generous amount of white rice, an amazing sauce in the middle and grilled tofu with a big side salad. The dressing is mayonnaise based, so if you are vegan please ask for this to be aside.\nMy friends have ordered Katsu Curry more than once and the amount of chicken is ridiculous, I will say this again, I hope you are hungry when you get there!\nCheap, good, filling. My favourite 3 words when it comes to a restaurant :)",
                "datePublished": "2016-07-08"
            },
            {
                "reviewId": "-9bKMsVWfLVWrdKvjPh1Cg",
                "author": "Aya T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "What an affordable price!!! walked in for dinner at around 7:30 on Monday. There was a queue 8 to 10 people were already waiting. But we waited only 15min. The rotation of the customers must be quick since many of them come alone.\nWent for pork ginger which was quite nice. A little bit sweat taste.I liked it!! And only 6£.\nThe stuff were no Japanese though...by the way.\nIt's bustling with people, cramped and not really comfortable. So suitable for quick dinner ,dinning alone or when you are budget-conscious.\nI'll come back soon!!! It has a wide range of menu so I have many of them to try ; )",
                "datePublished": "2016-04-05"
            },
            {
                "reviewId": "Dzyb-wWxPgN02jJgvA79bA",
                "author": "Michele G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Easy place to find in chinatown at the end of the street.\nCame here around 6pm but got sitted right away after 5 mins\nOrdered the Katsu Chicken bento. Very cheap price and large portion. They give you a big amount of rice which was ok but a tad too mushy for me. Also there was a large portion of chicken katsu that was pefectly crispy.\nMy boyfriend ordered two plates of sushi but they were quite small sized so I would not reccomend ordering sushi plates because of that.\nOverall nice staff and cheap place to go for good asian food in london",
                "datePublished": "2016-06-25"
            },
            {
                "reviewId": "U9-VZzsQBdZVk45SIWiIxQ",
                "author": "Adrienne A.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Went in for some sushi and chicken katsu on a Saturday evening-6:30pm. It was pretty busy, the line was outside the door. Waited about 20 minutes for a table, which wasn't too bad considering the line. The food was pretty tasty and reasonably priced. I wouldn't mind coming again for a quick bite.",
                "datePublished": "2017-08-22"
            },
            {
                "reviewId": "LL6G9eFbwYlG7r0JU6bheA",
                "author": "Geoff Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good food but seems to be bulked out a little by rice. Ordered takeaway to take back to my office last night (sad I know...) and was happy with the price, but not that happy with how long it took. The Katsudon was ready and bagged and happily steaming away inside it's cellophane wrapped bowl, but the sushi was nowhere to be seen. It was only 10-12 minutes later that the sushi roll turned up.\nHowever, the food was good, a good amount of wasabi was provided as well as a bowl for mixing and dipping (rare!). The egg in the donburi had cooked maybe a tad more than I had wanted and there wasn't quite enough 'stuff' to go with the rice, but it was a good meal.\nI'll head there again for takeout as it was some good food. But I'll make sure that I order just one dish at a time. Warning if you're getting takeout, there is a chair but you'll be bumped every time someone walks past (which happens often). Standing is an option but there really isn't a place to wait.",
                "datePublished": "2015-11-03"
            },
            {
                "reviewId": "JXESeB2I7TRb8WaY2M6Mgg",
                "author": "Huy G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I had a pork katsu rice for 5.50$! 10% service tax made it 6.10$. The food was pretty good. Large portion!! Service was nice but they were understaffed so it took a while. I would totally come here for lunch again. Good for the yummy and pockets!",
                "datePublished": "2016-12-12"
            },
            {
                "reviewId": "FBngY7vb-DPRm7uRZvQKRA",
                "author": "Sophia T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love this place! When I was still a student back in secondary school, I would also struggle trying to have money to pay for meals particularly in Central London. My friends recommended me Misato. Misato is a Japanese restaurant located by Chinatown which offers cheap dishes with big portions. For most dishes the price for one dish is under £10 - although you need to consider the 10% service charge with the meal. It has quite a variety, and the place is usually quite busy because of its popularity. The restaurant isn't very big, but I personally enjoy the food there so I tend to come there a lot when I can - particularly if I'm aiming to be cost-efficient with food.",
                "datePublished": "2016-07-12"
            },
            {
                "reviewId": "_CXz2eb5j8Vk3-xdy7PGdA",
                "author": "Serene L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Portions are huge for most meals (the cold noodles are a little more manageable), and prices are very affordable, especially for central London.",
                "datePublished": "2017-07-07"
            },
            {
                "reviewId": "MrgLAgwVbBXvLYhncFdMCA",
                "author": "Serena R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Misato- the place is quite small but the service is quick. Sushi & Sashimi are great value. We ordered and were served in about 8 minutes. Quick, fresh, delicious. Highly recommend!",
                "datePublished": "2016-09-14"
            },
            {
                "reviewId": "NLUQF9C9UorR8ZFI8V_Lkw",
                "author": "Igor M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "We were looking for sushi in the area and after Google failed we decided to go with the favorable Yelp reviews. You must try the curry anything here. I had the curry pork Katey and I wish I lived here so I can come back. The soup my fiance has was good but not our cup of tea so to say. We also ordered the eel, salmon and tuna nigiri and should have ordered more. The cold sake is one the best I've ever had and no, the alcohol is not blowing this review out of proportion. Enjoy",
                "datePublished": "2017-06-11"
            },
            {
                "reviewId": "2tCfZKt4xgnAdNdPFULaoA",
                "author": "Wendy L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Great price for a large amount of decent but average food.  There is nothing special about the dishes like a unique take on these traditional dishes, which is why I'm giving this place 3 stars.  Chicken curry katsu is just chicken curry katsu. Rice is rice. Salad is letuce + dressing. I could have put this dish myself. Also, the curry tasted like the bullion curry bricks you can buy in the asian grocery stores...not the made from scratch goodness. This place is worthy of a second visit though.",
                "datePublished": "2016-09-22"
            },
            {
                "reviewId": "XCrsakPce72zczVrQrjZxg",
                "author": "Kathy W.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "According to local Londoners, the line for this place is usually out the door, but I guess I just got lucky when there wasn't even a line.\nI got the chicken katsu teriyaki, mainly cuz it was recommended by yelp-ers. Poor decision -- the chicken was breaded pretty heavily, lots of fat too, and just drenched in sauce.\nLarge portion size, if you liked the dish.",
                "datePublished": "2015-06-02"
            },
            {
                "reviewId": "RcukcHMCyaJLl3iT0YS6Hw",
                "author": "Ray C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I stick by my old review - this is still an extremely reasonable priced  resturant with reasonable quality food. Where else in London can you get a Sasimi bento box for under £10 that fills you up and send you off waddling home - especially this central?",
                "datePublished": "2016-02-12"
            },
            {
                "reviewId": "W2Dr66wbohBGkJ2cObk4ow",
                "author": "Katrina L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Super affordable casual dining in Chinatown.\nThis place is great for the price and portion, but the food isn't anything spectacular.\nThey have simple bentos, rice plates, noodle dishes, and sushi.\nCASH ONLY.",
                "datePublished": "2016-07-05"
            },
            {
                "reviewId": "aYB3fkoIPmIiZkpTSCLbVw",
                "author": "Aby E.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "So, I've heard a lot from several sources about Misato, but hadn't had a chance to try it until yesterday. That's mostly because whenever I'm around in Chinatown I don't usually have a Japanese meal in mind (even though I love it). But yesterday I was out with some budget-conscious, sushi-loving friends and we decided to give it a try. \nIt was past 9pm so there was no queue. The local itself is small and rather plain, doesn't look pretty or anything. But it's not the wrapping, but the gift itself, so... The staff were very polite and took our orders quickly. The food came in giant plates. I had Tendon (tempura veggies and prawns over a bed of rice and a side salad) and was quite good. The bento box the girl next to me had was the biggest I've seen in London.\nI wouldn't classify this as gourmet food, but it wasn't bad at all, either. Very good price/quality ratio, specially considering it's Japanese food, which tends to be on the pricier end of the spectrum. We spent about £10 each and were really satisfied!\nI'll probably come back some time again :)\nP.S. It's cash only, so remember to bring some before going in (there's an HSBC nearby on Gerrard St).",
                "datePublished": "2016-04-03"
            },
            {
                "reviewId": "2tsZaXGUOaPjo_AxcCB8Iw",
                "author": "Stacey B.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This is not a sushi restaurant. They have sushi but the Yelp reviews/search results were misleading. Very easy to get in and out, very attentive service, but the food was only average and the sushi options were so limited we wound up getting other food. The salmon teriyaki was edible but not something worth paying for - but to be fair, it was cheap. Fine for locals wanting cheap quick mediocre eats but not worth the trip for tourists.",
                "datePublished": "2017-03-19"
            }
        ]
    },
    "40": {
        "id": "P3k-TuoP7q5j88hoykbKag",
        "name": "Misato",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Leicester Square",
            "streetAddress": "11 Wardour Street\nLondon W1D 6PG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/VTzxvNruI1mJJI6hxdOyDQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7734 0808",
        "review": [
            {
                "reviewId": "1WJMfxm8kAkx4PkXLWusfg",
                "author": "Clèm B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "A good and cheap Japanese restaurant in London! I ordered the vegetables tempura with steamed and it was as good as the one I ate in Japan!",
                "datePublished": "2016-04-22"
            },
            {
                "reviewId": "Dx7W2u_DqSD2LCwOuogy9A",
                "author": "Yuen P L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The stand-alone feature of Misato is that it offers mighty portions of Japanese food at budget prices despite its location in the centre of London. It's also nice that it provides salad with all its meals. The set-up is very basic with simple furniture and amateur-like employees. The china or bento box is also plain white and the cutlery or chopsticks without any design and actually reminds me of aeroplane quality. Everything is fine but lacking personality and a touch of class.",
                "datePublished": "2015-04-23"
            },
            {
                "reviewId": "j--mEcZWpgRmbZyjXmeKnQ",
                "author": "Tina M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "IMO, this place is overrated. It is okay and very much akin to many of the mid-range Japanese places where I live. I've had much much better versions of the few dishes I had here (I had the katsu, pork ginger, popcorn chicken (though it was not called this--I forgot what the actual name was)). I am willing to give this place another try, however, as the sushi looks very good. If you are from the SoCal area, I'd just pass on this place, if I were you. If you are a local, this restaurant might good to go to if you happen to be in the area.",
                "datePublished": "2016-12-12"
            },
            {
                "reviewId": "1uPdZXHpGQUgvh3olgwlOA",
                "author": "Irene L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Are you a student? Are you broke? Are you always hungry? Do you always complain about portion sizes and prices?\nCOME HERE FOR A £4.50 CHICKEN DINNER!!!\nI love this place so much like this place fulfills all of my needs. I can get CHEAP and YUMMY JAPANESE FOOD and BE FULL and NOT BROKE!!! That is pretty much all you need to know. \nBut if you want to know more, they have quite an extensive menu and everything is considerably cheaper than other establishments considering how expensive London is! Like, this place is cheaper than McDonald's, LOL. I have a relatively big appetite and I'll admit, even though I finish all of my food here, I could still definitely eat more. But the important thing is that I won't be hungry here, I don't get bloated but I am full! At a great cost! The place is quite \"hidden\" but it's worth the search! It's along the right side of entering Chinatown from Shaftesbury. Food comes out super quick and even though there's a mandatory 10% service charge, it's still well worth it. I have had their Zaru Soba, Tori Karaage Rice, Tori Teriyaki Rice, and Tonkatsu Curry Rice! Curry Katsu is more expensive, it's like £6.50 but it's still way cheaper than elsewhere. Also, all of the rice comes with a side salad which is AWESOME and wow...their cherry tomatoes? Only one, but so refreshing and awesome from all of the heavy comfort food. Nice touch. \nOkay, so you definitely can't beat value. Taste wise, it is also super good. Their wasabi is really weak though, which surprised me. But, that's pretty minor. I probably wouldn't recommend ordering the Zaru Soba (£5.00) since it isn't really filling but it's a solid tasting dish (dipping sauce could be better). Tori Teriyaki Rice was REALLY good though, their chicken is crisp on the outside and super moist and juicy on the inside. They cook their chicken really well! The teriyaki sauce was also fantastic, just enough sauce and subtly sweet. Same goes for the Tori Karaage, which was battered perfectly! Outside had a nice crunch and was crisp while the inside still remained juicy and succulent. The rice is also amazing too, like it's nice and sticky and short grained!!! Great texture and taste, it is seriously some good rice. Tonkatsu Curry was  pretty good, but the meat itself was lean at parts. But when you eat the fatty parts...YUM. It was nicely battered and crisp with your standard curry, which was pretty good. I wish they gave you more curry though, since portions are massive LOL. Food tastes essentially like japanese comfort food, and everything is really well cooked! You really can't beat the price and the quality of the food.\nPortions are bigger than a human head and you will definitely be full and happy here! They don't skimp on ingredients and the food is really well cooked, despite how constantly busy this place is! There's always lines at your standard dinner/lunch time so if you're not looking to wait, try to come a little later or earlier than the typical meal time. However, the wait wouldn't be really long and they're super efficient and quick. Their take out is also fantastic, great packaging (they use plastic tupperwares and it pleases me greatly) and portions still!!! Anytime I'm in London and hungry, this is the place I ALWAYS go to. I brought my friend from Nagoya to eat here and she loved it and I quote, \"it tastes like I'm eating real Japanese food back in Japan!\". So, I guess this place is pretty authentic too, LOL. \nAlso, MAKE SURE YOU BRING CASH! This place is cash only!\nI LOVE THIS PLACE!!!!!!!!!",
                "datePublished": "2015-12-25"
            },
            {
                "reviewId": "igQMg-ALh5Gni4hkxX7WGg",
                "author": "Samuel A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Fresh succulent sashimi, sushi at reasonable prices. Soba just average. Recommend for different  Asian cuisine within Chinatown.",
                "datePublished": "2016-04-28"
            },
            {
                "reviewId": "GnAdiNDe5I9swYLDnQQ24Q",
                "author": "Alice Ř.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I was about to give Misato only three starts but because it is so hard to find a decent food for 'normal' price in London, I decided to go higher.\nAs the reviews have already mentioned, this is nothing special, the sushi is fresh though and probably the best thing on the menu. Curry is okay and I would not order any of the soups again. Although I have to say they don't taste like full of sugar or salt as usually in other restaurants that are considered to have better seasoning in their food. \nTheir drinks are quite fun, you can get some stuff that is a bit different than anywhere else and are cheap as well.\nSo if you are in the area, quite hungry but angry at the society for pricing other ramens around 10 quid a portion, this is a great place to go to.",
                "datePublished": "2016-05-01"
            },
            {
                "reviewId": "uipXeNzL2KB-L81079SWDA",
                "author": "Jonathan A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A  good place to eat sushi while abroad. Like most hole in the wall places back in the states, cash only but an ATM is right around the corner ( HSBC bank). Service is quick and very friendly. Don't be surprised if there's a line out the door as it's a popular spot.",
                "datePublished": "2017-01-10"
            },
            {
                "reviewId": "GHdYjhUNNFcZX_VeMhTjyA",
                "author": "Stephanie H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place is delicious, cheap, and has humongous portion sizes for London.\nIt does not seem like much from the outside, but inside you are guaranteed a yummy meal (or two if you have leftovers) for £6! If you are at the M&M emporium, it's across the street, quite small and could be hard to miss. \nI've only ordered the Chicken Katsu Curry because it's such a great deal. I would highly suggest going to Misato for lunch, as you'll surely be filled till the next day. My friend ordered their soba noodles which looked fine as well, just not as much food if you're looking for quantity.\nMy only slight complaint is they add a strange gratuity or tax? I wasn't sure, and no one at the cashier explained it well so I just paid. Overall, this place is so inexpensive it really doesn't matter much. The service wasn't the most attentive, so you may have to call someone over to your table a few times. \nThis place is quite popular but small, even when my group went for a meal at 4pm.",
                "datePublished": "2015-01-30"
            },
            {
                "reviewId": "j704qUXwFnc71791SHcFJA",
                "author": "Kieu T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "love this place! decent affordable prices for big tasty portions. their chicken katsu is good! meat is tender and tempura isn't super oily. one of the cheaper alternatives in Chinatown London. highly recommend",
                "datePublished": "2017-05-31"
            },
            {
                "reviewId": "vzYSoYOtPrrDHgLwR4b3Ow",
                "author": "Tally D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Once upon a time there was a student studying for hours in Senate House Library. It became very late and she became very hungry, suddenly craving Japanese food for dinner. Using her trusty Yelp app she found a place called \"Misato\" that was not very far so she walked to Chinatown to go eat there. And the rest is history. \nSeriously tasty food and shockingly inexpensive! The katsu curry is absolutely perfect in portion and flavour, very authentic (even the little salad that comes with it!). I could literally rave about the breading on the pork cutlet for days. I was so hungry when I got here but I left extremely full and satisfied. \nI also ordered cucumber maki sushi as a side and that was also wonderful. 6 pieces for only £2.50! I would come back here just for the sushi alone.\nCame here after the dinner rush so there was no queue and got a seat immediately. Despite the dinner rush being over all the tables were full so it took a little bit of time for the food to finally arrive. Also, I'm pretty sure I saw a sign that said cash only so bare that in mind! \nThis is now my \"go-to\" place in London for Japanese food. Especially considering the hit or miss of the surrounding places in Chinatown, you can't beat the prices or the quality of Misato.",
                "datePublished": "2014-05-12"
            },
            {
                "reviewId": "3FTSu64UNf5oXIWemyK_jQ",
                "author": "Leanne T.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Long queue and rude staff. Although, the food is cheap and it still tastes decent.",
                "datePublished": "2015-08-15"
            },
            {
                "reviewId": "PE3Yr_nC3PHPgyQF1gbdFw",
                "author": "Louisa F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I walked into Misato after seeing the good reviews on Yelp and i wasn't disappointed. \nFirst of all, i know some people noted the place didn't look like a million dollar or went simple with decorations etc  but come on, that's the point. If you want to lower the prices, that's first thing you cut. And i'd rather they don't do cuts on the quality of the food.\nWe came quite early in the evening so we didn't queue. The staff was nice and efficient. We were served fast which happened to be extremely convenient for we were starving. \nWe ordered sushi makis, sashimi and a Tori Soba for me (soup noodles dish with fried chicken).\nI was surprised the makis were as good as the ones i'm used to at my favourite Japanese place at home. The sashimi were a generous portion of thick cut salmon. All these dishes were really cheap (6 makis starts at £2).\nThe Tori Soba wasn't exceptional but the chicken was reaaaally well cooked. I regretted not taking the curry udon. \nAll in all i was satisfied and i'd happily return to try out more things. \nNote that it's not your full-on traditional japanese food restaurant.",
                "datePublished": "2015-10-22"
            },
            {
                "reviewId": "bne1X2LXg7xzk_kE3F-HWw",
                "author": "Hannah C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place is so worth your money. It was the perfect place to go for drunchies and, as everyone else said, you get a LOT of rice. I got the chicken curry Katsu and it was so good. The curry sauce was amazing and the breaded meat was delicious. My friend ordered tonkotsu and we poured the tonkotsu sauce over the rice. Try it! I just love the sauce on its own. For 5 people our meal was £29.15 including the service charge!! So worth it",
                "datePublished": "2014-10-07"
            },
            {
                "reviewId": "tZtL8KC2MFMeT8oNlr5hcA",
                "author": "Craig D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Stopped in here for an impromptu dinner, and so glad we did! This is what Yelp is all about: finding a hidden gem that you would never hear of otherwise, and supporting a local business too. \nThis place can best be described as \"cheap and cheerful\", like a Japanese greasy spoon. Generally a young student-age crowd due to the incredibly low prices. It was £3.50 for six piece salmon and avocado rolls, which actually tasted super fresh and were generously portioned. The huuuuge pork Katsu curry plate came with large spoonfuls of Japanese rice, a big portion of meat and a small dressed salad, all for £5.50. \nService is quick and impersonal, but tap water refills come free and often. Expect a wait at dinner time of around 10-15 minutes, which you'll spend lined up in the narrow entrance hallway. But it's well worth it for a filling, tasty, and cheap Japanese meal. Looking forward to trying the udon next time!",
                "datePublished": "2015-11-23"
            },
            {
                "reviewId": "gLoVW2yopw-Wu2g3cn14Yg",
                "author": "Patty J.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Stopped by because I was in the area and had not much cash on me. I'd been meaning to check this place out, but never really was motivated enough to walk all the way over there. \nThe place is kind of hard to spot, as it's a small door squished between some larger establishments. It is in the \"heart\" of Chinatown, but like aaaall the way down the street. The interior is pretty humble and simple. At around 7:45 on a Wednesday night, it was still quite packed and I waited for about 15 minutes before being seated. I ordered the curry pork katsu-don as soon as I sat down, because that's what I was craving, so didn't even look at the menu. (The server was like \"... LOL ok????\")\nIt took some time but wow, the portions are indeed very large. I usually eat a TON for someone my size and rarely find things filling enough that I can't find room for dessert, but that's exactly what happened! It was so good that I wiped my place clean. \nThe pork cutlet itself was not as thin as I expected, but it wasn't the most tender, either. Granted, you do get quite more than what you pay for. A small downside is that the curry seemed a little cold... maybe because it was mixing with the salad? Everything was running together, but that was understandable.\nOverall, good place to drop by if you're on a budget! Heads up that it is cash only.",
                "datePublished": "2015-12-06"
            },
            {
                "reviewId": "Ug5QFqJBFjxAFpBt9Aee9Q",
                "author": "Maro T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "insider tip from a good friend of mine.\npeople are queuing outside no matter what time - speaks for itself (;\ngreat prices, awesome food.\nprobably the best chinese restaurant in China Town.\nwe definitely come back!\n*cash only",
                "datePublished": "2016-09-03"
            },
            {
                "reviewId": "rlL_0d4ZDVR521wJmnErcw",
                "author": "Allen J.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The line (queue) builds up as the evening settles in. Price is very good, only paid £15 for two people.\nGot the sushi bento and a ramen bowl. Not mind blowing awesome, but not bad either.\nNot sure why, but I had a little trouble finding this place. It's more on the edge of Chinatown, rather than right in the middle of it.\nThey don't allow drinks from outside, though that's a typical rule. My friend brought in some boba and the waitress was like, \"Say what?!\" But in an asian way.",
                "datePublished": "2015-11-02"
            },
            {
                "reviewId": "3dtPBIlPWO2Zu-W8vsA1WA",
                "author": "Laura C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Slapdash and fancy-free is my first reaction to this popular and busy Japanese cafe in the heart of Chinatown. Like many it seems, we were seduced by the numerous positive reviews.\nWhile there's certainly speedy service and the food portions generous, it's nothing extraordinary. We each had a teriyaki rice dish with chicken and salmon respectively. Perfectly edible if bland. \nThe accompanying salad leaves drizzled with mayonnaise were an odd choice; some Asian greens in garlic sauce would have been just the ticket. \nStill, for a bill that came to less than £20 for two meals and a beer, you can't complain. Just don't expect to linger - queues of hungry customers are waiting, and you'll be told to leave.",
                "datePublished": "2015-08-17"
            },
            {
                "reviewId": "HhJ6Ab5s_ZvuNhaQxHVAMw",
                "author": "Bianca W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Was out one night with a friend and looking for a place to eat that wasn't too outrageously expensive. A quick search on Yelp recommended this place, so off we went. \nIt was a bit hard to find as they have no name sign or anything outside, we walked past it a couple times before going by house number. But once we found it, it was amazing!\nThe food selection was good and the prices are more than reasonable for central London. The portions were huge, the staff was nice and the atmosphere was pretty okay for a cheap place to eat. Will definitely go back.",
                "datePublished": "2014-03-05"
            },
            {
                "reviewId": "wUhJ3-qlL83YURlu6WRIFw",
                "author": "Schelly Y.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "We waited about 15-20 minutes for a table at 6pm on a Saturday night. The line just got longer and longer as the night went on. I had high hopes for this place but was sorely disappointed.\nWe three dishes and two of the dishes included extremely cold food. The Karaage Chicken was unbelievably cold. It was as if they made it hours ago and then let it just sit there collecting dust waiting for a customer that ordered it. The batter was soggy and it was just disgusting! The Sashimi Bento came with a couple of fried shrimp dumplings that were also cold and soggy.\nThis place is pretty cheap but.you get what you pay for! When the waitress took our food away she asked if we wanted to pack the chicken and I almost told her no your chicken is disgusting!\nKatsu CurryKaraage ChickenSashimi Bento",
                "datePublished": "2012-07-08"
            }
        ]
    },
    "60": {
        "id": "P3k-TuoP7q5j88hoykbKag",
        "name": "Misato",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Leicester Square",
            "streetAddress": "11 Wardour Street\nLondon W1D 6PG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/VTzxvNruI1mJJI6hxdOyDQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7734 0808",
        "review": [
            {
                "reviewId": "Gnx-403vbIOLMEFvO9jM5A",
                "author": "Polly H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "For only £6, the chicken katsu curry really hit the spot. It was a cold rainy day and a plate (the size of my face!) of warm curry was perfection. They gave a very generous portion which I feel could easily be split into two meals. But I ate the entire plate in one sitting because I simply could not stop eating - it was that good! The chicken katsu was perfectly crunchy and there was a lot of it too. The side salad was good. The rice was good. \nDamn, everything was great. I will definitely be visiting again!",
                "datePublished": "2013-10-01"
            },
            {
                "reviewId": "lgy4cJzEq0-jHW1-N4TVCQ",
                "author": "Joannie T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Excellent Japanese food and absolutely affordable. Cherry on the cake, staff was friendly and smiling. I would totally recommend.",
                "datePublished": "2017-04-23"
            },
            {
                "reviewId": "O7OhddkmfF3qrXMK-OWNbg",
                "author": "Jing Shyang Y.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I was with a friend attempting to try Shake Shack. Put off by the horrendous airport check-in queue, we decided to head to Chinatown at her request to try a small Japanese place she'd heard good things about.\nThus we found ourselves at Misato, a tiny Japanese cafe looking place with nary any indication it was a shop, apart from the A4 piece of paper in the window showing the name of the place. This in no way hinted how amazing the food would be once inside.\nThere was a small queue when we arrived, around 8-10 people and seeing the size of the place, we expected to have to wait ages. Luckily!, as we arrived, a table opened up for 2 people and we were shooed right in. So get this, if you want a table quickly, go in small groups of 2. Otherwise like the unfortunate people with 3 or more in their party, there is a long wait due to the limited number of group tables. As we ate during that 45 mins, the queue only got LONGER.\nThe food itself is brilliant on two levels. First, the value for money is astounding. The Unagi Nigiri (That's the Sushi wraped in Eel) which is normally a little pricy in other places was £2 for 2 pieces of reasonable size. 6 pieces of sushi ranges from £3-6 from California rolls to salmon. My jaw dropped. Not to mention the main dishes were served in giant portions for £4-9. Katsu curry, Bento boxes...I cannot fault the value here.\nSo a place that does cheap sushi probably tastes cheap too right? Wrong. I've eaten in quite a few sushi places of varying quality and I can honestly say this place serves the most tasty sushi in the whole of london. It wasn't bland, dry, nor too cold, plus had the right amount of vinegar in the rice, good amounts of filling and the Unagi Nigiri was so succulent...and the california rolls to die for. I just don't know how they do it. \nMy main arrived, the Chicken Teriyaki and again, lettuce smothered in delicious mayonaise (I think Kewpie) a mass of real breaded chicken, big rice portion and again, delcious Teriyaki sauce. I'm just salivating thinking about this meal.\nFor sure I'll be back, and will be in a group smaller that too. I mean the important thing is that I get in. And once in, I shall feast like a king on a budget.\nSeriously, if you're in Chinatown and in a small group. At the risk of making this place even more popular that it already is, consider Japanese. Consider Misato. Just look out for the A4 piece of paper in the Window and no actual name where you'd expect a shop name to be :)",
                "datePublished": "2013-07-13"
            },
            {
                "reviewId": "0YickH4dGb23LcCKbCcznQ",
                "author": "Beverly Y.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "If you're looking for a budget-friendly place that serves huge portions, definitely come here. If, however, you're looking for more authentic Japanese food, don't. This place definitely caters to the former.\nA couple friends and I came here on a Friday night and the place was packed. Thankfully we only had to wait about 5-10 minutes before being seated. They also hand you the menus to look over in line, so we ordered pretty much right after we got seated. I wanted something light so I ordered the Tofu Steak (grilled tofu & sauce, w/ salad) and asked for the salad dressing on the side. When the dish came out I was already a bit disappointed. Not to be picky, but they didn't remember to put the dressing on the side. Ok, fine. Whatever. Maybe the dressing will actually taste good? Unfortunately not the case, as it tasted super watery. The dish also came with a mysterious brown sauce (which I assume was for the tofu). Curious, I dipped my chopsticks in and gave it a taste. It literally tasted like diluted soy sauce. Not a fan. By this point I had pretty much given up, so I was actually pleasantly surprised when I tasted the grilled tofu since it was decent, although - again, this seems like a trend but - watery. Nothing special to say about the salad either - I mean, what can you really say about lettuce and a tomato?\nOverall I was not impressed. The service was fast and I appreciated that they constantly made sure our water glasses were filled, but honestly the food was so subpar I can't even justify the incredibly low prices (mine was 4 pounds). I wanted to love it, because it would've meant good food for low prices - which is definitely a struggle in London - but I just couldn't. I will not be returning.",
                "datePublished": "2015-08-07"
            },
            {
                "reviewId": "ejeEHl4HFgU916MPcOm-7g",
                "author": "Raquel R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Oh, I can't believe I have not done a review of Misato yet. Let's start! \nThis is how I imagine my grandma would cook if I was Japanese. Massive portions, fresh and tasty food enjoyed equally by Asians and Europeans. There is always a long queue in the street, that says it all. Although you do not usually have to wait more than 15/20 minutes.\nDo not expect the nicest place ever, though, this is not about style, this is about real food and the restaurant could have easily gotten a new look one decade ago. The toilets are clean, but damn, I guess you better wait a bit and use the loo somewhere else where you do not get oil de parfum just by going downstairs.\nThe main dishes are great, but I would recommend you a bento box with a bit of sushi and a bit of rice with meat or fish, they are just delicious (and the best option if you can't decide!).",
                "datePublished": "2013-06-03"
            },
            {
                "reviewId": "fVl5HJTa0wgdepN602BCIw",
                "author": "Emma O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "You have to try this place if you're in Leicester Sq for any reason. We actually spotted this place on Yelp so popped in. The menu is so, so cheap - we definitely over-ordered assuming this meant the portions would be small but oh how wrong we were. The bento boxes were huge and so, so tasty - I went for the pork ginger and the box was quite honestly the size of a laptop. It was so yummy and the beer was only £3 too!! A special mention to the waiter who had baked his own brownies that day and gave us each one for free! Only downside is it is quite packed in there and the food came out quite staggered - but it's a minor gripe.",
                "datePublished": "2016-02-29"
            },
            {
                "reviewId": "pe-pA89ohpN941M2hmPk0g",
                "author": "Pete M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Got 5 stars because of the food taste and value for the money. I got the curry udon katsu and my son got the sautéed ginger pork (can't remember the name). It was great. Very small and obviously popular. We hit it when there was no line but later saw a line that extended into the street. Would eat there again!",
                "datePublished": "2016-06-16"
            },
            {
                "reviewId": "7lF4zjLdDOYwmgS7QvNkfg",
                "author": "Roy G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "No frills, no pretensions, cheap quick and filling. The food isn't remarkable or memorable but you get a fair meal for a fair price in an area of London not known for bargains. If you arrive early, the line for a seat isn't too bad and you can order while you wait for a table. Tip: if you order sashimi ask them for thin fish slices, seems the chef was in a hurry and sliced the sashimi top thick.",
                "datePublished": "2016-01-28"
            },
            {
                "reviewId": "SwI8K5VibMj8ugSGYcbWyA",
                "author": "Noir X.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great location, delicious food, fair price. Can't ask for more from the experience. Would definitely revisit.",
                "datePublished": "2015-07-14"
            },
            {
                "reviewId": "UQ2NGU-VPr6cj2U5AsdOtA",
                "author": "Tiffany K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The girls who work here are so hard working. It's a small restaurant but my goodness their food is amazing. I got the pork Katsu curry udon. It was amazing! And we got the egg pancake like appetizer. That was good too. My husband and I were so cold from the weather and wanted something warm to eat. Perfect place and price was not bad. Definitely come here for good food. Line was constantly out the door.",
                "datePublished": "2015-05-23"
            },
            {
                "reviewId": "S_uq-2R8sUoZNmQAGS6ZrQ",
                "author": "Georgia N.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "So I am a huge fan of Japanese food, I am also a huge fan of bargains. This place is a real find and I will definitely go again. It's not the best tasting japanese food i've ever had, but it's delicious and the portion sizes are fantastic. \nThe waiting staff are so friendly and very happy to help, the food was out quickly, which was brilliant because the lovely smells can induce real hunger pangs whilst you wait. The fish was very fresh and was set out simply and very humbly. The food was delivered as food, not a masterpiece on a plate, but if you don't mind that (as I don't) it's barely a problem.\nFor value and a reasonably tasty bite to eat, I'd recommend this place.",
                "datePublished": "2015-06-09"
            },
            {
                "reviewId": "evt5e6BVXIB9Er2QcaCWkA",
                "author": "Brian N.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Portions are a great size, in fact it could be argued that a standard rice dish is too large for all but those with the biggest appetites. \nWe had the chicken teriyaki rice dish along with an order of the Sake Maki roll. Between the two of us, it was a fine meal. \nI did not care especially for the quality of the chicken in our dish (very fatty, etc.) and the sushi was acceptable yet plain. \nOur experience was really hampered by the service. We waited about 25 minutes for our order to be taken although food did come out quickly after that. Once we finished our meal I was still a bit hungry and wanted a second roll as well as a beer. The language barrier was so thick between the staff and myself I ended up receiving no roll and all and a second person coming around to inquire about the beer since the first person forgot to ask which I wanted. On top of all of this, my communication with the staff was very rudely conducted over the heads of the guests next to us since the tables are oriented against one another. \nThe in my opinion the only redeeming quality of this restaurant is the fantastic volume of food you receive for only a few pounds.",
                "datePublished": "2015-06-20"
            },
            {
                "reviewId": "rvNscPbASDqKv1Xvu3-C0g",
                "author": "Frank K.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "A little and busy restaurant. Service leaves a lot to be desired. Was asked to move for a bigger party with no thanks or kind gesture to follow. Food is good not great-does the job.",
                "datePublished": "2016-07-28"
            },
            {
                "reviewId": "__I29H72RIAM3aSdzubE_g",
                "author": "Hannah E.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Delicious food (had the salmon teriyaki bento box) and friendly and pleasant staff. Lovely wee spot for something yummy to keep you going.",
                "datePublished": "2016-06-05"
            },
            {
                "reviewId": "cayYjNqDe4IH1Uh1atrAEw",
                "author": "Joshua L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The sushi looks and tastes wonderful, while the latest is fresh and comes with a great heaping mound of rice to take up all that wonderful curry flavour.\nThe prices are more than fair for the venue and the food. Service is quick and snappy and knows how to run a restaurant. While I was hoping for more variety in their house salad, the lettuce is wonderfully crisp and the mayonnaise and curry sauce pair well together.\nA more proper rating would be 4.5, with a deduction for the salad plainness, I will round up for the price.",
                "datePublished": "2015-08-31"
            },
            {
                "reviewId": "Bh0QBEZSoQU5FTuct_luIw",
                "author": "Maurizio A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is the classical place in the classical place you see from outside and say \"oh, I'm never going to eat in such a place\". It seems a japanese restaurant run by chinese people in the middle of ChinaTown. But because of the great reviews on yelp (especially coming from Hannah, Jing and Katie) I still wanted to give it a shot, and I'm glad I did it!\nCome here around 9.30 on a Sunday, and there was still a queue, but... how can I say.. they have the typical asian attitude combined with Londonese hurry, let's say the you won't wait a lot in queue!\nNo experimentation in the menu, mixed sushi, some bento boxes and a bunch of hot dishes like chicken and pork Katsu. Stop. Awesome, the only thing I usually hate from asian restaurants (it's a problem I saw in several of them, thai, chinese, japanese, you name it) is the size of the menus. And the lower the quality, the bigger the menu! \nWe ordered sushi, sashimi, and chicken katsu. Now, it must be said that the quality per se of the food is not excellent, but if you compare the quality of the food for the prize that's where it gets the 5 stars!\nNow, on my personal list this actually got two different grades, a 4 stars for the sushi  (good, but that's it) and an awesome 5-stars for the katsu, so.. if you want a quick and big portion of katsu don't look further, otherwise you can still consider it as an option but nothing more than that. Unfortunately the service is... a bit rushy! yes they are going to bring the menu while you are still in queue, yes they are going to to ask for ordering while still in queue, but you know, it's central london, I ckind of understand that!",
                "datePublished": "2014-07-22"
            },
            {
                "reviewId": "1YpxxPd1mzQsVKloKgyy7Q",
                "author": "Lindsey A.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Food is cheap but so is quality.. Don't understand why there is such a line for this place and raving reviews ?! I'm confused... Yes it's cheap but that's about it \nI was far from impressed... I give it two stars for being good value but food is below average. Not somewhere I will be going again. I am a foodie and this place is very basic.",
                "datePublished": "2014-08-01"
            },
            {
                "reviewId": "cdBw9a7i3SZjjM9twd2Zkg",
                "author": "Nadia S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Food was pretty good, nothing too fancy. Good place to go before the theater.  Quick service and pretty reasonable.",
                "datePublished": "2014-12-23"
            },
            {
                "reviewId": "c6e3cpGsIaXUFMijy5-IDQ",
                "author": "Travis L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "In a Nutshell: A popular Chinatown-based Japanese spot with excellent value, friendly service, and decent food.\nDon't be intimidated by the outdoor queue (there will most likely be one) as tables clear fast.  Misato is relatively worth the wait, mostly for its value in Central London- hefty portions of rice and noodle-based mains barely approach the £6 mark.  \nI had the Tempura Udon- big fatty juicy noodles in broth with fried shrimp and vegetables- and I thought it was good but not great.  My friend and I shared an eel and sea bass nigiri, which tasted fine (though I wish the eel tasted a bit fresher).  \nThe most delightful part of my meal- besides filling my then-starved belly- was trying a Japanese drink I never heard of, Calpico, which is a sweet yogurt and milk based soft drink.  I want to think I'm moderately adventurous, so I thought \"why not,\" and I'm glad I did!  If you like sweet drinks I'd recommend you try it (cost £2).\nWould I go back?  Yes..though I would try the katsu curry chicken next since many have raved about it.  \nCheck it out.\n3.5/5",
                "datePublished": "2014-07-28"
            },
            {
                "reviewId": "Co448P3Sm8l_Y-2M_pGyOA",
                "author": "Kelsey F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is without a doubt, one of my favourite places to eat in London.\nI've gone here several times, every time that I've visited London as a matter of fact- I make sure that it's a stop on my trip. And, I am never disappointed.\nJust don't bring a big group.",
                "datePublished": "2016-03-31"
            }
        ]
    },
    "80": {
        "id": "P3k-TuoP7q5j88hoykbKag",
        "name": "Misato",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Leicester Square",
            "streetAddress": "11 Wardour Street\nLondon W1D 6PG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/VTzxvNruI1mJJI6hxdOyDQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7734 0808",
        "review": [
            {
                "reviewId": "Mkq6jV9_KqcFkq8s7cewzg",
                "author": "Lorraine K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "A gem in London. I was having a horrible time in this city after visiting Paris first and this made my day much better. Quality udon soup and yummy salmon and avocado maki that is inexpensive. Highly recommend!!",
                "datePublished": "2015-12-30"
            },
            {
                "reviewId": "RcDgw--GwQDoYp5s2ZJQDg",
                "author": "Joe L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place is cheaper than Michael Jordan.  Yet food is tasty and comes in large portion.\nDefinitely go for katsu curry.\nYou will not find better calorie+taste / pound ratio around the neighborhood.\nGreat for broke travelers.",
                "datePublished": "2016-01-23"
            },
            {
                "reviewId": "NXbPrlspeRl-oqglNpVQVw",
                "author": "Subutai A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Food was delicious and prices were great. It's crowded but they do a good job herding everyone through. You feel a bit rushed but hard to complain.",
                "datePublished": "2015-10-24"
            },
            {
                "reviewId": "rGlrCTl1elEHspnmbIBJKg",
                "author": "Jonathan L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I was on a lone late Sunday wander in Soho headed for my usual haunt of Wong Kei only to find it mysteriously closed for 'refurbishment'. Being still hungry and, having originally been dead set on a giant, juicy plate of Singapore noodles, I found myself lost in a sea of unfamiliar Chinatown eateries, casinos and unorthodox revellers. It took me a few moments to collect my thoughts, but then I remembered: what about that tiny Japanese place that I had read about somewhere on the social media train? Always a queue, I had heard. But maybe at 9pm on a Sunday, there might just be a free spot for one.\nWalking down towards Leicester Square, I kept looking out for Misato as I thought I'd missed it, but stopped in time. Menus printed on A4 paper and placed inside plastic wallets in the window. A spot visible through said window! I went in and after a quick look at the menu, instantly ordered a can of Sapporo beer, some miso soup and a katsu curry.\nThe soup was warm and comforting, and the curry just giant. The portion size was reminiscent of dishes I'd cook up during my student days. Two breaded cutlets of pork slathered in Japanese curry sauce, with a dressed salad and an extremely generous heap of sticky rice. All were pleasing to this ravenous kid recharging his batteries after a hectic weekend.\nThe bill? £11.50 including tip. Some may baulk at the 'optional service charge' suggested at the foot of the bill. I've read many a review shrieking about waiters asking for tips and customers refusing through their rigorous, dogmatic obligation to take offence wherever humanly possible, but let's be honest, these are people earning tuppence trying their luck. So what? I paid it anyway and left.\nFive stars. Will be back with a friend next time.",
                "datePublished": "2014-02-24"
            },
            {
                "reviewId": "T-ZUv8E017nTvvzIL8bskw",
                "author": "Katherine T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great amount and not too pricey. Great if you are a budget backpacker same as me. Go their earlier (around 6) if you don't want to wait too long. Also check the map first because it is so easy to miss the place.",
                "datePublished": "2014-12-21"
            },
            {
                "reviewId": "kJujF6VhiQfHOMfF4TtGFQ",
                "author": "Martyn M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "If anyone knows me, they'll be able to tell you that Japanese food is my favourite cuisine of all time. I genuinely spend like 30/40% of my time at Yo Sushi. I wish that was an exaggeration. \nI decided when I was in London I'd grab a quick dinner before seeing Book of Mormon, and with this restaurant being just around the corner, and with takeaway being an option, I decided to go for some chicken teriyaki. \nThe restaurant inside isn't very big, but it was relatively full. The menu offers little but I've often found that menus who offer little do what they do best. Unfortunately this wasn't the case here. I didn't wait very long for my food, and when I got it I went and sat in Leicester square to people watch as I ate. The chicken was cooked, but that's probably the best thing I can say about it. It was alright, but I probably wouldn't go back. The teriyaki sauce wasn't very sweet, but the rice was nice and fluffy, so I suppose there's positives and negatives. \nAlright if you're in a rush, but I wouldn't return for a sit down meal. Also it should be noted that they don't accept card!",
                "datePublished": "2013-09-26"
            },
            {
                "reviewId": "jJprEdvDFJxO3rz0dfaGgw",
                "author": "Melody M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "It is very cheap with such a large quantity of food. We ordered Katsu curry, and it was huge.",
                "datePublished": "2015-11-12"
            },
            {
                "reviewId": "McaRMFbwgwxgWujPVx883Q",
                "author": "Stephanie D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "As a Vancouver sushi snob I can't recommend the sushi dishes, but the rest of the food was fine, especially considering the crazy cheap prices. GIANT portions of salmon, curry and katsu! They also have cheap plum wine and other Japanese sakes and beers!\nDefinitely worth the lineup if you are looking for something casual and satisfying.",
                "datePublished": "2014-08-29"
            },
            {
                "reviewId": "lxDNmyDhFHjOBjzulQ1YuA",
                "author": "Diane H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I actually kinda like this. The udon I ordered (beef) was a good portion, and i was stuffed at the end. It was like 5.50 or 6 pounds, can't quite remember, so it was a bargin. There was actually a line to get in...and i came for lunch on saturday. So i'm guessing the other stuff is good? Though my friend said her fried pork rice plate was a bit bland. The tea they have is real nice. My udon was quite soft, just the way i like it :)\nThe sushi was okay, nothing special.",
                "datePublished": "2011-11-30"
            },
            {
                "reviewId": "IFWo8vQEaNX9eqsW33NIDQ",
                "author": "Alan S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Finding this place is exactly why I use Yelp. Having moved offices to the area, we've all been looking for new and better places to eat. A couple of us had a hankering for proper Japanese katsu curry (and not the cheap mess you get from the likes of Wasabi), so we asked Yelp. \nMost of the top reviews paid homage to Misato's katsu curry, and it did not disappoint. I took away 4 (four!) containers for £6, which made up the salad, rice, sauce, and chicken. It was great that it was separated as you could mix it as you like; the chicken wasn't soggy by the time you got back to the office so retained that amazing crunch from the coating. The sauce was a little sweeter than I expected, but I can't complain as all katsu curry is different depending on where you try; and I'd thoroughly recommend you try this one.\nI didn't sit down at the restaurant itself but it was busy, with a great atmosphere, and very friendly staff. It seemed small but bustling, in a good way, and pleasantly decorated. I did miss the entrance going past as there is nothing more than a piece of paper in the window, but once you're in, you're set for great katsu. We were most pleased!",
                "datePublished": "2013-12-13"
            },
            {
                "reviewId": "ilP9RTXcRA3QUzwAq6clBA",
                "author": "Tom M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Misato is a casual Japanese restaurant in China Town, it is a very popular venue for the Far East students in London as it is known for its very affordable price and massive portions. It is perhaps one of the cheapest Japanese restaurants in London if you excluded the likes of Itsu and Wasbi. While far from top notch, the pork katsu curry here is solid, very smooth and consistent in texture, plenty of mild sweetness and spiciness. Don't order starters or side dishes unless you are a big eater as the portions here are almost twice as much as most other restaurants nearby.",
                "datePublished": "2015-08-30"
            },
            {
                "reviewId": "HB0TGPM6shgUt_nGb8gGNw",
                "author": "Daan B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Misato is a small Japanese restaurant with cheap looking interior and relatively inexpensive food. However, the quality is good and the service friendly and fast. Definitely a good tip for a quick good quality meal before a show",
                "datePublished": "2015-10-06"
            },
            {
                "reviewId": "bsGgbnIeRX6utRSCoBm6mQ",
                "author": "Erica Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Misato offers huge portions of delicious Japanese food at great prices.  I ordered chicken katsu curry (£6), and made sure to arrive extra hungry because the portion left me full until the next day!  A heaping plate of steaming rice, crisp and juicy chicken katsu, topped with savory Japanese curry and a side of lettuce.  However, their other menu options are equally well-priced, including the sushi.  Definitely worth a visit if you are extra hungry and in the area!",
                "datePublished": "2015-03-06"
            },
            {
                "reviewId": "3fshnweszEJESoFUYdY1lA",
                "author": "Joy L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Love this place, because the prices and dishes are great! We got udon, teriyaki chicken rice, and a ***load of sashimi and nigiri, and it was about 20 each including a bottle of red wine! Wow, completely unheard of in London. Do bring cash and expect to wait a while during busy hours.",
                "datePublished": "2015-02-22"
            },
            {
                "reviewId": "hzeGOUWoHijkny4JKNDCag",
                "author": "Chloé G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great tiny restaurant near Chinatown. It is quite cheap and the staff is nice. I recommend the main courses : huge quantity for a good price ! The sushis are quite good but there is wasabi everywhere. As soon I get back there I will take a course !",
                "datePublished": "2016-08-27"
            },
            {
                "reviewId": "mFSP8-amppLOiZ80Mi1FiQ",
                "author": "Daniel L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great little family joint.  The price is fantastic and the dishes are generous.  The fried seafood app is basically a deep fried shumai.  The pork katsu curry is the dish that kept me coming back, it was fantastic.",
                "datePublished": "2015-04-29"
            },
            {
                "reviewId": "Q8Cgvf5AS3B9INN0Oa3scA",
                "author": "Daniel C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "My favourite Japonese restaurant. Sake teriyaki rice is the best dish for me. It is a grilled salmon with teriyaki sauce on a rice dish. Delicious, and with salpico, the typical refreshing juice they usually have in Japanese summer you pay like 10 pounds for a meal including service. I do not think there is a better option, although I would avoid if you get stressed with queuing and are going to be meeting people at the restaurant. I would suggest you meet somewhere else before going to the restaurant, since they do not allow you to sit down while waiting for other people. Everyone needs to be there. I do not mind, since it is a minor price to be paid given all the pros.",
                "datePublished": "2015-01-03"
            },
            {
                "reviewId": "Q6p0bmUdMqvBUs4xOhtWNg",
                "author": "Thomas H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A good cheap eat\nThe food was quite nice, but I've had better Japanese food elsewhere. Staff were friendly, if a little busy. The restaurant itself is fairly plain looking. However the price is where this place really excels - very cheap (for London).",
                "datePublished": "2015-06-24"
            },
            {
                "reviewId": "CLbyyJue6of4veAsSDd-_w",
                "author": "Sara L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place helped me through my poor times as a student, and the prices (at least until i left london) never changed, the portions shrunk a bit though...\nI usually go at 12 when they open because a 5 minutes difference could mean having to wait in a gigantic line up",
                "datePublished": "2013-01-08"
            },
            {
                "reviewId": "dGr_LOQtsqdJgR70tgR5Ow",
                "author": "Ehab A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I found this little gem through Yelp, which is why I love using it now. \nIt's a little place, easily missable on Wardour street near Chinatown. When I got there, it was fully occupied and we had to wait in a queue outside just to get in. I waited for like 10 minutes to get in. I think it's easier for groups to get in since the tables really prefer groups over singles. The decor wasn't that impressive, nor should it be. Simplicity is key to this place.\nFor only £6, I ordered the Chicken Katsu curry and it was really great. I love Japanese cuisine but I admit I've never been to Japan so I wouldn't know how the real thing tastes like. But this place offers big portions and for that I was excited. Prices are really great (compared to other Japanese restaurants I tried)\nI definitely recommend anyone to try it and I will definitely go there again!",
                "datePublished": "2014-01-05"
            }
        ]
    },
    "100": {
        "id": "P3k-TuoP7q5j88hoykbKag",
        "name": "Misato",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Leicester Square",
            "streetAddress": "11 Wardour Street\nLondon W1D 6PG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/VTzxvNruI1mJJI6hxdOyDQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7734 0808",
        "review": [
            {
                "reviewId": "zCuGUP1f9pcs09MfU01c2Q",
                "author": "Jaime E.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place is an absolute gem in an expensive city. Very good value for money with large portions. I lived in Japan for years and the curry here is better than any that I ever had. The sushi was fresh and I couldn't believe how cheap it was.",
                "datePublished": "2015-05-24"
            },
            {
                "reviewId": "3f0rehE-5IOtPuAxEj5lCg",
                "author": "Mokun S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "You will be surprised at how much food you get with the price! I don't think I have ever visited any Japanese restaurant so generous. I love this place. But always a lot of people queuing so be prepared to wait.",
                "datePublished": "2014-07-24"
            },
            {
                "reviewId": "iA5nmKWw90ABCT1DaNgeZg",
                "author": "Gemma M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Fantastic Japanese food at great prices in central London. Hidden away on the edge of China Town is this small Japanese restaurant, if your not careful you will walk past it (I know I have a few times and I know where it is). They have noodle, sushi and bento boxes on their menu, so far I have only tried their noodle dishes which are delicious and cheap. \nIf you go at a busy time you may have to wait for a table as it's such a small restaurant with only few tables inside. It is most definitely worth the wait and I'm looking forward to my next visit.",
                "datePublished": "2012-10-21"
            },
            {
                "reviewId": "zB-fzvutfWqP9io-OvdSIg",
                "author": "Vanessa H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "If you're looking for a super stylish, modern Japanese Restaurant - then this is not it. But if you're looking for extremely yummy food that's cheap and comes in big portions, then this is your place! \nCame here on a Saturday afternoon and there was a Queue outside the door already. Luckily, it was a sunny day and we only had to wait for about 15 Minutes until we were seated.\nThe restaurant is fairly small and has no decoration or anything that might entice you to take your time while having your food. However, I felt that it's part of the charm - basic wooden tables and chairs, crammed together to seat as many people as possible. \nThe waiters seem a bit stressed and rather reserved, but friendly. There's a really big selection of Katsu Curry dishes and nice Bento Boxes, as well as Sushi and Udon. I had the Salmon Teriyaki Bento and he had the Chicken Katsu Curry. My bento box was big, with a more than generous piece of juicy, perfectly cooked Salmon, a big serving of rice, salad, to makis as well as two pieces of fried pork and a seaweed salad. His chicken Katsu portion was ginormous (yes, that is totally a word) and could have fed two people. The food is really tasty and it's great value for money. Is the food worth the Queuing-outside-the-door? Yeah, I'd say it is - as long as you don't expect an amazingly unique dining experience, but really solid, tasty Japanese staple food.\nWill definitely go here again!",
                "datePublished": "2012-03-04"
            },
            {
                "reviewId": "zzHVmyiqr7kzidiDqtP9vw",
                "author": "Fazan K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Misato never lets you down, over years it has remained one of the most consistently good spots in town on value for money, better than high street sushi/ udon and lots more.\nIt has a feel of an authentic Japanese canteen and you really wouldnt know youre in the middle of Chinatown!\nExpect long queues.",
                "datePublished": "2011-10-26"
            },
            {
                "reviewId": "ib_PHPUwVovkVGKkZDBiLQ",
                "author": "Sal T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Food was great and the prices were very affordable. Portion size was well fitted! I would definitely recommend this place to anyone craving a good meal. Ambiance is not the best. But the food and price are on point",
                "datePublished": "2015-12-28"
            },
            {
                "reviewId": "gKerD0phxy81ecUBZirPYA",
                "author": "Danny L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Not really a fan of the mayo salad in combination with the katsu curry but I guess thats how the brits roll over here. Personally I am used to the ginger dressing over the salad but this is probably the cheapest meal in the area and was pretty good except for the mayo salad ewww",
                "datePublished": "2014-08-10"
            },
            {
                "reviewId": "O2reNlOQVNvYPGfD0whvSQ",
                "author": "Nicole P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "My boyfriend and I found this place on yelp while we were in London on holiday. We're big fans of Japanese cuisine, so we have very high expectations when we go to a new place. Misato fulfilled all those expectations and more. The food was absolutely delicious and it was incredibly priced for the quality. The only negative is that we don't live in London permanently, but we will most certainly be back on all our visits from now on.",
                "datePublished": "2014-01-14"
            },
            {
                "reviewId": "2EIE4rPYgS6qfCnhFygjJQ",
                "author": "Martin S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I am not really a fan of Japanese cuisine but a friend persuaded me to eat here and I was pleasantly surprised. It was very busy and we had to wait for a table. I liked my meal and the service was fair given the busy period. Portions were quite small. I would eat here again if looking for Japanese food but  would not go out of my way.",
                "datePublished": "2014-08-09"
            },
            {
                "reviewId": "OW0YCbIpF6t6DSO5qILsLw",
                "author": "Norman S.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "I cannot believe that people are giving this restaurant good reviews. To paraphrase Vizzini, I find the assessments \"inconceivable\"!\nIt was easy to spot the restaurant. A long line. Does long line = good? That was our mission. Luckily, while waiting in line, we got a good look at the food. I pressed my face against the glass, steaming it up, and stared down the food as it passed into unsuspecting customers.\nThe tuna had an off-color. Not good. The soba arrived wilted and sad. It wasn't even on a bamboo plate. Not good. OK, I thought, can you really \"see\" unpalatable-ness? Maybe it will taste good.\nAs we progressed in our line, we got a good view of the cashier's area. In the area was where they apparently prepared drinks. I saw filthy water cups washed by simply wiping them with rags. The large novelty sake bottles were re-filled from sake-in-a-box. They also prepared some other concoction by mixing instant powder.\nI suppose this might be part and parcel of any restaurant operation, but it was disconcerting seeing them do it so nonchalantly in front of customers.\nThe food. I ordered sashimi. The salmon wasn't bad but the tuna was. It felt like someone had defrosted it. My friend ordered tonkatsu rice...\nNow imagine, if you will, that there exists a planet beyond our solar system made entirely of eggs. Suppose the inhabitants crafted a ship and landed it on your tonkatsu. That's what happened. A huge UFO of an egg was plopped onto the tonkatsu. Really? \nThe breading on the tonkatsu was far too thick. The worst part is I could TASTE fish oil in the breading. In other words, they probably have a huge vat of oil and just throw everything in it. Yuck.\nYes, it was cheap. But would you pay even a cent for crap?",
                "datePublished": "2011-07-20"
            },
            {
                "reviewId": "iCXyQMREolPRrwGwMeYiUw",
                "author": "Katie B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Cash only. Not unexpeceted at a place like this, but still annoying.\nAs other have said, massive portions of Chicken Katsu Curry (with rice and salad) for a really small price (under £7). Wish it came with those little red pickles, however. Really solid Japanese homestyle comfort food and great for winter time if you've never tried it. \nBig food, big flavours, small pricetag. Go late (like after 9) and there is no queue.",
                "datePublished": "2011-11-14"
            },
            {
                "reviewId": "9tcL58AkAudpVteR_UMxUg",
                "author": "Esther G.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "It wasnt what I expected. Food didnt look nice, chicken didnt taste as chicken, I would not recommend this place at all.",
                "datePublished": "2014-11-17"
            },
            {
                "reviewId": "5IqoEss1Obp6EFgLNGjAbw",
                "author": "Raid R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place is great. The amount of food that they give you like other people have said is quite large. For less than £10 you could very easily feed yourself quite comfortably. The food itself is very good and I eat the Tempura Udon most times I go and it tastes great. Drinks aren't the cheapest things in the world but it's a small price to pay for such a good restaurant. The atmosphere is what you'd expect, mostly Japanese people however you will find the occasional tourist. You might have to wait for some time before being seated but even at lunch I haven't waited for any longer than 15 minutes. There aren't many tables but they do clear quickly. In my opinion this is one of my favourite places to eat in London.",
                "datePublished": "2014-12-01"
            },
            {
                "reviewId": "yj851uYr-qKaxUzLiYZXJw",
                "author": "Kirsty C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I love this restaurant. I really, really love it.\nWhy the 4 stars rather than 5 then? Well, this simply comes down to the lack of air conditioning (at least the last two times I visited). It is very warm in London right now and it was very warm in Misato yesterday. Almost too warm to eat, except...\nWell, except that the food and service in Misato is always excellent. So are the prices. As some other reviewers have said, the restaurant is not a sandblasted, ultra modern place. It looks more like a slightly student-like place in terms of its appearance. But the food is outstanding, the portions are large, they come quickly and the price is great. \nThe food is also very nicely presented in traditional Bento style. I had the curried pork steak yesterday, with rice and salad. It was so tasty I almost miaoed. Yes, it was that good. On the other hand, it was probably not the wisest thing to eat on such a warm day when there was a lack of air conditioning.\nAnyway, the food (the curries and noodles especially) and the service are excellent. I highly recommend visiting Misato when you're next in Soho China Town. \nReally delicious!",
                "datePublished": "2011-04-20"
            },
            {
                "reviewId": "bNLLXhPMqwsBxrrm7u2TLw",
                "author": "Jennifer F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Went there with a friend and luckily did not have to wait in any queues....enjoyed the katsu chicken curry with rice. It was awesome and a massive portion for only £6. They also have lovely plum wine",
                "datePublished": "2014-09-09"
            },
            {
                "reviewId": "HR8yWBXBVbmLGgsxrcXNqg",
                "author": "Jaclyn L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Who doesn't love a huge helping of katsu curry (breaded pork) and rice with veg for under £7?! There is no such thing as too much of a good thing.\nAny foodie who appreciates good value for money and a love for Japanese curry should experience Misato. My advice would be to arrive early, i.e. 12pm for lunch and 6pm for dinner - trust me, there is usually a queue to get into this joint.  Also they are cash only and we all know how rammed atm machines can get around Chinatown, be prepared and bring your pennies.\nMisato will not disappoint. If it does, then I would question your taste palette!",
                "datePublished": "2011-06-02"
            },
            {
                "reviewId": "0f3mMTFSIPpvLNN6djMCMA",
                "author": "H V.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Came here for lunch as it seemed to have good reviews. That was a mistake. The portions are huge and the price is cheap. However, that is it. The soba was tasteless and the soup tasted like something out of a packet. The katsu was borderline. The rice was not japanese rice and a bit bland. Come for the prices and portions, not for the quality.",
                "datePublished": "2015-07-13"
            },
            {
                "reviewId": "WYgKLlu1NomNKnxG-x5h0w",
                "author": "Fotios T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ah, Misato. What can I say that hasn't already been said? It's a pokey little Japanese place that serves fantastically unpretentious food in gargantuan portions.  For those times when you just want a decent meal and couldn't care less about the trappings of fine dining, this is your destination.  It's a shame there's no option for brown rice, but ho hum! \nI really recommend the Katsudon, a massive slab of pork katsu topped with a frankly terrifying amount of wobbly egg... stuff, sitting on a bed of rice, served (slightly hilariously) with salad. It looks weird, but ZOMG the taste, and you really can't argue with the price. Come hungry! Oh, and come early! The queues really do extend out the door during busy periods.",
                "datePublished": "2010-11-03"
            },
            {
                "reviewId": "4ZfdqKv9qrcz0bkH977eTg",
                "author": "Eric B.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I've been waiting for twenty minutes and I haven't seen the menu yet. I understand it can be busy but this is just unsat. Maybe this is just an exceptional circumstance but it's no extraordinary day to be like this.",
                "datePublished": "2015-08-10"
            },
            {
                "reviewId": "n9TRkTVNd88EdW-WJ_7WZw",
                "author": "Melizza R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "If you can ignore the grubby stained walls, grim floors and cramped space then you won't regret it. When I walked in I was initially taken aback a bit but I trusted my friend's judgment. She had eaten here before and loved it. And I can see why. The service is quick and the food came out after about a ten minute wait, if that.\nI ordered a chicken cutlet bento box and it looked gorgeous. I tried to eat it all but it was a bit too much food. Too much of a good thing? Love when that happens. The added bonus was that it was cheap. And that left me cheerful.\nWhile I was sitting there a lot of people came in so expect a bit of a wait if coming after work. Luckily the servers turn the table pretty fast so I doubt you would wait long.",
                "datePublished": "2010-12-13"
            }
        ]
    }
}