{
    "0": {
        "id": "o3grccDotDNXbANk7rKZXA",
        "name": "Nobu",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Mayfair",
            "streetAddress": "19 Old Park Lane\nLondon W1K 1LB\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/gKB5lZhcifPSu0XrR5q1Cw/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7447 4747",
        "review": [
            {
                "reviewId": "or5_Yzi4LtWmbVr05hjReQ",
                "author": "Paige S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Nothing short of amazing ate here twice while I was in London nobu never lets me down!!!",
                "datePublished": "2018-07-04"
            },
            {
                "reviewId": "g6hTkxT93THUrGdkidbHWg",
                "author": "Manfred S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Our Monday night experience at Nobu was MEH and only made it to A-OK thanks to attentive staff and management. The food alone would NOT have made it to A-OK. \nGoing to Nobu for her birthday after the completion of The Championship (aka Wimbledon for folks that are not interested in tennis) is our friend's tradition. So we looked forward some treats. All three of us love sashimi, but for variety, we thought the seasonal tasting menu would be a good idea. Wrong! The tasting menu was MEH at best. I rarely had worse. And it is hard to get less value (£100 per person). The tapas size dishes were generally over-sauced. On the seafood starter plate had salmon, but - in my opinion - salmon doesn't belong on a sushi/sashimi plate (unless you are feeding kids that are afraid of raw seafood). The marinated hamachi was one of the few enjoyable bites. It would have been better without the marinade as I like to taste the ingredients. Do not get me wrong. We all love spice and spicy dishes. I mean extreme spicy as long as the spice doesn't cover the ingredients' taste. Here Nobu generally failed. It got worse with their Wagyu course. No idea where that old cow came from. There was no sign of tender fattiness that Wagyu is famous for. Just pieces that remind one of shoe leather: both in texture and taste (and I am only exaggerating slightly). It was time for a call to management. They actually brought us a replacement dish. A Peruvian  style beef dish that was simmered rather than fried. It wasn't a great dish either, but the cooking method seemed to be more compatible with the beef they offered. The spice - a sauce that tasted a lot like tabasco from a bottle - didn't really agree with beef. The manager said that it is a traditional Peruvian spice. If true, I conclude that I do not like Peruvian spice. \nFrustrated with the food so far, we ordered a few pieces of sashimi and finally Nobu didn't mess up. Mackerel and o-toro were excellent. The scallops might be good for the location, but living in New England spoiled us, and therefore cannot win awards. The razor clams were out. Otherwise, the fish choices seemed pedestrian. Mackerel and o-toro are the winners. \nOn the beverage side, I asked about their Daiginjo. Our waitress said that the Daiginjo is very bland and she recommended one of their other dry sakes, Onigoroshi (at half-price). As I was hesitating, she offered to bring us two cups to try. The recommended sake was not bad, but had too many strong flavors with a hint of a bitter, chemical aftertaste. We stuck to the Daiginjo and were very happy after three large carafes for three people. The standard Nobu Daiginjo has a typical, clean, delicate Niigata flavor. Definitely done right! May be too delicate vor the Peruvian side of the restaurant. \nEventually we made it to dessert, which was pleasant and covered some of the earlier pains. Picture to follow ...",
                "datePublished": "2018-07-19"
            },
            {
                "reviewId": "kiyho-uOkdysrClUW7tkOA",
                "author": "Soomin R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Went for my birthday dinner and loved everything. \nWe had the \"classic\" omakase, which consisted of a good balance across starters, cold dishes, hot dishes and a dessert. Everything was fresh and flavourful, particularly the signature miso cod. \nAmbience was nice and modern, though it did get quite noisy toward later in the evening. I wish it had a bit more of an exclusive and quiet feel to it but otherwise, enjoyed the simple yet posh environment. \nService was spot on. Our waiter was proactive in explaining the menu and prompt throughout the evening in bringing out drinks and dishes. \nWould most love to return",
                "datePublished": "2017-05-12"
            },
            {
                "reviewId": "oLVF6_s9mL9xvDVdU9Zcmw",
                "author": "Andrew K.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "There once was a place called Nobu.\nIt was so new it no one knew.\nThat one day to the next\nIt would change from the best\nTo a place filled with rules\nSo sad that the fun\nLeft forever\nThat is the modern Nobu. \nA shadow of its former self.\nWith twice the assholery.",
                "datePublished": "2017-09-20"
            },
            {
                "reviewId": "pjwRdwZMfVUCBHePARo5aw",
                "author": "Tiana T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Came here on a Saturday afternoon just as it opened, and there were plenty of tables available. I had the set lunch menu with 2 apps, 1 main, 1 dessert. For my 2 apps, I got the sashimi selection and tuna tataki; I got the teriyaki for my main, and there was only 1 option for dessert. \nEverything was fine and the service was not bad. It's not worth the price, but then again you don't come here expecting to eat the amount you pay for. I was worried the hosts would be very snobby but that wasn't the case. I'm giving it 3 stars because really the food and service don't stand out; I'm glad I was able to try the infamous Nobu but I probably won't come here again until I start earning my meager accounting salary.",
                "datePublished": "2017-06-24"
            },
            {
                "reviewId": "wV5ZblDhoGrek1Nw4DQedA",
                "author": "Suomi H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Believe the Hype....Exceptional service, exceptional food, LOVED NOBU, cant wait to try another NOBU next time I travel.",
                "datePublished": "2017-11-29"
            },
            {
                "reviewId": "_jdJ7esvXgioi5fxaeNDBw",
                "author": "Angelica C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good and solid japanese food.  Consistent with their other locations around the world. I feel if you you been to one, you been to them all. My advice: Try a Nobu that's not in the city you reside in, just for the experience.\nWe ordered all the usual stuff:\nbeef tataki\nsashimi(uni/toro/hamachi/scallop/abalone/cuttlefish/wagyu/ etc)- very fresh\nsashimi salad\nrolls - avocado roll and tuna roll (the kids loved them)\nsalmon avocado hand roll - substantial and bigger than expected\nblack cod - cooked perfectly\nwagyu w/truffle \nWorth it, however there's other places also worth trying.\nLunch menu is good, too.",
                "datePublished": "2016-05-15"
            },
            {
                "reviewId": "Odm1pYtGMou7vcc3edyiQw",
                "author": "Sanjay H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great food - consistent with Nobu anywhere in the world. Good service. Good bar selection. Although it would be nice if the bar had high stools, or bistro style tables with high stools. While you're waiting on your table or for the rest of your party, you're practically sitting on the floor on the very low stools, which I didn't love as a tall person.\nAlso, the signage to the restrooms are slightly lacking. And if you use them on the way out, expect to get lost when you exit on the floor below and have no idea where you are relative to where you entered, unless you're a regular.\nAside from some tuning on the venue, the sushi is good, fresh, tasty, and well plated. It's Nobu - you can't leave feeling too disappointed.",
                "datePublished": "2017-04-04"
            },
            {
                "reviewId": "-ol3p_Bovh8FKX1biJaqVg",
                "author": "Marco F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "We decided to try walking in for a Saturday night and was fortunate to get a table (2 of us).\nDefinitely was skeptical due to the loud music and fancy decors, would the food let us down? \nFortunately the legendary Nobu lived up to the hype. The scallops were fantastic and some of the best we've ever had. Fresh, sweet and all the flavours on the plate complimented each other. Specifically the kelp was a textural and flavourful delight. \nAll the sushi we ordered was fresh and very well prepared. Even the pork belly was delicious, with great texture on the skin and flavours coming through the preparation.\nThe pricing was reflective of the Mayfair location and Nobu fame. Well worth it however for a special time or you wanted to treat yourself.",
                "datePublished": "2017-02-16"
            },
            {
                "reviewId": "zcswh9JLTx5Efyr-fgHmAQ",
                "author": "Phoenix T.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "It isn't really Japanese. Everyone from the wait staff are Eastern European. I doubt they speak Japanese. I could barely understand their English. The food isn't really Japanese, except they use soy-sauce.  Okay food richly decorated.\nThe salmon tar tar is just soak in plain soy-sauce. Yuck!\nIt is loud. One cannot carry on a conversation. Every time a customer walks in all the wait staff will yell out something that could almost be confused with a Japanese greeting (いらっしゃいませ). At least they did it with convictions.\nI would skip this one if you are look for food instead of an event.",
                "datePublished": "2017-06-23"
            },
            {
                "reviewId": "HdMYoIgmNam-aPQfpaZ3Xw",
                "author": "Lam N.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The sushi/sashimi at Nobu's is not the freshest and would make the best sushi chefs cry. But, overall, the chain produces a consistently pleasant dining experience, with some signature dishes that people happily go back for: kelp salad, artichoke salad, rock shrimp tempura, miso black cod, chocolate bento, etc.",
                "datePublished": "2017-06-24"
            },
            {
                "reviewId": "Tl_l_kvUc-Ly_tTFmSs3Qg",
                "author": "Leo U.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The decor is tacky. Food is good, but I doubt it's worth the price tag. A bit of a disappointment. But it's ok, it was a business lunch and I didn't pay for it personally.",
                "datePublished": "2017-10-15"
            },
            {
                "reviewId": "a8nzUwLOj9ggyPL2GsATaw",
                "author": "Shahmir H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great service. Just what you would expect from Nobu. The tiger prawn tempura is my favourite. Top quality food. We were well looked after. Subtle yet great atmosphere.",
                "datePublished": "2017-10-29"
            },
            {
                "reviewId": "rmUPlDgM3uFKe5awHn3AAQ",
                "author": "Sheetal M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I've LOVED Nobu!! I was taken there for my birthday treat and it really was a treat!! \nWe arrived on a Tuesday lunchtime so it was fairly quiet and were seated immediately. Prior to entering the restaurant, you can give your coats and bags to the cloakroom and then go up the stairs to the main restaurant. \nWhen we sat down we were given a choice of still or sparkling water (however I would've just gone with tap but I felt too shy to say at the time) and given a drinks and food menu. \nTo drink, I ordered a summer breeze cocktail (vodka, prosecco, raspberries and soda) which was really light and refreshing whilst my boyfriend ordered a virgin Mojito. The cocktails came fairly quickly and were really good! \nWhen ordering we had a few bits that had caught our eye, however I asked the waitress her opinion. She was very knowledgeable and when she saw that we were ordering two dishes which had various tempura bits in, she said that she would arrange for them to arrive at separate times which was nice of her. \nWe ordered the Chicken with Teriyaki Sauce and Tempura which came with salad, rice and miso soup and that was delicious!! The chicken was extremely tender and the sauce was sweet and not too sticky or dry. \nWe also had the octopus jalapeño which was slices of cold octopus in a jalapeño sauce. I thought that it was different but I liked it. Very tasty. \nNext there was Lobster Tempura with a Creamy Wasabi sauce and that was absolutely divine! The creamy wasabi sauce complimented the lobster and wasn't over powering. Definitely my favourite dish so far. \nWe couldn't go to Nobu without having sushi so we ordered the California with Crab & Avocado Inside Out cut roll and it was really tasty. I've never had crab sushi before but it was great. \nFor pudding we shared a Chocolate Bento Box which had a flourless chocolate fondant with almond ice cream. The menu stipulated green tea ice cream but I asked if we could change it and the waitress was happy to oblige. It was delicious but very rich. In hindsight I should have ordered something fruitier! \nOverall Nobu was great. Definitely go there for a special occasion/treat as it is expensive however it's worth it for the food, drink and overall experience you get!",
                "datePublished": "2016-05-18"
            },
            {
                "reviewId": "VA6XG941cVdny0uZ4TvecA",
                "author": "Kim M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Underwhelming meal. Four of us ordered both versions of the Omikase dinner. When a sizable piece of plastic wrap was found in one of the sushi rolls, the staff didn't really seem to think much of it. The roll was replaced with a fresh one but the manager never made an appearance to apologize. Presentation nice, service slightly above average but not special. We were hoping for a memorable dinner in London, but left with a pricey souvenir.",
                "datePublished": "2017-10-09"
            },
            {
                "reviewId": "KTIcHIrr7KSU6E70RhKkfg",
                "author": "Sophia F.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Pricey, food is good but not sure it's worth the tag. Anyway, great for people watching. Ambience is loud too but drinks list is long to make up for it.",
                "datePublished": "2017-06-21"
            },
            {
                "reviewId": "plJUT_maPv-Vq0dYks34Dw",
                "author": "Kristen C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "For such a posh neighbourhood a very mediocre dining experience.\nI'd been wanting to go to Nobu London for a while as I had tried it in other cities like Miami and found it to be a fashionable and trendy dining experience. Not so in London's Nobu. As a matter of fact it was disappointing from soup to nuts, from hello to goodbye.\nWe arrived, having a confirmed reservation, and well, I found the host a bit off putting and snooty, like he was quite bothered by having to work at all. That was the welcome but I was determined to put that behind us and enjoy the food. The dining room was very noisy and to be honest I can't say too much for the very plain decor which for having the upscale market clientele did not fit. The service too was very sub par. Our waitress really didn't know the menu and when asked questions had to go ask someone else and come back to relay the information, it all just felt 2nd rate. \nThe food too was just OK. Some of our sushi rolls were very basic and uninteresting. Perhaps had we had a waitress who could have made suggestions it might have helped with our selections. We did know our sushi but it might have helped to have tried more of the house specials, that sort of thing. It was all just bland and unexciting. Not to mention the noise in the dining room made it very hard to converse at the table. I was quite ready to leave which is a shame because we were very much looking forward to dining there. \nTo end the whole night out, a quick stop at the toilets resulted in a trek down a back staircase that felt like I was in the back of a nightclub. And the toilets themselves looked like they were from a nightclub. It really highlighted the fact that Nobu is way past its prime. We left looking for someplace else to have dessert.",
                "datePublished": "2015-07-15"
            },
            {
                "reviewId": "tCnEnk5EK4b8xVBsCAt3qQ",
                "author": "Alessandra L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "It feels like there's an extensive menu. We tried a little bit of everything, and yet 90% of it was rather unappetizing. What we ordered: \n- Baby spinach salad with shrimp: 5/5 actually one of the only good things that we ordered that night\n- Chicken with teriyaki: 3/5 chewy and overly sweet (even for teriyaki!)\n- Miso cod: 0/5 Oh. My. God. This was inedible. This was supposed to be the star of the show and it was a huge let down. It felt like it was doused in maple syrup. Couldn't taste the fish. Much too sweet and hard to stomach\n- Toro sashimi: 3/5 the tuna didn't taste like very fresh/high quality fish\n- Tuna avocado roll: 4/5 eh, very plain but that's just your run of the mill tuna avo roll\n- Edamame: 5/5 hard to mess up\n- Sea urchin crispy nori sushi cup: 2/5 I'm usually a big fan of sea urchin but the crispy nori sushi cup felt like burnt/tasteless/cardboard seaweed and it didn't complement the flavour of the sea urchin at all!\n- Chocolate bento box: 4/5 pretty standard chocolate fondant and the green tea ice cream was also ok\nThe service was really good, our waitress was very attentive, but I would personally never come back here again, especially considering the price for what you get.",
                "datePublished": "2017-07-16"
            },
            {
                "reviewId": "VZ7ojf4flgyHz-4yE-IdaA",
                "author": "Nancy G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "My son took me to Nobu on my birthday and it was amazing, chic and glamorous.\nBeef tataki and sashimi were were delicious.\nMy only observation is that since it was my birthday I believe they can do better than green tea ice cream and a candle.\nLiked it better than Nobu Miami and NY.",
                "datePublished": "2016-05-27"
            },
            {
                "reviewId": "xIqML92g5cLFLo-h0wyw7A",
                "author": "John B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Wow wow wow! One of London's best restaurants!!!\nAmazing quality food, atmosphere and service.",
                "datePublished": "2017-03-25"
            }
        ]
    },
    "20": {
        "id": "o3grccDotDNXbANk7rKZXA",
        "name": "Nobu",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Mayfair",
            "streetAddress": "19 Old Park Lane\nLondon W1K 1LB\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/gKB5lZhcifPSu0XrR5q1Cw/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7447 4747",
        "review": [
            {
                "reviewId": "x7UFF8D11gXeBgJlMaOHqg",
                "author": "Oliver L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Excellent food, as you'd come to expect from any Nobu establishment. All the usual favorites are here, including new-style sashimi, crispy rice with sushi, miso black cod, and creamy spicy shrimp. Although not very authentic, all our dishes were fresh and delicious, and presented excellently as well. \nService is decently friendly, if a bit unorganized at times (probably due to the fact that you don't have a dedicated server) - we asked to keep a menu for perusing main courses after ordering some appetizers, only to have it whisked away by a passing waiter. Waters were refilled frequently, and new cups of green teas were brought out as soon as the previous ones were finished. \nDecor leans towards the modern; lots of wood and decent lighting. I do wish they would eliminate the irasshaimase that all the staff shout out at arriving guests - it gets annoying pretty quick, and they all botch the pronunciation anyways.",
                "datePublished": "2014-01-09"
            },
            {
                "reviewId": "jW5r6XJraNB8VTi-l0TcYw",
                "author": "Nit S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I booked this for my partners birthday celebrations.  I was initially surprised at the ease of booking a slot and the restaurant was very accommodating.  We had been meaning to try this Nobu but had not got round to it.  On arrival we were greeted by a cloakroom attendant who checked in our belongings then we moved onto the restaurant.  The staff were always polite, courteous and very helpful.  I felt for the reputation of the restaurant and location the interior decor felt a bit basic however I tried not to be off put by this.\nOnce seated we asked the waitress to suggest a selection of dishes whilst also highlighting certain ones we wanted to try.  Her opinions were very helpful and honest and I would say her choices helped make our meal very enjoyable.  We ordered octopus jalapeño, lobster tempura, chicken teriyaki, Californian crab sushi rolls and cocktails.  \nThe waitress assessed our order and suggested the order with in which for our food to arrive at our table to maximise the dining experience, which it did.\nThe octopus was very nice however the pieces could of been slightly bigger.  The chicken teriyaki was very good as was the sushi.  However the absolute favourite was the lobster tempura.  It was amazing, although pricey it is well worth the cost and I would of been happy just having that, a man with simple yet expensive taste!\nOnce we had tackled the main and starters we shared a dessert bento box, again with staff accommodating the changes we requested, which in this case was a change of ice cream flavour.  \nOverall the dining experience was amazing, well worth it but I would suggest for a special occasion as it is very pricey.  The food is splendid, the staff superb and I would say it is one of my favourite meals I have had.  What are you waiting for, go to Nobu!",
                "datePublished": "2016-05-20"
            },
            {
                "reviewId": "rmYsskr9VB8QDAVOor00FA",
                "author": "Michal M.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Poor service, we had to keep asking for water, waited 30 mins for a single dessert while other guests ate. Flavours were very good, presentation also, but it's overpriced. Cocktails were fantastic. Overall disappointed - I won't be coming back.",
                "datePublished": "2017-10-15"
            },
            {
                "reviewId": "cAsBc9xFG5agkQlAI8raYw",
                "author": "Denise A.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Before reviewing Nobu, I should note that I have been to Japan and eaten fresh sushi there.\nThat being said, Nobu is likely the best sushi you can have in London. Our party arrived on time and we were promptly seated. The staff checked our coats and took us to our table. The locale is very trendy with some great lighting centered just above the table. Great for taking photos of your food! Also people watching as you'll see all walks of life inside.\nI expected the sushi to be the highlight of my dining experience here but instead it was the appetizers, notably the sushi tacos, the baby tiger shrimp tempura, and best of all--the roasted padron peppers. Each order of sushi tacos brings just one delightful little boat with some salted sushi and tasty salsa sauce to go with it. The taco was great with a nice buttery flavor. The baby tiger shrimp tempura stole the show. They were just perfectly fried with a non-excessive helping of creamy spicy sauce. And you'll think I'm crazy for saying this but the shrimp was laid out on the freshest bed of arugula (or rocket, for the Brits) that I've ever had. So fresh that my friend and I finished up all the tasty greens after we finished the shrimp.\nI was surprised to see the padron peppers on the menu instead of shiso (I suspect they may be the same). These playful peppers are known for their random distribution of spicy. Most of the peppers are not, but occasionally you'll get a really hot one and you won't figure out until you take a bite. These were roasted to perfection and quickly devoured by the members of our party. If these are on the menu (I believe they were a special that night) I suggest you try them. Their taste is pepper-y but distinctly different. More savory than sweet and rarely found in restaurants.\nThe drinks menu is nice an extensive with some traditional offerings plus a lot of nice Japan-inspired drinks involving sake, plum wine, lychee liquor, and shiso pepper leaves. I was between a bourbon based drink and the japanese margarita and ultimately went for the latter  which contained red chili infused sake in addition to your margarita fixings. There's a great number of non-alcoholic juice-based options if that is more your style. The lychee beverage was just sweet enough and definitely a nice alternative for those nights you really don't want to spike that alcohol level.\nFinally, the sushi. The sushi tacos had some of that lovely raw fish served at Nobu but were overpowered by the salsa and taco. The real show is with the sashimi. You order your individual piece and they'll bring them out in a grand serving plate. You get your choice of different tunas--all of which are fantastic and fresh. I had a lovely dining experience with the exception of a couple sashimis whose rice beds fell apart. These were dabbed on the underside with just the right amount of wasabi. Although if you like some more you'll have some of that as well at your table.\nUltimately this was a positive experience albeit over priced. This is likely a combination of Nobu being a trendy London restaurant and the steep prices for decent fresh fish in an inland city. As mentioned before, the show stealers were really the tempura shrimp and the padron peppers rather than the raw fish.  At the end of the day, the reality is that I had a more satisfying sushi experience at a hole-in-the-wall restaurant in Tokyo than I did at the great Nobu in London. I loved the arugula and padron peppers, but is that really what you should take away from this experience? Just not worth the price tag.",
                "datePublished": "2015-12-05"
            },
            {
                "reviewId": "Jf89TKmeDqYDlBgndvB5Hw",
                "author": "Delphine L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Miso black cod. Enough said.\nEvery dish is perfect - lobster with truffle, amazing sashimi - and the service very efficient.",
                "datePublished": "2016-09-12"
            },
            {
                "reviewId": "sJlE0yzqVKiJVk99l-dkaw",
                "author": "Francesca T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I've always wanted to come to Nobu in London so when I made reservations, I was looking forward to the experience already. The waiters are very accommodating towards my vegan needs and made sure everything I ordered didn't have fish sauce/butter etc. My avocado tartar was delightful and I have no idea what made their veggie stir fry so delicious. We ordered lovely cocktails too and the entire experience was very lovely. I like how it's an upscale restaurant but you could definitely dress up or down here. I would definitely recommend it for anyone looking for some fancy, Japanese cuisine in London.",
                "datePublished": "2016-02-18"
            },
            {
                "reviewId": "kvdtpaAoGjndQA61rhWYsQ",
                "author": "Carl J.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The first Nobu restaurant in London. Fairly typical Nobu style. Craving for Sushi or Omakase, the place to go! Good selection of sake, professional service, and a relaxing atmosphere! Love it!",
                "datePublished": "2015-09-17"
            },
            {
                "reviewId": "XH-CiuDK4O3Ral_hEpI6Lw",
                "author": "Ally W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Nobu has always been on my to try list. However, as London has so many restaurants, I finally got around to it on an opentable deal (4 courses for 49 pounds). I was excited to finally go. Then I went to the wrong Nobu. I went to the flagship store on Berkley Street only to realized that my deal was at a different location on Park Lane. When I finally arrived at the restaurant, I was disappointed, as it looked quite plain and we even only had those one time use chopsticks. \nI ignored it all, as I was anticipating a great meal. Then it turned out to be a very OK experience. The four course we had were sashimi starter, assortment of sushi, tempura and then chicken with Teriyaki Sauce. I was expecting a lot more from Nobu, or at least a little twist or something different. If these were the dishes I want to eat, I would have gone to a local Japanese restaurant. I felt it was totally pedestrian. I understand that usually restaurants don't tend to put their best dishes in set menu deals, but come one, maybe just one awesome dish to make me want to come back and try the regular menu. Now, I have totally no desire of returning.",
                "datePublished": "2014-12-20"
            },
            {
                "reviewId": "95he0zMijXzx9OzYA98aBg",
                "author": "Linda J.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Food: We ordered the shrimp tempura for our starter (always a great way to start the dinner), the red chilli sole (delicious!) and the poussin truffle (great flavour) for our mains and added in a spicy tuna roll.\nDrinks: We ordered two glasses of prosecco.\nPrice: 131.10 GBP for two people.  It's expensive, but it's Nobu.\nAmbiance: For a Monday night it was buzzing.  There were a lot of business dinners, but also a lot of locals enjoying a night out.\nService: Our server was very friendly.  They did mess up on the timing of our entrees because my sole came out first and the chicken arrived 20 minutes later.    They apologised for the delay, but said \"the chicken comes from another kitchen\"...not sure if I believe them.\nWould I go back?  Yes.  Nobu is a classic and it's much better here in London than in NYC.",
                "datePublished": "2014-06-22"
            },
            {
                "reviewId": "YhKcwZTW6d6T04HM1lC1tw",
                "author": "Yag P.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "You've been to one nobu and you have been to them all. It's a bit overpriced and over rates at this point.",
                "datePublished": "2015-07-19"
            },
            {
                "reviewId": "Ec8vA2ijfB-gI4elYgfG0A",
                "author": "Alan A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Was at Nobu on 6/2/16. First time. Everything was as expected. Called at the last minute for reservation and they were able to get us in within an hour. Waiter was excellent taking his time to explain and to make sure we did not over order to much food. He actually had us cancel some food we ordered because we were going overboard on the ordering. Sushi was fresh and well presented. Wife had Teriyaki Chicken and it was cooked well. Tempura Shrimp appetizer was just right and dipping sauces were tasty.",
                "datePublished": "2016-06-10"
            },
            {
                "reviewId": "lozxrQpYWnd3ETJEI1_4fg",
                "author": "M J.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great place for sushi and drinks!! Let's start off with the drinks...my top 3 are the Watermelon Martini, Lychee Martini, and the Pear and Cinnamon Mojito. I'm all about tasty drinks.\nThe food is sooo tasty! Nobu and Zuma are a must every time I visit London. Must haves are the Rock Shrimp, Spicy Tuna with Crispy Rice, Hamachi (Yellowtail) with Jalapeño Sashimi, and Miso Cod.\nOverall the staff is nice but they get somewhat unorganized when it gets busy. I'm a big fan :)",
                "datePublished": "2014-11-16"
            },
            {
                "reviewId": "eQqB55T2qIjS6ce7FGoYMA",
                "author": "Daniel F.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This is one of those, I must try in my lifetime places based on reputation certainly.  One of the only chances I could get was when I got the bento box on a special opentable deal with friends who had organised it recently.\nPros:\nTuna Sashimi - Wonderful\nAssorted sushi was very fresh and tasty (3 nigiri and 3 maki rolls).\nBlack Cod was good.\nCons:\nRaspberry cocktail came with deal and it was OK. Nothing special.\nNot the biggest bento box in size.\nDidn't think much of the décor and surrounding space at all. Very simple which is fair enough since Japanese style is like that, but it was almost too simple (especially if you were to pay a proper premium price to visit). And seemed to be a lot of staff hanging around. Not bad, but nothing special.",
                "datePublished": "2015-05-21"
            },
            {
                "reviewId": "5Yylk9b5Vw1r6AeBeRiAfw",
                "author": "Jo O.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "of course the food is great - however, I have had food just as great for a third of the price. I was really looking forward to my meal and had high expectations. and although I enjoyed my meal - I couldnt help thinking of all of the things I could have spent that money on and still had a great meal - the decor is nothing special and the wait staff quite rushed. \nIn summary: Great food, over priced in mediocre surroundings.",
                "datePublished": "2015-02-10"
            },
            {
                "reviewId": "VrUVBjISraDv1rs9Ms2V6g",
                "author": "Ramona C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I agree totally with Kirsten C ! Spot on. Went there tonight and was very disappointed. Main course arrived late and cold. Didn't even get a proper apology from the waiter forget about anything to make it up. Bad service! Never again! You can really eat good sushi with that money!!!!!! So yes, food didn't throw me on my back at all. \nSorry but no, thank you Nobu :-/",
                "datePublished": "2015-08-04"
            },
            {
                "reviewId": "j7nWoubgpM0OuqNeg9pLxg",
                "author": "Miku O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Really enjoyed their food. They add clever twists to the dishes - would definitely recommend",
                "datePublished": "2015-08-16"
            },
            {
                "reviewId": "Tl_JAJ2yA4sC8p35XlKqXg",
                "author": "Nadia N K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Well...It's Nobu & what that means is pricey. With that out of the way...\nFood: Fantastic. Quality of sushi was excellent\nService was close to perfection.",
                "datePublished": "2015-01-11"
            },
            {
                "reviewId": "cuIKq1lEWwMNqcLtqGZAgQ",
                "author": "Jan Fredrik B.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "\"Good evening and welcome to Nobu London...\" Yeah, right! I didn't feel welcome at all.\nAt Nobu London you can reserve a table, but for a maximum of two hours. This is the new generation of fast food. Literally.\n\"Would you like some *something unintelligible*?\" Some what? \"Oh, you haven't been here before. Eh, what do you usually like to eat?\" My sister says that she likes spring rolls and tempura maki. \"Nice, something more?\" We actually have to ask if it's possible to wait for the last one (me, I came a few minutes late) before ordering, and maybe have a look at the menu.\nWhen I arrive they start filling up our glasses with water. That we pay for. You take one sip and they're all over you filling up your glass again. And again. And again. \"Do you want another one?\"\nSo, food then. We decide to order a wide range of sushi, meat, green beans and spring rolls to share. After giving our order she suggests ordering a main meal for each of us as well, because it won't be enough. We have to convince her that we'll start with this, and then see.\nOrdering a couple of beers and a coke as well. Beer is thrown into the glass with no control, I've rarely seen that much foam. And they continue filling up all the time. Just to get rid of it. So we can order some more.\nAnd now the food starts arriving. First some sushi. At least the food isn't the worst I've ever tasted. That's something. Moving the last piece of sushi from the plate, and they're all over us again removing the plate. It happens again, and again. They even ask if they could take out those we haven't finished yet.\nWe're kinda wondering if this is a comedy show with hidden cameras. At least not a restaurant where you have to pay £3.50 for rice in an espresso cup, and where a dinner for three adults and a child, without starters or dessert, costs £160. Remember that we ordered little food. Yet we were all satisfied. We would like to have some dessert, though. But not here.\nPaying was an exciting process. Just by putting the credit card at the table we got the bill, and seconds later the payment machine. \"Insert your card here, please\". We had to persuade her to let us look at the bill first. No option whether you wanted to pay the service charge or not, even though the bill stated this opportunity.\nBefore leaving for dessert at Hard Rock Café I had to go to the toilet. Straight forward, to the right, in through some doors who made me wonder if I was heading toward a submarine or space ship. Then down some stairs and through a couple of corridors. Oh, there it is! If you're a man at least, women has a few more stairs to take.\nAfter doing what I had to, I went to wash my hands (of course). Oh, another Nobu-employee. Thanks for showing me how to turn on the water, I wouldn't find out myself. Yeah, I know how soap dispensers works as well, thanks dude. And even before I got the soap off my hands he stood there with the towel up in my face. If I want another one? Does it look like I would need another one. Don't think so. And then you want money? Here is a pound, hope you're happy!\nSo... finding my way back is the next mission. I wasn't aware that I came here for a labyrinth adventure, but that's how it turned out. After taking some stairs, I try a door. Oh, hi dude. \"This is wrong way\" We take one more stair before trying again. Old flowers, meeting rooms and an elevator. Guess it's wrong again. After walking up and down the stairs trying some doors we found our way out of the labyrinth.\nFinally out of this place we're heading down the street for a dessert at Hard Rock Café. At least we're welcome and we can even sit as long as we want.\nSpare your time, money and irritation. You're not welcome at Nobu anyway.",
                "datePublished": "2012-08-06"
            },
            {
                "reviewId": "uLWMzZFCqwMPAgUO6cnlTg",
                "author": "cindy g.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Delicious Sushi, Great Service, and Lovely Sake.\nWe were lucky enough to get a seat at the Sushi bar on a Friday night.",
                "datePublished": "2015-06-10"
            },
            {
                "reviewId": "W6MSFOJRmefTeZtb-gNQzw",
                "author": "Katy G.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Ah, Nobu. I'd been looking forward to going to visiting you for so long.  Honestly, if I had gone here a few years ago when good food in London was hard to fine, I would have left this dinner with a full stomach and huge smile on my face despite the bill. My 3 star rating here isn't' because the food is bad - because let's be honest, great sushi isn't easy to find in London, but because the value just simple isn't there.  I wish I could say I wasn't disappointed but we left Nobu full on tempura, delicious sushi, dessert, cocktails, saki and a 200 quid bill and I couldn't help thinking of all the other places we could have gone and left just as satisfied for half the price.  \nWe decided to go to Old Park Lane as it was easier to get a last minute reservation (so no, not Berkley Square!).  Though Nobu is indeed right next to the Park, the view isn't what you would want or expect given the status of the restaurant and I was disappointed during a visit to the ladies' room to see how old and not-charming the walk down the stars was. These may seem like petty things to point out, but when you're paying top notch for dinner (and with comparable places now in London) this just didn't do it for me.\nSorry, Nobu. Maybe I'll like you better in NYC.",
                "datePublished": "2014-11-05"
            }
        ]
    },
    "40": {
        "id": "o3grccDotDNXbANk7rKZXA",
        "name": "Nobu",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Mayfair",
            "streetAddress": "19 Old Park Lane\nLondon W1K 1LB\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/gKB5lZhcifPSu0XrR5q1Cw/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7447 4747",
        "review": [
            {
                "reviewId": "fZpeJODq4gLLeXck7PbT2w",
                "author": "Rob H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "What can I say about Nobu. First of all, the name carries a lot of weight and you expect nothing but the best when you make the decision to eat at Nobu. They have an international reputation the maintain. \nI met a friend of mine here for cocktails and dinner on a Friday evening and was not at all surprised to find it very busy. I was on an unexpected visit to England having just returned from Borneo and was very happy that nobu could take a reservation on such short notice. \nThe service was pretty good, not great but it was very busy. The food was as well good but not fantastic. I have had better sushi at a \"hole-in-the-wall\" in Hawaii and for fraction of the price. The drink menu was on point and their cocktails were quite good.\nAll in all not the best Nobu I've been to and not the best sushi I've ever had but it was pretty much what I expected from Nobu London. I wouldn't make this my first stop next time I'm in London. I'm not saying don't come - just look to other options before you decide.",
                "datePublished": "2014-12-12"
            },
            {
                "reviewId": "01gB7QJAZFzv7qTIc8eWog",
                "author": "David U.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great sushi in London.\nIf you walk in as a solo diner, you can sit at the sushi bar without a reservation.  The service is fast, the fish is incredibly high quality, and the sushi is made with love.\nIf you order a couple rolls, you'll fill up on rice a bit and not break your wallet. \nI've eaten here many times, it's always consistent and good.  Service is great",
                "datePublished": "2015-01-25"
            },
            {
                "reviewId": "iQslfehhjs23ef7-OE-i1A",
                "author": "Nicolas S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "An overall solid performance, with just 2 complaints to make.\nFor lunch with I had a single piece of o-toro tuna sushi, the new style salmon sashimi, and a beef katsu donburi. For all this and a glass of iced green tea I payed 60 pounds.\nThe o-toro sushi was fantastic. The quality of the fish was exquisite, and the rice was just perfect, bringing such an amazing amount of flavour which, instead of masking the flavour of the tuna, enhanced it. There was no need to add any wasabi in my opinion as the right amount was already added by the chef. Even the ginger and fresh wasabi which accompanied the sushi was of very high quality. 10/10\nNobu's new style sashimi is, simply put, Japanese style carpaccio. The sashimi is arranged on a plate with shaved ginger, sesame seeds, and finely chopped scallions. It's then drizzled with soy sauce, and I believe sesame oil and some yuzu or lemon juice, which gives it a sour/tart flavour. Heated olive oil is also drizzled over the sashimi to cook it slightly, altering it's texture and flavour slightly. I thought this dish was great, except the dish was a bit too sour, overpowering the other flavours and unbalancing the dish, making it hard to discern the taste of the fish, or even the other components of the dish. A little less acidity would go a long way. 7/10\nThe main course course was the beef katsu donburi, which is a thin breaded beef steak about an inch thick, fried first in oil, the finished in a separate pan with a broth mixture where a beaten egg mixture is added towards the end of cooking such that it almost wraps around the beef. It's served over a bed of rice. It was delicious. The beef and the egg mixture had taken on the taste of the savoury, slightly sweet flavour of the broth, complementing it beautifully with it's own. The rice was also perfectly cooked and was lightly coated in the thick broth as well. Unfortunately the beef was overcooked to 'well done', which was a shame as it dried out the beef. It was explained to me before that they're unable to cook it medium-rare as it's quite thin, however I was expecting it medium or medium-well at most, rather than the well-done and dry state that it came. Although the flavours were fantastic and the rest of the dish was damn near perfect, the main component of the dish being dry and overcooked greatly detracted from the dish. 7/10.\nAlthough the raw ingredients used here, especially in the sushi/sashimi dishes, are of an extremely high quality, the execution of the dishes was a let down. New style sashimi is an interesting idea, but the dish was too tart to be something truly memorable, and the overcooking of the beef in an otherwise wonderful donburi is almost criminal. A good meal, but not great, which is what Nobu should be.",
                "datePublished": "2015-07-19"
            },
            {
                "reviewId": "qrAcaE4skea8FX6dMVnwCQ",
                "author": "Daniel N.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Disappointing.\nWent here for a work dinner, so while I did not have to pay, I will still disappointed.  \nI'm always cautious of Japanese restaurants where there are no Japanese patrons. I was here for dinner on a Monday night and did not see a salary-man in sight.\nDo not get me wrong, there was nothing wrong with the food. There was nothing great about the food either.  When you're hawking a 100 pound omakase, I expect to be impressed. I think Nobu was one of the trendsetters for what we now see as the typical western Japanese restaurant. That's exactly how it felt. Like every Japanese restaurant from the 90's.  \nI love gindara miso to death, but the Nobu version was not any better than the 100 imitation restaurants. I would not return unless I absolutely had to. There are other better overpriced Japanese restaurants.",
                "datePublished": "2014-03-30"
            },
            {
                "reviewId": "nX174N562soCmWaXA01DPA",
                "author": "Sandy T.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "What is the fuss all about?\nI am now wishing I had read Yelp reviews BEFORE we went.  \nPicked this place to celebrate a friend visiting London, for a big milestone birthday dinner.  What a terrible choice.\nBeing from Vancouver and then Toronto, I was spoiled for choice for good sushi.  Ever since moving to Europe, I've had a tough time finding something as delicious as my favourite haunts in Toronto.  \nSo naturally, I thought Nobu, world famous, name-dropped on shows, etc.etc., must have decent sushi.  I had high expectations.\nThe food was...meh.\nSmall portions, expensive, and not that impressive.  If you're from Vancouver or Toronto, seriously, that place down the street from you that you think has average food but is cheap does the same thing.\nUgh.  To add to it, the service was downright awful.  A couple of us had set dinners and a few of us shared small plates.  Only those of us who declared \"sharing\" were allowed plates.  Other people asked, and were TURNED DOWN.  I'm not even kidding you here - \"oh no sir, you don't need a plate.\"  \nAs soon as the sharers finished, their plates and chopsticks were whisked away.  We protested \"but we want to keep our chopsticks so we can try a piece of other people's food!\"  The server looked at us like we spoke Martian to her.\nWe were a party of 5 - four of us had received what we ordered, finished it all, before the fifth person received his first dish.  And he ordered three small dishes.  Yes, food comes staggered in a Japanese restaurant, but this was absolutely ridiculous.  You couldn't get out a sushi roll for this guy in 30 minutes, but everyone else at the table who ordered sushi got theirs in a timely manner?\nJust...DON'T DO IT.\nI'm so upset that my friend's birthday celebration was marred by such a terrible dining experience.  Wish I had kept the other reservation I made for that evening instead.",
                "datePublished": "2013-09-10"
            },
            {
                "reviewId": "PGdzXxcbvCBSmdigCuqRAQ",
                "author": "Shaun D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A great established name that still seems to offer a near perfect experience. Service and food that can't be faulted within a simple Japanese decor setting that actually makes you feel very comfortable. The above comes at a \"price\" and the cocktail list could also do with some work. Tip - Go for a bento box to try a wide selection of dishes, this also include their blackened cod with miso signature dish which is a must. (Visit - 09/09/2014 Dinner)",
                "datePublished": "2015-08-07"
            },
            {
                "reviewId": "5WY4DZ-hCByQueOVBTyK9w",
                "author": "Nathan B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The food was amazing.  I mean amazing.  Crazy expensive as well, but amazing.  The must-try options are the pan seared black cod which is perfectly cooked and full of great flavour, and the yellowtail sashimi in jalapeño sauce.  Cocktails are made perfectly and service is perfect, as expected for the price.  If you're paying, take the cash for a night out and just buy a month's worth of groceries, but if someone else is buying, prepare yourself by not eating for a few days in advance and order everything on the menu because it's that good.",
                "datePublished": "2014-02-15"
            },
            {
                "reviewId": "4mOU8VyCFWQgbS4ICbDWPw",
                "author": "Fos G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Alright, haters! \nTo say that the food at this specific Nobu is bad is CRAZY. The ambiance might be stuck up and unfriendly, the staff is definitely pushing to make you order as much as humanly possible, the decor is not jaw dropping, I will give you that. But the FOOD is amazing, and I can generalize on the subject not only because I have been there a lot of times, but because the last time we went, in 5, we were a little drunk and very late, so we had to just go ahead and order before the kitchen would close, and so we ORDERED. EVERYTHING. TWO of everything. \nOur check was over 1200 gbp for five people, so you can imagine the sheer amount of comida. ALL good. I am strict and relatively harsh on my reviews, but haters, don't be hatin on NOBU! it's stuck up, pricey and pushy, but you are guaranteed a divine meal.",
                "datePublished": "2013-07-17"
            },
            {
                "reviewId": "BwvKjF2Xq8v24t14JDbYLg",
                "author": "Robert F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I love Nobu in London.  It's in the Metropolitan hotel, which is a fun, upscale hotel in the great area of Park Lane.  The food is great.  Service can be hit or miss but it's generally very good.",
                "datePublished": "2014-03-23"
            },
            {
                "reviewId": "OE_QIPC_C0iwPZkOX2iQWA",
                "author": "Dana C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Quality is ace, great service, best Old Fashioned I've ever had.",
                "datePublished": "2013-04-10"
            },
            {
                "reviewId": "PtpZPiocAlhI_UYJamOv5A",
                "author": "Malcolm S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The quality of the food at this well known and respected restaurant can't be faulted. They managed to bring extraordinary flavor and taste to octopus, a difficult task.  Every dish was well prepared and elegantly presented. I greatly enjoyed the caviar infused martini but then again I rarely meet a crisp, cold and dry martini I don't like. ( we can talk about dirty martinis later). \nHere's where I do find fault: while the service was excellent - despite the fact that the place was very busy - management has devised a clever way to add $10 to the bill. They initially offer water and immediately open and provide bottled water. Add that to the bill and the \"optional\" 15 percent tip and VAT, well you take my point, a fairly substantial bill (worth it) becomes one $13 plus dollars higher. \nSo, if you eat here, and you should, have an extra martini and say: tap water please. You can always drink water at the hotel or at home. You will survive and be happier in the long run. \nThat said, back home soon to barbecue and bourbon but I do sound fancier when I'm in London.",
                "datePublished": "2015-06-09"
            },
            {
                "reviewId": "cEavdehuhwa4d3OSA3qGwg",
                "author": "Bill D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "One of the best meal I have ever had! Service was outstanding and every dish was unique and fantastic! Definitely a must try",
                "datePublished": "2015-07-06"
            },
            {
                "reviewId": "kCgJmptbv2fwayHC2mfrUw",
                "author": "David G.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Not inedible, but just average by even San Francisco standards. Out the door for 235 pounds. \nNot again.",
                "datePublished": "2013-08-12"
            },
            {
                "reviewId": "TfZVjG8Dh6vyIX9CRPhRTQ",
                "author": "Tania E.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Amazing food, very consistent. Everyone loves Nobu. My favorite dish is the sea bass carpaccio with dried miso",
                "datePublished": "2016-04-01"
            },
            {
                "reviewId": "7NOtiFbjehtMku2SKByueA",
                "author": "Caroline K.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Their raw food's excellent, the rest is only so-so.\nCame here for lunch on a Sunday and the first things that struck me was the number of children under the age of 10. They ordered the £42 miso black cod without thinking twice and knew the menu by heart. Unreal.\nThe decor's quite minimal with a few japanese flower arrangements on the larger tables and while not unpleasant, having heard so much about this place I thought it'd be grander. Similarly, service could've been better. Given the number of wait staff walking around, nothing much seemed to be happening. They check all the boxes in terms of refilling your glass, taking your order, but something's still lacking--personality. It all seemed quite mechanical, like you'd expect at a chain (which I guess this is).\nIt took quite a while for the food to arrive but the sushi was definitely worth the wait. Very fresh, great selection. The negi toro cut roll was superb and the seaweed was crispy. The scallop sushi was sweet and smooth and they were huge! The mackerel sushi was also really good--oily with some bite. You get two thin slices on the rice instead of one thick slice, which is much more enjoyable texture-wise. We also ordered the snow crab in creamy spicy sauce, which looked a lot like a cheesy pasta bake. On its own the crab was so tasty but there was too much sauce which totally masked the flavour of the crab! :(( The rock shrimp tempura with ponzu sauce were even more disappointing. Although the serving was huge and you could tell the prawns were fresh, you could taste and feel the oil. The ponzu sauce made them so soggy that the batter would peel off as your chopsticks touched it. And you could hardly taste the sauce! When you could, it was delicious, but that rarely happened. I feel like it's the sort of dish that you'd order to keep ravenous teenage boys full on a 'budget'.\nI probably wouldn't be coming back. The quality of their sushi's top tier but at that price, you can get equally fresh sushi elsewhere in London. No reason to come to this particular restaurant other than to say you've dined at Nobu.",
                "datePublished": "2013-03-17"
            },
            {
                "reviewId": "rLUNxYiOg8Y9jHjUKrJrbg",
                "author": "Leslie W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "BOTTOM LINE: Whilst it *definitely* ain't Kaji (Toronto) in terms of quality or creativity, the dishes are solid (but not mind-blowing) and the price factors in star-gazing opportunities.\nCost:\n-£63 (~$101 CAD at time of writing) for the standard seven-course omakase (tax & mandatory 10% tip included).\nAtmosphere/Decor:\n-I sat at the bar where I could watch the chefs work, and whilst they were all solid (some more than others), none could compare to chef Kaji.  Whilst I realize that these guys have to prepare for more people, it just makes you appreciate how much time and care chef Kaji places into its few.  Sorry if this review is turning into an indirect one for Kaji Sushi.  :P\nOrdered:\n-There's your standard menu where you can order individual items and a choice of two omakase: the standard £55 one and the more \"creative\" £65 one.  I ordered the standard one:\n1. Tuna tartare with special peach - The tuna was fresh, but perhaps the best part was the peach!\n2. Tuna salad with shrimp - The dressing was a bit strong and hid the flavour of the tuna, and the shrimp looked and tasty somewhat bland.\n3. Black cod miso - Everybody seems to rave about this as the *BEST* thing ever, and whilst it's well done, I just don't understand the hype.  Many standard Chinese restaurants can steam / grill all kinds of fishes that are just as good.  A nice touch was the tasty rod of white ginger.\n4. Scottish beef tataki - As per its name, the beef was nicely seared on the outside and placed on a sizzling plate with fresh asparagus and enoki / shitake mushrooms.  The sauce was much too salty for me, but it was interesting to eat different slices of beef at various levels of 'well-doneness\".\n5. Sushi platter - Standard sushi with nice rolls made from soft shell crab and asparagus.\n6. Miso soup - Does this really count as a course?\n7. Cappuccino icecream - You can't really go wrong with this!\n-As a side note, I tried Nobu Miami a few years ago and it was good to see my favourite dish - yellowtail with jalapeno - still on the menu. I wished I had the appetite to order it again!\nService:\n-Staff were friendly, if not a bit detached, and the dishes were served at a good pace.  No complaints.",
                "datePublished": "2010-09-05"
            },
            {
                "reviewId": "9tf9w51Q-uCkLiIT_iAEgA",
                "author": "Natalie K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "There's no way around it: Nobu has the best Japanese food I have (yet) had in London. All the fish is so incredibly delicious, so flavorful and perfectly cooked/not cooked/marinated/spiced....just absolutely divine. \nMy favorite dishes:\n-Raw oysters: Seasoned perfectly with a delicious, light, sauce. Not to mention the presentation of the dish was gorgeous.\n-Yellowtail sashimi: I've had a LOT of yellowtail, and this was the most incredible yellowtail I have ever had. Also seasoned to perfection.\n-Black cod: Char-grilled and served over a bed of greens. So delicious and unlike any fish I had ever experienced.\nFor desert I enjoyed the frozen yogurt with fresh berries and some kind of incredible sauce. Supposedly they made a fresh batch of the yogurt every four hours. I am a hardcore froyo addict, and I had never experienced anything quite like",
                "datePublished": "2010-07-08"
            },
            {
                "reviewId": "fGtFja6TYzBYE4pD5rGJ_A",
                "author": "Stéphanie S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "With the reputation and fame of Nobu, it's hard to think that I haven't heard of it before coming here! I ended up here for dinner almost by accident without any expectation.\nDecided to take the chef's choice \"Omakase\" at  £95 (add Sake to it and you'll get the most expensive per person meal I ever had)... it was quite a treat to say the least with every plate an experience in itself. A quite unique fusion between Japanese and South American is what you'll get here if you try this option. This clearly a chef's restaurant with innovative dishes, not a traditional sushi place.",
                "datePublished": "2011-01-02"
            },
            {
                "reviewId": "cSRy4xtUpHN0rXTagLldZQ",
                "author": "Jaina S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I was distracted from the food experience by my fellow diners on a Sunday lunch.  \nOh look, here comes a Birkin bag, with its friend, the Prada bag.  Oh wait!  here's another Birkin!  Is that ALLIGATOR?  and what about this table, 3 dudes about 20 years old, is that one wearing a $25,000 watch?  \nI get the sneaking suspicion people are about 'seeing and being seen' more than culinary experience.\nas for the food -- had the bento lunch.  There was a TON of food (too much, in my opinion).  and yeah, that black cod in miso is pretty good.  And actually the sushi is among the best I have had.  in fact the sushi is why I'm giving this 3 stars instead of two.  \nIf you want decent Japanese food I'd suggest looking elsewhere. \nIf you want a Michelin starred lunch, there are better choices in London.\nIf you want to show off your new handbag as you leap out of your Bentley at lunchtime, book a table here.",
                "datePublished": "2012-03-14"
            },
            {
                "reviewId": "jUwGDICDg8XRBP7Zy9k-PQ",
                "author": "Ben O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "One of the better nobu's I've ever been to. Extremely friendly staff will definitely visit again.",
                "datePublished": "2014-11-30"
            }
        ]
    },
    "60": {
        "id": "o3grccDotDNXbANk7rKZXA",
        "name": "Nobu",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Mayfair",
            "streetAddress": "19 Old Park Lane\nLondon W1K 1LB\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/gKB5lZhcifPSu0XrR5q1Cw/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7447 4747",
        "review": [
            {
                "reviewId": "TCVM9n3bDGO0t4g2dkzICw",
                "author": "My Voice Matters W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Nobu is a reputable brand known for it's quality foods and elegance worldwide, however Nobu London has fallen short in delivering the same quality found in it's American counterpart.\nI've been told not all Nobu's are the same, especially if you've eaten at their New York or Los Angeles restaurant you'll most likely be disappointed. Location is good, situated in the posh parts of London Old Park Lane, Mayfair. Decor was mediocre; not their usual modern-ellegant 5-star themed interior design. Since it wasn't busy when we went service was good, prompt, & a bit over staffed. Food was reasonable for England, fresh, tasty and it really is the best Japanese food restaurant around just don't go comparing it to the US. \nNote: Unless you have money to spend (£70-100 per person) or familiar with the Nobu brand then I wouldn't recommend it value for money.",
                "datePublished": "2012-08-15"
            },
            {
                "reviewId": "OBVksqsJEuKuOhhgg98Bqg",
                "author": "Decisive M.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "If I could no stars for the head asian hostess I would. Very rude and not welcoming by any means. She needs to be retrained to work at the front. After speaking with many people, apparently they have gotten the same treatment. What a shame for a restaurant to have one person cause so many customers to leave and return their establishment over that type of behavior.\nThe food is slowly going downhill too. It used to be much better! Time to redo the menu.",
                "datePublished": "2012-08-18"
            },
            {
                "reviewId": "97-vFNbykfUJQ51IRDin7g",
                "author": "Andrew T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I've been to a couple Nobu restaurants - Nobu London is my favorite.  Sushi is good as expected but the dishes are where Nobu differentiates itself.  share / do family style so to try more dishes.  Pan Fried Dover Sole with Red Chilli Shiso Salsa was pretty unique.",
                "datePublished": "2015-01-01"
            },
            {
                "reviewId": "3pdYNVwF0FrMDtEUKK6PSg",
                "author": "Kierstan G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "this place should be a 5 star place.  but i feel like its on of those places that has gotten too big too fast, the service actually can't keep up with their reputation.  This was the meal we looked forward to when we got to london.  in fact, we were shocked when we got a saturday night reservation! Actually, other meals surpassed this., by far.  \nthe actual sushi and fish was amazing...probably the freshest I have ever tasted....got the toro, toro-o, yellow tail and salmon.  We also got two rolls, the lobster tacos (yay!) and the ceviche...which was ok.  The cocktail list was good, the wine list great, but the sake list was small...the reserve premium sakes almost non-existent.  Then when the waiter brought our sake he put it in an ice bucket and left.  Uh...you are supposed to pour our sake, its tradition.  Maybe ill be back to a different nobu...heard they are opening a hotel in vegas.  But I won't be back to this one, and i will not choose nobu as a special occasion again...",
                "datePublished": "2012-06-23"
            },
            {
                "reviewId": "n94HLrH8114QVLHrTJhSNg",
                "author": "Nam T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The Service in every Nobu Restaurant is outstanding as for in London and food overall great but not internationally supreme in the way that Nobu is reputed to be as as my dinner in Nobu New York was far better. I would recommend to go there for lunch as it is not too noisy and you can enjoy your sushi. Quality of the sushi was excellent but I have to complain that the pieces of the sashimi are too thin to really justify the price. Service was outstanding, it is a real plus never having to wave down waiters and to know that whatever you ask for would be delivered without being forgotten about.",
                "datePublished": "2013-10-01"
            },
            {
                "reviewId": "UBpmpbXQzcm9vGA7hU5a2Q",
                "author": "Treeve P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Beautifully prepared sushi, a real indulgence, and toro I will not soon forget. No cheap of course, but who'd expect it to be? I certainly don't consider visiting Nobu essential in your search for great sushi but it's definitely worth a visit.",
                "datePublished": "2014-10-24"
            },
            {
                "reviewId": "oxQ6h51boUkIyo6390PVyQ",
                "author": "Kit T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The omakase was amazing (8 or 9 courses of deliciousness, I stopped counting after 4 courses).  The fish was sublime and fresh.  A couple of courses were ordinary (miso soup, sushi) but the rest of the courses more than made up for this, very creative and different.\nMojito's are very good (I had Pear & cinnamon).\nTip- do not turn up late if you're ordering the omakase.  They are heavily booked and hence very strict with their two hour seatings.  Due to a mix-up I was 25 minutes late and the last few courses felt a little rushed.",
                "datePublished": "2011-11-09"
            },
            {
                "reviewId": "Asr9Ugl1NYKkTMRbhTqaEA",
                "author": "Yoshiko M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "4 stars for food, 3 starts for service & ambience. \nThey offered 2 Tasting Menus: One traditional and another contemporary.\nI am glad that each of us had the different one and shared everything.\nEvery dish was FANTASTIC: Well-prepared and gratifying.\nWhat was missing was a bit of creativity, which compensated \nREALLY WELL with traditional side of Japanese cuisine. \nThe service and ambience were medium scale restaurant level:\nLimited-attentiveness, extremely casual & loud crowds with \nNordstrom department-food-court decor. \nSince I enjoyed the Tasting Menu dishes, I do not mind trying their \nNY and Tokyo locations.",
                "datePublished": "2011-01-21"
            },
            {
                "reviewId": "IP6EIwOinOlXFUHAyYv5xQ",
                "author": "Pascal P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I LOVE Nobu, I have been to 4 locations and plan to go to many more. The highlights\nYellowtail Sashimi with Jalapeno- amazing\ntoro sashimi with wasabi sauce(not sure of the name)- thought that i had ordered something else(different menus at different nobus) it was amazing... we ordered another order of it.",
                "datePublished": "2011-11-26"
            },
            {
                "reviewId": "6XQ1ptmUdkWnUsDFkqPdmQ",
                "author": "Scott T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Nothing more can be said about this place then hasn't been said.  Great meal, I brought a party of 6 here and let the waitress just keep bringing us food, nothing was bad, it was all outstanding!",
                "datePublished": "2013-10-14"
            },
            {
                "reviewId": "hYHlkIibghmVfjJsuqk2iQ",
                "author": "Andrew M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Bottom-line-up-front: it's very solid japanese seafood, but the hype is so overbearing it crushes the place. The surroundings are... not my scene.\nThe vibe is basically that of any of the major Asian carriers' business-class lounges at LAX, but with more 60 year old men with 23 year old women.\nThe waiters are knowledgeable, and the menu is fairly impressive.\nAdvice: stick with the specialty cooked dishes, the sushi is nothing special. trust your waiter. get a view of the people, not the park - the former are infinitely more entertaining.",
                "datePublished": "2011-06-08"
            },
            {
                "reviewId": "K-tiqwAYJ4kq5HlgLUcDyQ",
                "author": "Morgan K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I want to take Nobu behind the middle school and get it pregnant, thats how much I like it. \nThis restaurant is without a doubt my favorite place to eat and drink. It brings japanese fusion and cocktails to a new level that make me feel that other food just isn't worth eating if it isn't as great as the level that Nobu takes cuisine to. \nI had a japanese mojito as recommended by the waitress, it was a mojito with a hint of vanilla, which turned out to be an absolute gold mine. \nMy friends who I went with has been to every location of Nobu's now and did all of the ordering, so I couldn't tell you exactly which dishes to order, however I doubt that you could go wrong. I recommend the flash fried shrimp and any of the fish dishes. \nIt is rather expensive, but I would dare to say worth the money if your wallet is big enough.",
                "datePublished": "2011-05-02"
            },
            {
                "reviewId": "-tTHpWeepcfjwMM5Jc5R4w",
                "author": "Brian L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "My favorite restaurant in London especially for special events.  Recently my wife and I brought my brother, sister-in-law, niece and wife's best friend from the US to Nobu.  We each ordered one of the omakase tasting menus.  The food was outstanding.  The black cod is the best I've had anywhere in the world including Japan.  You must try this wonderful gem of a restaurant.",
                "datePublished": "2014-06-29"
            },
            {
                "reviewId": "Pr3lyOdX1DSZ-SOnq8zXwA",
                "author": "David C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "It's only taken me 13 years to get around to eating at this eponymous eatery. Not knowing the lay of the land, while strolling in from the rain it's hard not to think when you check in your coat on the ground floor, whether that cloakroom was 'the place' that Boris Becker had his 'moment of madness'. But stroll up the stairwell and you're greeted by (for the most part) uber efficient front of house staff in a light and airy dining room with large windows that provide a panoramic view of Park Lane. Not my favourite part of town, and certainly not as convenient location wise for me, per se.\nI'm gonna say it, but wasn't keen on the somewhat unnecessarily loud 'nameste' style greeting that is chanted to you by staff when you enter the actual dining area. Because ultimately that means you have to hear it many more times after you're seated! \nWe sat at a window banquette and like Berkeley Street, the tables are SMALL! Food wise for me the tempura while expensive remains a must (a perfect case in point that quality over quantity wins the day). And my spicy garlic vegetable Donburi was extremely delicious and generous (I almost finished it all). \nAlthough you can't help but think, despite the Michelin star, at the end of the day, my meal format at a linear level was akin to an (admittedly) upscale Wagamama Yasai Cha Han, right down to the sides of Miso soup and plate of pickles (or maybe Waga's is copying Nobu?) \nMy friend's Bento Box though was in a class of its own, both in presentation and the vast array of foods on offer including the signature black cod. She also ordered her favourite drink, a watermelon Martini (which you won't find in a Wagas!), which she swears by. I opted for a more pedestrian Diet Coke and tap water, because let's be honest the Fijian mineral water they serve is a rip off and pure marketing hype. The carbon footprint must be horrendous.\nThe dining room was busy, but I reckon you could have walked in without a reservation. Times are hard, it seems, even for Nobu. I'd be tempted to go there for a (special) dinner date, but for lunch I'd probably stick to Berkeley Street.",
                "datePublished": "2011-10-26"
            },
            {
                "reviewId": "9hl2mlpVB0A6UmUaQHbtzw",
                "author": "CAScuba Y.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Our experience @ Nobu London was pretty disaster.  Don't worry about Nobu London, there are better high end sushi restaurants in London.  Just look at the picture I uploaded, the sashimi was pretty unappetite, the toro are fat toro but it wasn't a very nice piece and presentation was just so so.  I had been to other Nobu & Matsushiha in Beverly Hills, by comparions Nobu London was a disaster.  Services was ok, it was very slow and under attended during our visit but it doesn't bother me too much since I am very busy checking out all the high fashion people.   Seen and be seen is the only positive star I can think of.   Don't worry about the bill, it's expected you are weathly to dine there, 100 pounds per head minimum, we wasted closed to 300 pounds for 2 there and I wasn't rich, it was a mistake !\nBTW, how come only people from the US write about Nobu London, no one from London writes about them.  Either they know it's a place to avoid or this place is really a trap for tourist ... especially from the US of A.\n:-)",
                "datePublished": "2009-03-18"
            },
            {
                "reviewId": "JBqcEt62rRRs_FHwOn-sMg",
                "author": "Zac H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "We had a great experience, which was defined above all by the food. We loved every dish, full of subtle flavours and presented beautifully. It's certainly not cheap - £80 for the 'set meal' (before the pricey drinks), but they can charge this because they make the food like pieces of artwork.\nWhilst I'd prefer to give the restaurant 90% rather than 100% (the food was mainly fantastic, but a couple of dishes were only 'really good'), giving an 80% would seem unfair. This is clearly a place for foodies with a sense of style. I won't be back every week, or even every couple of months, but I will plan another visit at some point. It's a place for special occasions.\nService was good - polite and friendly. I know some have said the service is mediocre or poor, but we were very happy with the attention we received. The ambience was classy, but not romantic. There was a bit of a buzz, a bit of a vibe, and it felt good to be sitting by a window looking out towards Hyde Park. I bet it would be even better on a summer evening at dusk. \nOverall, I've given a 5 out of 5, as it's the best dining experience I've had in a long time. I'd highly recommend for those looking for something a bit special.",
                "datePublished": "2011-01-12"
            },
            {
                "reviewId": "h3Nq4zUVKz0Ull-NI-UPbw",
                "author": "Qype User\n sebast…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I used to work in Ubon by Nobu in canary warf so i've had plenty of opportunity to taste the food and i recently came back to London so i've tried this Nobu and the food and cocktails are just great. My Highlights are:\nYellowtail sashimi with Jalapeno, Rock shrimp tempura, Beef Toban, Black cod, Pan fried dover sole with shizo salsa and the chocolate bento box Loads of other dishes are amazing too, it's pricy but worth it for such a culinary art!",
                "datePublished": "2011-12-26"
            },
            {
                "reviewId": "yebDquoWZGsmNQS2hExudA",
                "author": "Jon W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Disappointed. This is a great brand and the Honolulu location blew me away twice last year. It could be the crowd, the new staff or both. The food is fine, but the service has slipped a bit and it's not because of lack of people. There were plenty of them standing around.  It just doesn't have the energy it used to or of the other locations. Nobu, this one needs some attention.",
                "datePublished": "2013-06-03"
            },
            {
                "reviewId": "WbrB6AGV8J1_7OdN21aTQw",
                "author": "Qype User\n Eman…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Master Nobu, you are the best. I love the place. yes, it is expensive and some dishes are really a little too steep but the place is worth it, if you like fusion Japanese food.\n I have had the chance of experiencing Nobu in London, Tokyo and Los Angeles (Matsuhisa). They are both excellent and have the same menu. My favorite by far is the LA one as the croud is far less \"wannabe\" than the London Met Hotel one.\n Nobu Matsuhisa is a really creative chef and the must tries in my eyes are: black cod with miso, the new style sashimi, Sashimi Salad with Matsuhisa Dressing, Yellowtail Sashimi with Jalapeno, Rock Shrimp Tempura with Creamy Spicy Sauce, any tempura (avocado and sweet potato are my favorites), Beef Toban Yaki... and of course the very very good sake!\n One of my favorite restaurants in the world.",
                "datePublished": "2010-11-14"
            },
            {
                "reviewId": "M_s2SLODs0RyBQNYzxxirQ",
                "author": "Qype User\n mattni…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I was attracted to try Nobu for the first time because..I like Robert de Niro\n(such an admirable actor) and also because i love Japanese cuisine! Heard so many good words about it , that had to try it myself- and i wasn't disappointed! its superb, in any aspect -the location, the service, the atmosphere, the diners, and of course  the food! The flavours, the variety, the authentic scents and spices , made me feel as if I'm at the heart Tokyo, in one of the finest restaurants there. Magnificent and very rewarding dining experience  the only thing that could have topped it up was seeing Robert de Niro in the flesh",
                "datePublished": "2012-02-06"
            }
        ]
    },
    "80": {
        "id": "o3grccDotDNXbANk7rKZXA",
        "name": "Nobu",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Mayfair",
            "streetAddress": "19 Old Park Lane\nLondon W1K 1LB\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/gKB5lZhcifPSu0XrR5q1Cw/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7447 4747",
        "review": [
            {
                "reviewId": "ovbiyN9XSojkADZkvf9ZBQ",
                "author": "Selina H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I do not think they provide sushi in good quality especially compared with Japan. And it's a bit noisy at night. The sauce and ginger are too salty to eat with sushi. Not A good choice considering its price.",
                "datePublished": "2013-12-21"
            },
            {
                "reviewId": "ZtoTnkoqDxwp6tfvD7CngQ",
                "author": "Susan Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I was here in Jan 2011 so this review is based on my visit then.  \nGreat quality, great service, Although the lights were a little bright.  \nThis one is much better than Nobu Berkeley by far and one of the better Nobu restaurants (compared to Honolulu, Malibu that were good but not worth the extra cash)",
                "datePublished": "2011-03-31"
            },
            {
                "reviewId": "YOVdJ2RrCh9PDNWTwmyHdQ",
                "author": "Colin K.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Pretentious, overpriced \"japanese\" food. I mean seriously, black cod with miso for 42 quid!? You can get this dish in most family style japanese restaurant for MUCH less. The fish here is supplied by Atari- Ya in Bond street, which has some of the cheapest sushi/sashimi to be had in London, so here they decide to pretty much destroy the natural flavour of the raw fish by adding all sorts of crazy sauces... (easy way to cover up if the fish isnt the freshest)\n\"Chocolate Bento Box\" is basically the most widely available american dessert-chocolate lava cake. Its put into a bento box with green tea ice cream... pretty much tastes like every other lava cake out there.\nSave your money and go somewhere else.... ANYWHERE else. You wont see any japanese go anywhere near Nobu, with good reason.",
                "datePublished": "2012-10-28"
            },
            {
                "reviewId": "XFDwJ13pLO5dAB1ZQCO-0w",
                "author": "Qype User\n antiso…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I've never been much of a 'fine diner'. My long-term boyfriend is an ex-chef for Gordon Ramsay so often I get Michelin-star food in the comfort of my own home which is a lovely bonus! However, for my 21st birthday my family took us to Nobu - a restaurant I have lusted after (and hinted to my boyfriend about!) for many years.\n The atmosphere is lively and fairly casual which wasn't what I was expecting but it made the whole experience much more enjoyable as we were all chatting and laughing without any evil glares from the richer patrons.\n The food, needless to say, was absolutely divine - my favourite dishes which I recommend to EVERYONE are: Yellowtail Tuna Tataki with jalapenos, beef sashimi, wagyu beef, shrimp tempura, black code with miso and Choclate Bento Box to finish. Don't be swayed by anything else on the lengthy dessert menu - I had to send back to Mexican Chocolate Cake as I had massive food envy after seeing my mother and sisters Bento boxes! The food comes all at once and they make it really easy to share dishes (we had plates passing around all 5 of us all evening long) and it's better that way as you get to taste a little bit of everything.\n Impeccable service, lovely cocktails, great ambience - if I was a millionaire I'd dine here everyday!",
                "datePublished": "2011-02-01"
            },
            {
                "reviewId": "G9LXxZ52NWkgwD0CaucQIQ",
                "author": "Rick S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Good -- not great quality. Very Expensive. Beware.",
                "datePublished": "2012-06-26"
            },
            {
                "reviewId": "uMBjpZUMqGAChIdAe6gv_A",
                "author": "Andi C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "5 stars for food, 4 stars for ambience, and 4 stars for service.   My companions and I had some wonderful food, I initially liked the Namaste greeting but then it got old as I had to hear it a lot during my meal.  Theu had cheap wooden chopsticks that you get at any chinese takeaway and had to break up on your own and get wood splinters, c'mon Nobu...I would cut you some slack if I went there for lunch but this is dinner.  I asked for real chopsticks and received a puzzled look.  My friend asked for a black cloth napkin as she had black slacks on, again..another bewildering look from servers.  All that being said, the food was wonderful.  We shared some sushi rolls for appys, I had tempura, yum. My friend raved about the black cod.  The desert selection was incredible and artistically served.  Oh, and the cocktails were delicious too although could have been stronger.  All in all a wonderful dining experience.  :)\nGetting a 4 because Nobu Las Vegas was better.  You should still check this out :)",
                "datePublished": "2012-06-07"
            },
            {
                "reviewId": "qi6ImfGwBaLZKNPdojp16Q",
                "author": "John R.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Good sushi but overpriced.  Certainly not worth going to if you're visiting and live somewhere where you can get quality sushi anytime.",
                "datePublished": "2013-03-22"
            },
            {
                "reviewId": "BqtE6bw79wuG4FXOsktPrQ",
                "author": "Agi K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Of the two Nobu's in London I prefer this one for the dining experience.\nThe bottom line (lets get this out of the way) .....Yes it is pricey... Whooohooo yes sir it is. But I say worth it.\nNow unless you are well off enough to eat here on a regular basis without needing to re-mortgage (good luck in this economy) this is ideal for special occasions for the hoi polloi....anniversaries...dates.... celebrations etc\nOf the four times I have been the food has been spot on. I have always left sated and glad to have been. You cannot ask for more.",
                "datePublished": "2010-02-28"
            },
            {
                "reviewId": "1Y6WrS_rinVCW3BsiIBrqg",
                "author": "Haley F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Back in California i would have a craving for sushi about once a week. funny enough though, at my favorite Japanese places, i would always stray more towards the other dishes, because  they would just be amazing.\nsuch was the case with Nobu. yes the sushi was amazing. fresh, tasteful, gorgeous, all that. but it was the other plates that blew me away. they had this deep fried full fish thing.... holy hell. it was filleted, so the meat was sitting directly in the sauce (the sauce.... hmmm... in my world, everything is just a vehicle for the sauce....) and the bones were fried so you could actually eat them like a crunchy snack. i was skeptical, but it was amazing.\nfunny enough, the food isnt as pricey as it could have been. i'll tell you what gets you: its the cocktails that bump up the bill. amazing drink list. and the servers just know when to show up at your elbow and say \"would you like another?\" and of course you would, if you *should* or not. \nmy one issue: the decor and space felt very... lacking? cold? corporate? it needed something. yes i know its in a hotel, but really do we need to be reminded of it? at a place like this, the whole thing should be an experience. a change to get away from the ordinary.\nbut anywho. still...\nsigh.\nnobu. till we meet again.",
                "datePublished": "2009-08-29"
            },
            {
                "reviewId": "Fe18W5LUyddkmZ53e8rXYw",
                "author": "Qype User\n SofiaF…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Sometimes the seafood gives a strange feeling in my mouth. But the sushi there is simply delicious. I like the variety of food in this restaurant and I'm planning to go there soon.",
                "datePublished": "2013-06-18"
            },
            {
                "reviewId": "ZhlN9SOGMHqGiHxi1dJZqg",
                "author": "Tracey W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "For first class delicious Japanese cuisine this takes some beating. this is where to bring someone you want to impress-the food and service is excellent and the desserts to die for.",
                "datePublished": "2012-08-04"
            },
            {
                "reviewId": "0RxgG2c1TZaNcdkJFB_haA",
                "author": "Michael P.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Excellent tempura and black bean Dover sole\nFood was good but Service was not very good\nSushi came out incorrect but they fixed it\nOne meal came out more than five minutes after the other two meals",
                "datePublished": "2010-07-02"
            },
            {
                "reviewId": "ry_k-TXKby9Hhw8SKb4pbQ",
                "author": "Lindsay D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I have been to several branches of Nobu and the Mayfair location is my absolute favo(u)rite.\nMy mom and I went and sat at the sushi bar. We ordered the chef's sushi dinner and plenty of saketinis. Everything was fabulous. The fish was as fresh as what I ate in Japan and everything was seasoned perfectly. Coincidentally, this was also my first Nobu experience. Maybe the sentimentality is tainting my perception... Haha.",
                "datePublished": "2009-06-05"
            },
            {
                "reviewId": "0TmaV64fmcC9LZr0PIUDHQ",
                "author": "Qype User\n Soraya…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Always superb and special. Its the elegant high end side of sushi but as a sushi addict, if I could afford to eat here every day I would. cant remember when I 1st went- many moons ago, but if you want to treat someone special (if any of my friends read this review take note!!) then you cant go wrong with Nobu xx",
                "datePublished": "2012-08-30"
            },
            {
                "reviewId": "r8emf_PQlSZYpLCBlWP9FA",
                "author": "Foodie N.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Sure, Nobu has great sushi - super fresh, good variety, but you don't come to Nobu to eat sushi. You go to have his superb Peruvian-Japanese inspired dishes. The famous black cod with miso is famous for a reason - it's really good. Soft, light, flaky cod smothered in salty, earthy miso paste satisfies that part of you that can never get full from eating raw fish. Another stand out dish is the seared kobe steak, seared rare, with some delicious alcohol-based sauce. The fat from the steak is for sure an artery clogger, but it almost melts in your mouth. Very, very tasty.\nThe decor leaves something to be desired - it's rather plain, but then almost all Nobu restaurants are rather plain. It's perhaps a nod to the zen-like simplicity of Japanese decor, and almost a reminder to focus on your food.",
                "datePublished": "2010-05-18"
            },
            {
                "reviewId": "HhAnNnQ6rQRNcteovab09A",
                "author": "Don M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Not a meal for the sustainably minded, that's for sure. Only the popular fish get any attention at this celebrity luncheon spot. And wow this place is expensive! (£60pp for lunch). I will say that the food and drinks were really nice. The bar serves a surprisingly subtle bloody Mary with wasabi and tankatsu sauce. I'll definitely be making this one at home, so thanks for the inspiration! \nSadly I couldn't justify spending £32 for their signature black cod with miso. Instead I had a Latin spiced ribeye over rice, which was a delightfully spicy riff on the Japanese meat over rice dishes like katsudon and unagidon. On the more traditional end, my lady had the prixe-fixe sushi lunch, which featured only the highest quality designer fish (like bluefin and wild salmon). The hand rolled maki (the lady called them Japanese tacos) were particularly delicious. \nThe low point for me was cultural... while the excellent service made me feel like I was getting my money's worth, it's make me wiggle when all the servers yell \"irashaimase\" when customers walk in and there's not a Japanese soul in sight.",
                "datePublished": "2010-01-13"
            },
            {
                "reviewId": "sRb6N_oXqnKMFMW2LyUAcw",
                "author": "Dan G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I've been to Nobu in NYC and Vegas and decided on this location, which my wife told me was \"less of a scene\" than the other London location. I love the food here. Fresh, light, creative and spicy. \nWe started with some sushi, which is always excellent here. We had spicy tuna and a California roll. It was as good as sushi can be in my book. We then chose a selection of small plates as we always do, instead of going with the larger entree portion. Grilled Asparagus with spicy salsa was an exciting opener. The always delectable rock shrimp in vinegary Ponzu sauce followed and reinforced its claim as the best selection at Nobu. Squid \"pasta\" with asparagus and shitake mushrooms in an oyster sauce has become another dependable selection that we enjoyed. Our last small dish was Peruvian Spicy Chicken skewers, which brought the heat. The staff was helpful with our wine selection and we went with a nice fruity white that balanced the heat of our dishes nicely. They also kept the wine flow perfectly measured with our meal. and it lasted for our entire dinner. We finished with the Fuji apple, which we enjoyed very much. \nAlways the scene, this Nobu location did not disappoint either. There were certainly a few very large tables of glitterati and scenesters and I have never seen dresses and skirts like that outside of Vegas. However, my wife and I were able to have a delicious meal and had no problem hearing each other or being too crowded. \nThe one thing I don't get is what is up with the bar. We arrived on time for our reservation and although the restaurant had just opened and was empty, we were shuffled off to their bar/lounge. I'm here for dinner and am going to put away at least one bottle of wine easy. I guess if cocktails are your thing this probably wouldn't bother you, but I looked at it as a delaying annoyance of padding the bill with overpriced drinks. My wife and I always get a kick out of places that are part club and part restaurant. As the saying goes \"a jack of all trades is a master of none.\" \nThat said, I was here to eat and it lived up to every great memory I have had of dining at Nobu. Excellent food and impeccable service. Enjoy.",
                "datePublished": "2009-06-07"
            },
            {
                "reviewId": "URdAYRGGmLilKUz31YTj1g",
                "author": "Amme P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Yummy yummy yummy!!!!   I am so much more a fan of this location of Nobu than Barkeley Square.  Everything I tried was absolutely delicious.  This was the first time eating in Nobu that I did not go heavy on the sushi, and I was blown away!!!",
                "datePublished": "2011-04-06"
            },
            {
                "reviewId": "VLWockVfJa5qILUrePiQVw",
                "author": "Chloe J.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "If you have the money, and you want some good sushi, go to Nobu. It's nothing particularly special and the atmosphere is casual and relaxed.\nPS- Always go to Nobu Berkeley, not this one.",
                "datePublished": "2009-03-22"
            },
            {
                "reviewId": "N_2kYFNI8Vvtrf0eBvu8bg",
                "author": "Atticus F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I rate it a 4 for the generous serving and authentic taste. Though to be honest, I appreciated the quality/flavors of the Japanese food I had at another Japanese restaurant of less prestige called Miyama on Clarges Street.",
                "datePublished": "2012-09-07"
            }
        ]
    },
    "100": {
        "id": "o3grccDotDNXbANk7rKZXA",
        "name": "Nobu",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Mayfair",
            "streetAddress": "19 Old Park Lane\nLondon W1K 1LB\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/gKB5lZhcifPSu0XrR5q1Cw/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7447 4747",
        "review": [
            {
                "reviewId": "aEvQnx3BEPp-KJZhIENn6A",
                "author": "Qype User\n saraba…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Went there with two friends, for lunch they have the set menu for 26 quid. I was really courious because it's such a famous place, it has to be THE BEST.\nWe tried the luncheon menu with beef in wasabi sauce, a mixed sushi and sashimi lunch and their signature dish, highly recomended by the waitress: the balck cod everithing with the sake tasting.\nThe food is really good, fresh, amazing flavours.\nThe cod was surprisingly delicious, perfectly cooked and with a lovely subtle sweet flavour.\nI have to say NOBU has god a way with dressing sauces, everithing was so well balanced and delicious, even the salad dressing (we've been told that's made with 10 ingredients, the main 3 are onions, black pepper and japanese mustard).\nThe beef was perfectly cooked and the wasabi sauce simply delicious.\nAnd I'm still thinking about the mouthwatering of the tuna.... sooooo good.\nThen we tried a bento chocolate box wich is practically a choccolate souffle', served warm with green tea ice cream on the side.\nThe souffle' was perfect, light and crunchy outside with a warm creamy heart. And the ice cream itself was really nice, gentle taste.\nBut the match of them wasn't right for me, the ice cream is just too delicate for the choccolate flavour. It's just not right, the ice cream disappear on your mouth leaving only a cold sensation when you eat the two ingredient together.\nThe staff is really nice, our waitress has been very helpful.\nStill I didn't like that they cleaned the plates away without asking if we were done (they took away the salad I was slowly enjoying on the side of everything else).\nThey gave us the wrong beef at the beginning, and even if everything was really good, I definitely have to say that is overpriced. It's true you're in central London and you're overlooking hide park but this is not a good reason to let me pay 32 quid for a portion of cod!!\nA special mention for the toilet which are pretty small (specially because are shared with the meetings room on the 1st floor, but I find amazing the special make up side with armchairs, white light and mirrors to retouch your make up.\nStill I think whenever I want to eat great japanese food I'll go back to TOSA in chiswick, same level of quality for half the price.",
                "datePublished": "2010-03-18"
            },
            {
                "reviewId": "iJRQ3AVX1OpO10HYFoVJcQ",
                "author": "Qype User\n contes…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Have eaten at Nobu quite often and have to say that it is unfailingly excellent if horribly expensive...the portions are tiny so you'll end up ordering quite a few dishes and spend more than you meant to but as with everything in life............ you get what you pay for.\n Try to aviod ordering the things you are familiar with and stray from the beaten track....the wait staff are delighted to oblige....the pork belly was just incredible...cooked perfectly with the fat melting into the meat...also love love love the tempura, light as a feather....\n It's not just about the food, the atmosphere always good with an expectant air of A list spotting never too far away....appropriate attire for a night out for a girl is tight jeans...sky scraper heels and a sparkly/sexy top.....which will take you nicely down to the Met Bar for a cocktail and a bop.",
                "datePublished": "2009-11-18"
            },
            {
                "reviewId": "NXcHbASrOChqECxy8ZMxUA",
                "author": "Andrea C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Nobu is definitely one of the best restaurants I have been lucky enough to try in London. Although just some of the full height windows benefit of the view on Hide Park, the inside environment is intriguing and pleasant; the designer managed to mix a contemporary-fashion style preserving a easily perceivable Japanese influence. While waiting to be seated at the table, one can enjoy a cold glass of champagne in the comfortable love-seats in the waiting area. Wine list absolutely remarkable although the waiters tend to pour too much wine in a single time. Had delicious fresh filleted tuna and desserts but what absolutely stood out was the black cod. Apart from the exquisite taste, smoked at the right point, it literally melts in your mouth. The black cod is definitely the reason that makes me want to be back. One caveat: when one walks through the glass doors of The Metropolitan Hotel, he has to be aware that his dinner will most likely be very expensive. However, Nobu fully deserves both its Michelin star and the price paid for some of the plates.",
                "datePublished": "2014-02-08"
            },
            {
                "reviewId": "g6S-kY8zKwV10i57dyGmog",
                "author": "Jason D.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Went there one night on our vacation last week. The restaurant was around the corner from our hotel. I have been to numerous nobu restaurants and i can't believe that this is a nobu. are all the other reviewers blind to the decor. half the experience of a restaurant is the experience and ambiance. this truly looks like a cafeteria. there is literally nothing on the walls, the tables and chairs are pine and there is zero ambiance...zero. the food was fine, but for the price...no way! i can't believe chef is putting his name on this restaurant. don't go.",
                "datePublished": "2014-07-08"
            },
            {
                "reviewId": "rsaTQhjtplU4LWvF46p_iw",
                "author": "Qype User\n rudgej…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Discovered the place only last week. Sushi was excellent quality and my girlfriend was in love with the dessert. Very chic atmosphere. Great for once in a month treat.",
                "datePublished": "2012-08-27"
            },
            {
                "reviewId": "Vz_SN0NAfL7tPVfnbw3Kgw",
                "author": "Lily O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "doesn't top the NYC Nobu but does a good job of serving fabulous sushi in London\nthe scene was much more tacky/trashy at this one than I've ever seen in any of the NY locations, but think this is a function of the Eastern European / Middle Eastern focused wealth in London. \nrisk: too much mink with your sushi\nreward: delicious Nobu staples across the pond",
                "datePublished": "2011-03-14"
            },
            {
                "reviewId": "YKqfuBSnOl9oHFaHrvLY-g",
                "author": "Samuel M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Extremely expensive, more expensive than America. Cool ambiance. Good service, good attitude, beautiful sighteseeing, a view to Hyde Park.  It was the most expensive almost 400 pounds for two. Around 8 plates and a bottle of wine.",
                "datePublished": "2011-04-19"
            },
            {
                "reviewId": "yk6p2xKYRnlvyjvMnwRcDw",
                "author": "laura f.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "4.5 stars. really - it was quite excellent.\nwe had the steak starter, a bamboo with chilled sake, king crab claw, scallops in spicy sauce, tempura roll, and i'm totally forgetting what else.\neverything was so good. the steak was amazing - i literally wanted to lick the plate but then i remembered where i was (oops, silly american..). the three of us couldn't get over the tastes and how fresh everything was. \ndefinitely make reservations so you don't have to wait. i'd totally go back - except i'm 5400 miles away. ;)",
                "datePublished": "2011-03-16"
            },
            {
                "reviewId": "rPmS1QdVM6-zVDvbkNANpA",
                "author": "Hiro S.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "My experience here was nothing spectacular unfortunately.  Being sushi snob myself and having visited other Nobu locations (NY, LA, etc.) many times, I had to say this place did not meet my expectations.\nI don't usually order stuff from regular menu and it works just fine at other Nobu locations, but the server here had no idea what I was trying to order.  I asked to speak to one of the Japanese chefs and the issue was immediately solved.  Still the sushi I had was nothing special.\nConsidering the price I paid, I had way better experience at Zuma for sure...",
                "datePublished": "2009-02-16"
            },
            {
                "reviewId": "pysk5992ECS_si5HFdVrnw",
                "author": "Tim W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I was glad I stopped here for dinner after s long walk about in London. I was hot, tired and hungry. Unfortunately, their air conditioning was not quite up to par. I sat at the sushi bar and had a gat conversation with the Japanese young lady who served me. The sushi was fresh albeit small for my standards. The restaurant was busy and the staff professional and very friendly. Pricey but in line with their quality and level of staff.",
                "datePublished": "2011-06-27"
            },
            {
                "reviewId": "QIeExLBVvmBNN7QZ76khrw",
                "author": "Tommy E.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "No better sushi ... perhaps my best meals ever are eaten here.",
                "datePublished": "2011-06-06"
            },
            {
                "reviewId": "gl1iN-G0Fqwd84V0yCsA4A",
                "author": "Digby L.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "This was fantastic. 20 year ago. Now it's seriously overcrowded, the staff think they are too cool to be even remotely polite to non-celebs and the food is not a patch on the much better Nobu Berkeley (the one where the celebs actually go). Thank God I'm teetotal so it was just irritatingly expensive rather than really annoying.",
                "datePublished": "2010-09-21"
            },
            {
                "reviewId": "BX0hS6ZpXVR2YpzbfrupbQ",
                "author": "Qype User\n Mel…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Took my 11 Y/O daughter for diner on Friday evening and managed to get a table without a reservation.\n She's a real sushi lover so we wanted to try what is supposed to be the best and yes, it was very good. Everything tasted very freeh and the flavours were very crisp, but 200 quid for two of us, it ain't worth that!\n I will go back but not as often as I would have done if it didn't suffer from quite as much of the London hype as it does.",
                "datePublished": "2009-09-20"
            },
            {
                "reviewId": "5YZP5w6VTARUYXzGy5kxYw",
                "author": "Qype User\n Sophie…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I love the Nobu I will miss it when I will leave London even if it will be a good thing for my economy.I did not see any celebrities but the food is so goooooood!! The best sushi and fresh food. \nNice bar also and perfect sushi bar",
                "datePublished": "2009-05-05"
            },
            {
                "reviewId": "VSa4a5UaRbPuuVZ5URXzPA",
                "author": "Alan S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I went to Nobu a few months ago for lunch with a friend, and we had a lovely experience. We had a seat by the window overlooking Hyde Park, and it was a nice sunny day.\nWe had 3 dishes, some sushi/sashimi, dessert, and a couple of drinks each. The 3 dishes we ordered were - shrimp and lobster with spicy lemon sauce, pan fried dover sole with red chilli salsa, seafood toban yaki. We also ordered a selecton of sashimi - yellowtail, salmon, sea bream, mackerel, sweet shrimp. For dessert, we both had the chocolate bento box. I had a couple of mojitos with the meal, and my friend had a raspberry cooler.\nShrimp & lobster with spicy lemon sauce - A salad of fresh leaves and enoki mushrooms, topped with shrimp and chunky lobster pieces, and a tangy lemon sauce. The dish wasn't swimming in sauce, but there was enough to coat everything and it helped to lift the flavours of the shrimp and lobster. This was a perfect way to start the meal, as my tastebuds were now tingling.\nPan fried dover sole with red chilli salsa - this came out next, and I was blown away by the presentation. There were 4 fillets of fish, on a frosted glass plate, swimming in a red chilli salsa, and right in the middle, was the head and backbone of the fish, deep fried and curled up into a \"C\" shape, with the tail suspended in mid-air. The fish was nice and fresh, and again, the sauce was very tasty. Not overpoweringly spicy, but enough to make my tastebuds tingle. We wiped the plate clean.\nSeafood \"toban\" yaki - this came out last, and I am glad they left it til the end. It was basically a flat claypot with a lid (the \"toban\"), and when you opened it, the aroma that came out was unbelievable. It had a lovely savoury, vinegary smell, and inside the toban were clams, shrimp, fish, swimming in a lovely soy/vinegar sauce. The seafood was firm and fresh, and the sauce was the best of the 3 dishes. It was so good, for the remainder of the meal, I kept stopping to savour the smell as other tables had their \"toban\" yaki delivered to them. I really enjoyed this dish.\nThe sashimi came out next, and by comparison, the \"wow\" factor wasn't there, compared with the previous 3 dishes. The fish was definitely of good quality, but I suppose there wasn't much difference between Nobu's sashimi and other places I've been to (e.g. Inaho, Yoshino). As before, the fish was firm and fresh, but the sweet shrimp was slightly slimy. \nTo finish, we had the chocolate bento box, and it was a chocolate fondant with a scoop of green tea ice cream in a bento box. The fondant itself was good, nice and warm with a lovely gooey, liquid centre. The ice cream was the best green tea ice cream I've had, it had a lovely deep smokey green tea flavour. A good way to end the meal.\nI also had the vanilla and apple mojito, and the pear and cinnamon mojito. I enjoyed both, and preferred the apple over the pear, as the apple flavour was more distinct, compared with the pear. The glasses were quite generous, and the vodka was nice and strong.\nThe meal ended up costing over £200, which is quite expensive. I would definitely recommend their special dishes, but wouldn't necessarily go back for the sashimi, as you can get similar quality sashimi at other top japanese restaurants. Worth going to for a treat.",
                "datePublished": "2010-08-29"
            },
            {
                "reviewId": "mNiDuywbPbx_La6xKZshgg",
                "author": "Qype User\n Charli…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "It was our initial visit. Having spoke to good friends and examining the testimonials we had been quit eager for dining here. The service was extremely fine. Very attentive. The climate was satisfied yet inviting.They're going the extra distance to be certain their guests are content.This was the most amazing plate That i've ever had!I strongly recommend this restaurant for anyone who loves foodstuff. Very accomodating staff, and always there when you wish them.\nThe sushi chefs are fantastic and just serve the freshest sea food. I've recommended this restaurant to a lot of, lots of individuals and none have already been dissatisfied!!",
                "datePublished": "2011-11-01"
            },
            {
                "reviewId": "Z_hgg3_yj7_M5U2tMNgriw",
                "author": "Angelica C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is home away from home for me. The service is excellent, you're taken care of from the moment you enter the restaurant until you leave. Everything is delicious and made with the freshest and highest quality ingredients. You have to get the yellowtail sashimi with jalepeno, tuna tataki with ponzu, rock shrimp tempura with creamy spicy sauce, black cod with miso, and the chocolate bento box which is flourless chocolate lava cake with green tea ice cream. These items are just a few of my favorites, you can't go wrong with anything you order.",
                "datePublished": "2010-08-17"
            },
            {
                "reviewId": "KsNdQrqerHQlLh6C9G_jMw",
                "author": "Qype User\n shinyg…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I was lucky enough to be taken here for a corporate event, which meant a private room, someone else picking up the tab and the chance to try a bit of everything. All I can say is 'wow'. This is one place that lives up to the hype and (if it's possible) tops it. I'm not even a big fan of Japanese food, but you'd have to be mad not to love Nobu.\n I don't think you can go wrong no matter what you pick from the menu, but the famous black cod with miso lives up to its reputation, the yellowfin sashimi was absolutely outstanding, and the seared beef with spring onion and garlic chips left me speechless. I've never eaten so much raw or seared food in my life, but I am now completely converted.\n The staff were friendly, incredibly efficient and looked after us brilliantly, and I really can't fault the place for food and service.\n The main restaurant looked bustling and atmospheric from what I saw, with plenty of movers and shakers and an appearance from Kylie (or so the tramp outside told one of my fellow diners!)\n If you want a memorable dinner, this is definitely the place to go. Just bear in mind that everything you eat afterward will be a disappointment!",
                "datePublished": "2008-07-03"
            },
            {
                "reviewId": "fV7EeldPZX_6blIyciwt_g",
                "author": "Qype User\n m_…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I have been to both the Nobu restaurants in London, and this one is my favourite. The restaurant area is spacious, and the large windows all around one side provide a nice effect.\n As you would expect from a Nobu restaurant, the service is of a very high standard, and they really made me feel fussed over (I like that). We had various delicious dishes, and my favourite was definitely the black cod - that is my recommendation to anyone reading this review!\n I'm not at all interested in 'celebrity spotting', but for those of you that are, you are sure to spot some famous person or other in Nobu.",
                "datePublished": "2011-07-09"
            },
            {
                "reviewId": "j7JzaKZDtqvQ-wYe8xu31Q",
                "author": "Vaulte K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is the restaurant that changed the landscape forever. Japanese cuisine in London was almost non-existant and inedible 15 years ago and then Nobu came along and set the standard. It's still one of the best - simple, fresh and minimalist - not fussy. It's not 'fun' or particularly 'trendy' but it serves some of the highest quality sushi in the city. Ask them to deep fry the shrimp heads when you order amai ebi.",
                "datePublished": "2009-11-12"
            }
        ]
    }
}