{
    "0": {
        "id": "_2XoQQKE0AXHgmbONR-5mw",
        "name": "Bone Daddies",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Soho",
            "streetAddress": "30-31 Peter Street\nLondon W1F 0AR\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UUBXhkhhCHFeYv3HAB9ZoA/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7287 8581",
        "review": [
            {
                "reviewId": "axPVoiYKsNM5eFAzI8EHGw",
                "author": "Adrianna G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I've eaten lots of tonkotsu, and this one is great! It's a 20 hour stock, so yes, it is fatty. I would eat here all the time if I lived nearby. Really hit the spot after a day of travel and jet lag from NYC.  \nFriendly waiters, but it took a long time to order and pay the bill. Slow service seems to be the norm in Europe. \nThe fried chicken wasn't like karaage, though it doesn't claim to be on the menu. We still enjoyed it with the sauce. The yuzu margarita paired great with the tonkotsu.",
                "datePublished": "2018-09-26"
            },
            {
                "reviewId": "Rj_HgyE33WUj017QleT3zg",
                "author": "Bryant T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "My wife and I were in London as part of our London/Paris anniversary trip. We were craving some good asian cuisine, and she found this neat little Ramen shop. The ambiance is great. Rock n' Roll music and communal tables. We got seated at a couple of bar seats looking out the window. The menu was easy to read and we both opted for two ramens, a chicken kaarage appetizer and I ordered an Asahi Beer.\nAbout 10-15 minutes later, other folks that arrived after us started getting food, and we had not even received our beer or water. So after telling the staff, we got our drinks 3-5 minutes later. Then the food arrived and I had specifically asked if there was bean sprouts. He wasn't sure, so I said, okay, if there is, please put it on the side. \nGuess what I got in my ramen when it arrived? That's right, bean sprouts.  The food itself wasn't bad. Decent broth, plenty of noodles and meat. A bit too oily for my own taste, but oil in broth is individual preference.\nThen we wanted our check. I asked for it, and that alone took another 10 minutes. We waited and waited. I finally started to lose my patience and asked again, this time I told the waitress that we've had a pretty poor experience here. The manager came back with a fair discount and apologized for the experience. Apparently the original waiter was a trainee, which begs the question why wasn't he \"mentored\" by an experienced server. Anyways, the manager's response and sincerity saved this review from being a 1 star. I don't believe this is typical service, so I'd still recommend folks to try them out. Cheers!",
                "datePublished": "2018-06-20"
            },
            {
                "reviewId": "VbJQ_dabihafhFojdUDBnw",
                "author": "Christina C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I was in London for a few days and my coworker had recommended coming here, so we went for dinner. I probably wouldn't have found it if I were just wandering around.\nMy coworker had ordered the Padron Peppers for appetizer, which she shared. The peppers aren't spicy, but were flavorful. I think I ate quite a few.\nI think I ordered the Garlic Tantamen ramen. There was so much meat in it! I thought it was a little too oily for my liking. The oily broth was a little too rich. Otherwise, the broth was good.\nThe server we had needed deodorant. That was the only other turn-off about this place.",
                "datePublished": "2018-05-12"
            },
            {
                "reviewId": "cr-4xidJT8lTJRGuUCxrfg",
                "author": "Jacqueline C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Having lived in New York, I've been spoiled for unlimited delicious ramen options and my personal opinion is that Bone Daddies is overhyped.\nMy friend and I came on a weekday night and there was a long line outside the shop. They took in pairs faster than groups, so my friend and I were seated after ten minutes. The inside of the shop is dim and crowded. There are only stool seats and seating is pretty tight. \nMy friend and I got the Agedashi Tofu to start. This was pretty good! The portion was big and the tofu is silky with a light and crispy battered shell. The sauce was flavorful too. \nFor ramen, I got the Tonkotsu and my friend got the Mushroom Ramen. What I liked most from the Tonkotsu ramen were the egg and the black garlic oil. However, everything else was a bit overwhelming. The pork broth was advertised to be simmered for 20 hours but it wasn't all that flavorful and definitely too oily. The ramen noodles were very thin and way overcooked so it was quite mushy to eat. I also got to try some broth from my friend's mushroom ramen and it was pretty good. \nOverall, Bone Daddies was a little disappointing and I'll be continuing my search for the best ramen in London.",
                "datePublished": "2017-11-10"
            },
            {
                "reviewId": "zAo8dBmV7oWytNnTWnMsAA",
                "author": "Han L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Arriving in London and being sick really made me crave some hot broth. Also because I was traveling throughout Europe I was really craving Ramen. I looked up some Ramen restaurants and saw that Bone Daddies were spread throughout Central London and I was close to one. \nAs I entered the restaurant it was packed with people and I thought this was a good sign of the food prepared inside. I went in solo and because of this I think I was sometimes forgotten as other tables were getting their food before mine. In the end... the result was that they actually forgot to put my order in the kitchen, however I was compensated with extra chashu meat in my ramen. \nThe ramen broth did the trick and was very warming while I slurped the broth and dipped my noodles in it. The charting on the meat was also perfect as it gave an unique taste to the meat. The eggs were also boiled to a perfect runny Golden State which is usually a pivotal point of the ramen for me. Another good item that looked amazing is the Korean style ribs. Although I didn't order any the people next to me got them and they smelled and looked absolutely amazing.",
                "datePublished": "2017-12-06"
            },
            {
                "reviewId": "JbqocoTYp38DzswAZKRgfA",
                "author": "Alex B.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Biggest rip off ever. Who is paying off reviewers like Lonely Planet to put this in their books? Two smallish (based on previous ramen experiences) bowls of ramen: 32 pounds. Mine had a wafer thin slice of pork belly and a small piece of crab. The kale? One small shred. The extra bok choi (for an additional 1.5 pounds over the 14 pound base price)was 2 small limp leaves delivered late. Really? For 1.5 pounds? On the upside the service was sweet but still not worth it. There is just as good ramen at better value elsewhere.",
                "datePublished": "2018-10-05"
            },
            {
                "reviewId": "hKQup0Ifg4AYbcoZHGz8OQ",
                "author": "Alicia Y.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I'm guilty of not posting any review for Bone Daddies any sooner. I've been here many times and it's my go to Ramen place when I need a fix. I've been to this place since 2015. Bone Daddies has this really hip vibe, you'd think it's a cool bar but it's just really awesome how they made Ramen look cool. First of all, I've not been to a Ramen place that offers you bibs and hair ties (for ladies with long locks). That's really thoughtful. \nThe area is smaller than most restaurants. There's usually a queue outside, but the wait is about 15-20mins depending how crowded it is. Its a little noisy, so it's probably not great for intimate conversations. The place is cramp, so you'll find yourself squeezed between people. It's generally not a place to bring babies or kids. Absolutely great for couples and if you're lucky, you might get an entire table for larger groups. \nI usually order the T22 Ramen with Chicken scratchings. It's probably one of my favourite. If you're not into pork all that much, there's that option for you. There are a bunch of vegetarian options as well. So you'll be glad to find a variety. Today however we decided to try something else on the menu:\n1. Tonkotsu Ramen £11: Pork belly with Spring onions in 20 hours cooked pork broth\n- If you're looking for an easy entrance and introduction to classic Ramen, this would be a good choice. It comes with two flavoured eggs and Bamboo shoots. I usually put in extra garlic and sesame crushed seeds to bump up the flavour. \n2. Curry Ramen £12: Spicy curry broth with deep fried chicken and jalapeño\n- Anyone who likes chilli should try this bowl of fire. It tastes as spicy as it looks. Be prepared to have a cup of ice water ready. Also don't be surprise if you suffer the \"ring of fire\" the next day \nAs with all good restaurants in London, there is usually a wait. But it's shaded and there's a heater outside. They work very quickly to try serve everyone their food. I've never been disappointed with their services and would definitely continue to come here.",
                "datePublished": "2017-03-12"
            },
            {
                "reviewId": "uv86NX-L8VsM088Kyz08ag",
                "author": "Ali C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This ramen place used to be one of the best in London.  However, it has now been surpassed by Japanese branches especially Kanada-Ya.  I would say Ippudo is the second best.  Bone Daddies has a very hipster vibe in there where you can order sake and sit for a long time in there and no one would chase you away.  Whereas in a real ramen place, you are expected to eat and leave straight away.  The queue here used to be really long and I remembered queuing just to get in here.  \nThe noodle here is not up to my liking.  They are probably the thicker and they cooked it for too long so they are not springy enough.  The broth here is also diluted with no depth of flavour.  I won't be back unfortunately after I have found the other 2.",
                "datePublished": "2017-03-07"
            },
            {
                "reviewId": "1tz79H72PV65QAAS4oDn6w",
                "author": "Paul C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I had to try this place after being recommended by a bunch of ramen friends. What was that? You don't have ramen friends? How weird.\nIt's opposite the Supreme store, so you can watch people line up for hours to buy a shirt too, \nIt was busy and loud - I don't mind that for lunch and was dining alone anyway. Seated quickly, the place gives off a slight hipster vibe. Condiments all looked to be in the standard style, the hair bands were an odd addition, but back in the rock hair phase they may have been useful!\nI ordered:\nPork Bone ramen. Korean wings. Green tea and still water. \nThe wings showed up quickly. They were well spiced and as sticky as you like. Not too small, just right for an appetiser I reckon. Between two as a light one maybe.\nThe main event arrived shortly after. \nThe broth was great. Tasty and lightly spiced as expected. I added a little of the chilli and I was more than happy with its heat level. The pork was a little thicker than I would have expected, but that isn't a bad thing. Lots of top ramen content. \nMy green tea never arrived but my server was more than happy to either bring it to me or remove it from the bill.\nOverall I enjoyed it, I'll certainly be back. It's not Shoryu good, but it's really close.",
                "datePublished": "2017-09-21"
            },
            {
                "reviewId": "xAjO6z5mV_SXl8sLekTGGQ",
                "author": "Chantee F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The rock -n- roll of ramen. If you want a hip spot that satisfies your craving for warm noodles, Bone Daddies is your cool friend. There is a good variety of ramen, from the spicy to more traditional, even curry and vegetarian options. It's also open late.\nOne thing I wasn't expecting was the amazing Brussel sprouts - yes Brussel sprouts! - side dish that was packed with fried green goodness, citrus and pomegranates. It's so much better than your generic edamame and sets them apart from many other ramen joints.\nGet ready for a burst of flavour as the broth is quite thick, and their tonkatsu comes with a black garlic sesame oil which can be quite overpowering if you are looking for something more subtle. However if you are in the mood to rock, you will take comfort in this wild take on a Japanese classic.",
                "datePublished": "2016-12-27"
            },
            {
                "reviewId": "T8O5Uw_OC5JXydqIZdJ-BQ",
                "author": "Sophie L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Pretty good for what you can find in London. The tonkotsu broth that they're known for is way too thick and more like a gravy. I'd opt for the other broths.  The line here does get quite long, so be sure to buffer some extra time. \nProtip: add the extra egg. It's totally worth it.",
                "datePublished": "2017-01-02"
            },
            {
                "reviewId": "qYWH82w6BUAN7kOj_H8dTw",
                "author": "Sunny L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "This place was hyped up and wasn't really good. The wait wasn't bad when it was busy. The staff are nice but the food wasn't that good. Its more like a ramen bar than anything else. The broth was mediocre but the noodles made up for it a bit. Overall, I wouldn't come here again as it left me wanting to eat something better. \nPros: Fast, Service\nCons: Food\nStars: 2.5",
                "datePublished": "2016-10-07"
            },
            {
                "reviewId": "Z1snei3PUieNxUCVWY25MA",
                "author": "Monique S.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "This is for delivery: I've given this place a few chances, and now I'm done.  They advertise their tonkatsu as 20 hour pork bone broth that is \"A Bone Daddies Favorite: creamy white broth with Braised Tractor pork.\"\nThe first time I  ordered tonkatsu, I got a brown insta-broth, I thought it was a mistake. I ordered it again, and it was brown again, and didn't have the tonkatsu taste.  It was oily and tasted like they just threw a pack of soup into hot water and grease, almost like a bad roux. I called them to ask if their tonkatsu was brown, and they confirmed, saying \"That's how we make it.\" I've seen other reviews with the creamy white broth, so I don't know if they just send people who order delivery anything or what.\nIt's actually decent if you're craving ramen, but not the taste I was looking for. The minced pork is really good, and their chashu is delicious.  The noodles aren't my favorite. They seem to be soba noodles (buckwheat), but don't retain any of the flavors.",
                "datePublished": "2016-12-04"
            },
            {
                "reviewId": "uoYAaV4olSP7iPPu-nbVeQ",
                "author": "Thai H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "FOOD & DRINKS\nWe had TanTanMen (veggie & non veggie version) and the soft cocktail. The cocktail was very refreshing but the watermelon is a bit lost in the cocktail. If you were looking for a deep watermelon taste this might disappoint you. For me it was not amazing but pretty good.\nI had veggie and non veggie ramen in London, Tokyo, Los Angeles, San Diego, Toronto... and I have to say that the ramen I had here are not in my top ten. They were good but it already started with the presentation. I couldn't see any love there. Even a ramen for 5 bucks in Tokyo sometimes had a better presentation than the bowl I had in front of me. As for the taste I had to say it was a tad to bitter for me. But that is just my own preference. I think the quality was ok and the meat was very tender. The egg was amazing!!\nYou also can add fresh garlic and a chili paste to your ramen. Top!\nSERVICE\nI think the staff were nice and attentive. Only can say good things about them and all of them look pretty cool. \nATMOSPHERE\nWell it is different from a japanese style ramen restaurant. I would describe it as hip or alternative which is also reflected by the staff working there and I absolutely love it. Why shouldn't a ramen shop not be cool, hip or just different? \nRATING\nI think I would have given this restaurant a 4 if it had left a big impression on me since I already had ramen in other places in London. I must admit I like the ramen at other places more. Maybe next time I will try a different ramen and then the rating will be better!",
                "datePublished": "2017-06-30"
            },
            {
                "reviewId": "D8lWADX-lI6AkCHj_88n_Q",
                "author": "Alexandra Ruyee T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Definitely not the best place for ramen in London but still pretty good. Wouldn't queue for it again as i find the broth too oily and the noodles too soft for my liking. \nIts opposite the Supreme store so don't be alarmed if when walking towards it you see a long line of people especially on thursday mornings, we almost left as we thought that was the queue for Bone Daddies!",
                "datePublished": "2018-01-08"
            },
            {
                "reviewId": "adVjSBEwAF0_--1XVn3h8A",
                "author": "Virginia T.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "How, HOW does Bone Daddies have such high ratings? Due to the number of great reviews this ramen joint has I decided to check it out for myself and I've only left in utter disappointment.  I tried the tonkotsu ramen during my first visit and the broth was pure NaCl.  It was so salty I couldn't finish my ramen which, trust me, has never happened before.  The soup here is honestly what I'd imagine the Dead Sea tastes like. Tonkotsu broth is often a creamy pale color but here it looks more like shoyu broth, perhaps they add a tub of soy sauce to it, rendering it completely inedible.  Besides the salt factor, it also doesn't have a nice pork flavor that is characteristic of quality tonkotsu ramen.  Lastly, I usually love nitamago which are seasoned soft boiled eggs but again here they're overly salty and not enjoyable.  They really need to tone it down a bit.\nI thought my first experience was a fluke so I came back again to give Bone Daddies a chance to prove me wrong. This time I tried their tan tan men which was yet another letdown.  The broth left a powdery aftertaste and the noodles were beyond soggy.  \nI hate to say this, but Bone Daddies is probably some of the worst ramen I've ever had.  Don't come here if you want anything remotely tasty or authentic.  Try Shoryu, Ippudo, or Kanada-ya instead if you're looking for something better in London.",
                "datePublished": "2017-01-19"
            },
            {
                "reviewId": "Y5VTwTeWGKfVf-jroermRQ",
                "author": "Julia J.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Love eating here whenever I happen to be in London. Have yet to try any ramen here but those bao sandwiches are amazing!",
                "datePublished": "2018-05-29"
            },
            {
                "reviewId": "A8BbAEmfc66qH_G-9dWboQ",
                "author": "Jennifer L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Bone daddies one of the top ramen place in London?\nYes, I dare say. I still have a slight preference for Ippudo but Bone daddies is a close second plus it had more interesting choices in ramen combination.\nWe started with snacks: chicken wings which were simply yummy the right amount of sweet and spicy with a bit of a crunch.\nChashu pork and corn croquettes are abs fab a must order!!!! \nNow onto the ramen:\nMy friend went for the Prince of darkness. They warn you the it is f***ing spicy and it is. It s the kind of spice that creeps up on you (meaning its progressive) \nI went for the IP tonkotsu with an egg and it was just greatly balanced. The 20hours pork broth is just perfect but for me the noodles were a bit too large and too cooked but that s a personal choice. I like my ramen thin and al dente. Other than that the whole was just delish \nfor the drinks we had the asahi cream head and the watermelon crush. Beer is beer obs but the watermelon crush was just the right amount of sourness and freshness I loved it, it goes perfectly with my dish as it was a little bit spicy so they married well.\nOverall there is no doubt Bone daddies is one of the best places to get ramen in London!!!!",
                "datePublished": "2016-06-29"
            },
            {
                "reviewId": "q4P8MF8zUm1vYKHfuZs4TQ",
                "author": "Arun D.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I heard about Bone Daddies through a tantalizing photograph I found on reddit. When I first saw the pic I thought - ugh another delicious ramen picture from a traveller in Japan and was delighted that it was actually a spot in London. \nI got in around 6:30 and waited 5 minutes before we were seated. The service is quick and the food came out very quickly. My choice to order was easy as there is 1 vegetarian ramen on the menu. \nThe ramen noodles were chewy but the thin kind that tend to get soggy quickly so slurp quickly! The vegetarian mushroom broth was pretty average. The flavour was one-dimensional and it was just a strong umami taste. No spice or creaminess that I've had in other vegetarian ramens. The toppings are perfectly cooked and the eggs yolks were golden and runny which was perfect. \nThe overall experience was great and I understand why there was a long line-up of people waiting in the rain on a Monday night to get in. Didn't hit the spot on my ramen craving but I would recommend to non-vegetarians!",
                "datePublished": "2016-08-02"
            },
            {
                "reviewId": "_tyyvrZgxH53jnMAf5pWDA",
                "author": "Pauline M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Bone daddies is a modern ramen joint.  Ramen meets hipster.  Edgy.  \nTo be fair, I didn't have much ramen in london to compare this too, perhaps this is the best London has to offer?  Perhaps it isn't.  Either way, the tonkotsu broth and the T22 are the 2 most raved about in reviews, so that is what we went with.  The broth itself was very thick and heavy, but somehow lacking depth in flavor.  The ramens themselves picture perfect!  \nEverything was fresh and the staff was excellent.  The drinks were quite delicious as well.  \nThe stools aren't the most comfortable to sit on, but perhaps that is so people don't stay as long as the wait does get quite long.",
                "datePublished": "2016-06-20"
            }
        ]
    },
    "20": {
        "id": "_2XoQQKE0AXHgmbONR-5mw",
        "name": "Bone Daddies",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Soho",
            "streetAddress": "30-31 Peter Street\nLondon W1F 0AR\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UUBXhkhhCHFeYv3HAB9ZoA/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7287 8581",
        "review": [
            {
                "reviewId": "jIoTsYYPDsvxbRV9Z4kw3A",
                "author": "Natalie L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I first heard about Bone Daddies when it was mentioned in a \"must try restaurants in London\" article. It raved about this place, saying it was the absolute best ramen joint around, so I was quite excited to try it. \nI asked for a recommendation and the waitress said their tonkatsu ramen was the most popular, so I decided to go with that. The service was speedy! I got my food in less than five minutes. However, I found the ramen to be very underwhelming. The broth had so little flavor - I felt like I was just drinking soupy oil. The ramen and meat were alright, but nothing to write home about. The egg was probably my favorite part of my meal. \nPerhaps because I've had really good ramen in Japan and Los Angeles before, Bone Daddies just wasn't up to par.",
                "datePublished": "2016-11-20"
            },
            {
                "reviewId": "-MvY4UnU_ghOB1kmmhan0A",
                "author": "Fun T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ramen was pretty good.  \nWould have liked the broth and roast pork to be warmer/hot.    Service a little lacking and unorganized.",
                "datePublished": "2017-09-02"
            },
            {
                "reviewId": "ebMUgCvMt9u1ImjdtW0lDg",
                "author": "Renata M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The best noddles I've ever had so far. The sevice was awful though, the starters arrived after the main course, the waitress didn't stop asking if we were finished, as if they wanted as to eat quickly to vacate the table. The place is extremely loud, and the loud music doesn't help. If you want a quick bite to eat this is the place, but if you want a nice relaxing dinner I don't recommend.",
                "datePublished": "2018-04-08"
            },
            {
                "reviewId": "mjqc4ZF3woqyzjzP81RYCw",
                "author": "Hang T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "A friend recommended this place to us as one of the best ramen places in London. However, he did warn us that Asian food in London does not compare to that of the Bay Area. That said, I can say that this place is hit-or-miss. Some dishes are amazing and some are just bland. For example, I ordered the kimchee ramen while the others ordered the tonkatsu ramen. My ramen was bursting with flavor and good, but the tonkatsu was the opposite. The people in my group complained that it was one of the worst that they had ever tried. There was no seasoning at all. They had to add soy sauce or black oil to spice it up a bit. Disappointing. With the appetizers, order the fried chicken and skip the pork and corn croquettes. Again, one was perfect while the other one needed more. \nThe restaurant is located close to Chinatown and I would have totally missed it if I walked by. The place is small so be prepared for a wait during meal times. The staff was very helpful and friendly. They had us come in from the rain and sit on stools until there was a table available. \nRemember that compared to almost every other currency in the world, the London pound is pretty expensive so don't expect this place to be cheap.",
                "datePublished": "2015-11-09"
            },
            {
                "reviewId": "gz1Pt6XCk3s4uJc_fdiKPQ",
                "author": "Christina L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I had just eaten at Ippudo New York the week before, and Kanada-Ya in London a few days before eating here, so I feel like I had a pretty good base of comparison. I wanted to like this more, but I didn't care too much for the ramen here. I liked Ippudo and Kanada-Ya better.\nThis place didn't feel as authentically Japanese as Kanada-Ya did, and more of a fusion, cheeky-humor kind of place. I felt like I could be in a small ramen shop in Japan when I was at Kanada-Ya, but felt like I could be in SF or NY when I was inside Bone Daddies. This place is much more amenable for larger groups than Kanada-Ya. If you have more than 2 people, Kanada-Ya may not be a good fit, but I think Bone Daddies would be able to accommodate parties of 4-6, but not much larger. The wait is probably much shorter too.\nI ordered the Tantanmen which has sesame, chili, minced pork, chashu pork and bok choy. The broth was rich and flavorful, but I preferred the broth at Ippudo NY and Kanada-Ya better. The pork here was a bit on the dry side which was disappointing - it needed a bit more fat in it. Normally, I have no problem polishing off a bowl of ramen, but I didn't finish this one. Noodles were fine, but I preferred the chewier / more al-dente noodles at Katana-Ya.\nKorean Fried Chicken Wings - These were huge, and had almost too much sauce on them. I didn't find them really crispy on the outside, probably because there was too much sauce on them. I don't think I'd get these again.\nIf you're looking for ramen and want more options on flavors and more unique combinations / fusion, then this place is great. It's also good for slightly larger groups and/or if you want to have drinks with your meal. If you want a more authentic ramen experience, head over to Katana-Ya.",
                "datePublished": "2016-10-14"
            },
            {
                "reviewId": "nQWzrt19QOyQRoRCN_Pydg",
                "author": "Moby C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Really love chicken wings!!! And sadly I was so devoted chatting with friends my noodles doesn't taste well... :)",
                "datePublished": "2018-02-15"
            },
            {
                "reviewId": "cnq3hDt_JG7RW9RYnncMIQ",
                "author": "Dustin H.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "- Main issue for me is that the broth was way too thick, like a gravy\n~ Fairly loud, dive bar-esque atmosphere\n~ Note that the Prince of Darkness is super spicy",
                "datePublished": "2016-10-05"
            },
            {
                "reviewId": "7NCDueDrxzc1lKJcnVl--A",
                "author": "Jessica C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Came here for a team dinner when we were visiting from the states and the food was really good. They were able to seat our large party all together and serve us quickly. They have food options for vegetarians and can also accommodate other dietary restrictions.",
                "datePublished": "2017-12-18"
            },
            {
                "reviewId": "qiErNkJ3OCG8i1lx9R1oFQ",
                "author": "Tom Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Waking up from an evening of seeing London's bars and clubs with some friends, two of us looked at each other and said Japanese food.  I had bookmarked this place from the last time I was in London and didn't make it here.  Weekend lunch crowd equaled a short wait for the 4 of us, but we took the time to look over the menu and enjoy the ambiance.  \nOne of us was skeptical because he is a true Ramen Nerd, in the end he felt content, not overjoyed, but satisfied. I had the T22 with extra noodles and that was pretty good, enough soup and ingredients to cover the extra noodles, the broth was flavorful, not intense.  It wasn't the mind-blowing experience others would say, but I thought it was pretty good.  I might stop by again next time I am in town, but than again there are a lot of good restaurants in London and SOHO.",
                "datePublished": "2015-11-16"
            },
            {
                "reviewId": "CivWCxuwWQmDZInj1De4RQ",
                "author": "Sarah M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Good ramen but a little overrated. Got the Yuzu Tonkatsu ramen, the fried chicken and the chashu pork and corn croquettes. The croquettes were delicious but the fried chicken was a bit dry. The ramen had a nice broth but it wasn't as flavorful as other ramen places in the area. The pork belly was nicely cooked however and the it had a nice mild kick to it. Overall good ramen but not worth the long waits at peak meal times.",
                "datePublished": "2018-01-28"
            },
            {
                "reviewId": "xy0Gwv_uylBuNYi1RCKxeg",
                "author": "Matthew G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Another tough competitor at the best ramen in London. If you like a thick ramen, you'll love the Tonkotsu variations that Bone Daddies has to offer. \nThis was my second ramen of the weekend after having just been to Toro for Tonkotsu Ramen just yesterday (I'm a ramen addict!), but this time I'm trying a new type of ramen, Kani Tonkotsu. This ramen has chashu pork, softshell crab, chilli, kale, beansprouts and black sesame. Alongside a Bone Daddies Cider. The ramen was good, very very good, it was hot and a nice refreshing change from the normal Tonkotsu that I'm always eating. Highly recommended! \nI had Green Tea, Coconut and Salted Caramel Frozen Mochi for dessert. Normally I'm not a fan of frozen mochi but these flavours were delicious. \nPlease, please go check out this Ramen as it is one of the best in London!",
                "datePublished": "2016-06-27"
            },
            {
                "reviewId": "hub5Xajv4Fju8nRn-cErNw",
                "author": "Seo Young M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Tried the tonkotsu ramen and the broth tastes really thick. But it may tastes a little bland for some people. Personally didn't think the noodles tasted as good either. The restaurant itself may be ano good place to come with friends and hangouts.",
                "datePublished": "2016-10-13"
            },
            {
                "reviewId": "EEBUnnIEjv2E4ZYTrtbscw",
                "author": "Yo N.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I have to agree to some other Yelpers reviews here, it has a very hipster vibe. Even I am into Punk Rock / Rock N Roll and love a good Izakaya, this place is way to loud. It was hard to talk to each other and even the waitress had a hard time understanding our order. \nThe menu was super hard to read, the font was micro sized printed on brown paper in a very dimmed light. The ramen was ok, the broth was very diluted with no depth or flavor. The waitress also forgot some things we ordered, but it was on the bill anyway. So we had to let them know that we wont pay for items that we didn't get, which was acknowledged, but not excused in any kind of way.\nAs a bar/pub hang out with a twist, its kinda ok-ish, but there are better places for that in Soho. I had the most amazing ramen in Hong Kong, Singapore and Beijing. This place wont be ending up on my top ramen list.",
                "datePublished": "2017-06-28"
            },
            {
                "reviewId": "kcwkIh19gfkvDI8NaeNjfQ",
                "author": "Tammy T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I've visited Bone Daddies countless times in the past three years, and I still love it just as much as I did the first time.  I will admit that there have been a few times where I felt the quality of the ramen dropped slightly, but overall it's quite consistent.  I also stand by the fact that their fried chicken is still one of my favourite fried chicken dishes in London!",
                "datePublished": "2016-09-14"
            },
            {
                "reviewId": "8cE1FzhjmRo_0gM00UZFVg",
                "author": "Rita L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Tried both the tonkatsu and t22 and really not that impressed. Their broth had a weird spice in it with a strange taste. Not that authentic compared to ramen I've had in Japan and in New York. Softshell crab was also passable. Pork croquettes were the only highlight of the night and were worth getting. I'd recommend going to Shoryu a couple blocks away if you want a better ramen experience. The wait time is about the same for both places, about 15-20 minutes for you to get seated. Shoryu has more of an Asian crowd whereas bone daddies has more of a hipster crowd with asian fusion style to it.",
                "datePublished": "2016-01-17"
            },
            {
                "reviewId": "ZuxlGQEdzQf3Cqyk1oGvIw",
                "author": "Hansel B.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Good ramen. Has a nice spice to it and plenty of broth.\nService could use some work. They had us wait for 30 minutes, I got up and asked what was going in, then they informed me there was a mix up in the kitchen and our order was coming soon.\nIf someone had proactively said this, I would deal with it.. but I saw 3 people that got there after we ordered get their food, so they had plenty of time to let us know. The whole thing just soured the experience.\nThe manager compd our appetizer which was nice, but I didn't like that no one bothered to acknowledge the screw up before I had to go and ask.\nI might give this place another try, but not if they are too busy.",
                "datePublished": "2016-02-08"
            },
            {
                "reviewId": "Jy9-GW0n64dnY8SfKwoj0A",
                "author": "Canny F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Woah this was good. My friend ordered the kimchee ramen and I had already bought a veggie pot pie so I didn't order anything. This place was packed and I could see why. The ramen was the bomb! Not salty, not oily, not bland, not cheap on ingredients. All was great about this dish and it was not expensive either. The waiter was friendly and the customers had so much energy. You won't feel lonely here if you are a solo traveler.",
                "datePublished": "2016-06-09"
            },
            {
                "reviewId": "nTqAB0OcqDaBEwzsrwtmmw",
                "author": "Elisa L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Decided to check out the ramen scene in London, this one in particular given that it was one of the higher rated places.\nArrived around 7pm on a Thursday, there was a short lineup but people come and go quickly and we were in after about 15-20 min of waiting. It's more of a ramen bar than a nice sit down place. Very loud and lively, the locals seem to love it.\nThe staff were not that friendly imo. It wasn't very clear that we were supposed to wait by the wall once entering. We thought we had a spot already because it looked like they were gesturing us to follow the group in front of us. That was awkward. While seated, the waitress ran into my bf while walking through the aisle and didn't even say sorry, just asked him to tuck in his chair when it wasn't even his fault. No smiles given. It's definitely a little crammed in there. \nAnyways, the food. We didn't get any apps or drinks, just the tonkotsu and T22 ramen. The food came reasonably quick, around 10-15min wait. Tonkotsu had very standard ramen broth, on par with Ippudo in NYC. I thought I'd try the T22 because I don't have chicken ramen very often. It was delicious - and there are cock scratchings which added crunch. The broth got a bit salty after awhile though. They use thin noodles which I loved. Overall, very filling and moderately priced.\n3/5 for service and 4.5/5 for the food.",
                "datePublished": "2015-06-07"
            },
            {
                "reviewId": "U3Aw_soLFYpKQ5LmcPXJbQ",
                "author": "Alice Y.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I also heard about this place from friends, so I decided to venture over here for a warm bowl of ramen. First impressions, I liked how they have garlic ready on the table with a garlic masher, BIBS if you're a messy eater (I am sure am!), hot sauce, and lots of utensils already ready. The garlic is in a jar, but I love garlic in my ramen so I was very happy. \nI ordered the T22 ramen and I was a little dissapointed. The broth was not as rich as I liked and it was spicy. I'm not a spicy food fan so that was an immediate no-no for me. The noddles were also incredibly hard and it tasted almost undercooked. The meat was also not very tender. The mushrooms were good tho. However, they do give you TWO halves of a soft-boiled egg unlike a lot of other ramen restuarants and they have a very impressive drink menu. I wouldn't say this would be a go-to ramen place for me, but it was enjoyable for such a cold winter day.",
                "datePublished": "2016-12-25"
            },
            {
                "reviewId": "yXoTpgZPY468MeJsg0GOPg",
                "author": "Ian H.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Couldn't be more disappointed. \nThey ran out of all good sake and we were told that the house 'would be fine'... not sure we were looking for fine... \nThen I ordered more noodles and waited 15 for them to arrive before they arrived and my broth was cold.",
                "datePublished": "2017-11-05"
            }
        ]
    },
    "40": {
        "id": "_2XoQQKE0AXHgmbONR-5mw",
        "name": "Bone Daddies",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Soho",
            "streetAddress": "30-31 Peter Street\nLondon W1F 0AR\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UUBXhkhhCHFeYv3HAB9ZoA/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7287 8581",
        "review": [
            {
                "reviewId": "-McCAbnr6ARYt8SuU98W7w",
                "author": "Ravenous X.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Bone Daddies was always going to be a hit with me. It has two things I absolutely love, ramen and rock. This Peter street outlet is where it all started...as a simple ramen bar. The interior has Japanese inspired graphics, and pictures of Japanese rockers plastered all over the walls. Diners are seated on stools at high tables. The rest of the Bone Daddies experience comes courtesy of an all-out onslaught on the senses, the noise, the smells, the tastes - fantastic.\nTo start, we ordered the Salmon Tartar, Wild Soft Shell Crab, and Edamame. I regret not ordering the Korean Fried Chicken Wings which, the couple sharing our high-table so thoroughly seemed to have enjoyed. Our salmon, which is served with a lime wasabi ponzu, was really good; the salmon so fresh I could swear it had a pulse. The soft-shelled crabs come with an out-of-this-world Thai green curry, chilli and ginger sauce - OMG!\nFor our mains, we ordered the oddly named T22, which is a soy ramen, a Kimchee Ramen and my favourite, Spicy Miso Ramen - all amazing; my spicy miso ramen as good as any I have had in Tokyo (and believe me I have had a lot). The noodles are not just genuine ramen noodles but they were cooked perfectly.\nService is good for London, and it's fast; they're just too busy to be friendly. Expect to stand in a queue, either in-doors or out, for up to 15-minutes. I'm not sure if they accept reservations. I think not. Irrespective, if you're looking for an authentic ramen in London, this is the place to come.\nWaste NOT. Want NOT.",
                "datePublished": "2017-01-26"
            },
            {
                "reviewId": "wJo5ElejiFO-SGw-rQI99g",
                "author": "Ella M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I am honestly only giving it 3 stars because there was a hair in my food. I ordered the curry ramen which contains fried chicken. I noticed there was a hair so I was just gonna pick it out and when I did I realized it was fried in to the chicken. It was so disturbing that I couldn't really eat my food. And when I told my server he looked at me blankly and then walked away only to come back and say their chef was sorry. Still charged me for my ramen.... it's just frustrating when you don't make a huge fuss they don't comp your ramen.",
                "datePublished": "2017-09-16"
            },
            {
                "reviewId": "OYwfm_qKXauIB33ffoUIeg",
                "author": "Felicity L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Bussssssssssssiiiiii ! \nThis place was packed! Not just packed it is packed paxked ! The queue is extended to outside of the door.\nCredit to the ramen really!!!! Springy and hearty! And the broth was soooupppper nice and dense and the ingredients, the braided slice pork and the slightly runny eggs were perfect match with the broth and ramen ! \nThey also have this bib thing where you can wear to prevent the juiciness of the ramen spread on your coat. Gimmick ! \nOverall nice food and hipster-y environment",
                "datePublished": "2016-03-21"
            },
            {
                "reviewId": "2Dc7fI78xeb8ibouYBq6fg",
                "author": "Matt D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Delicious ramen, fast service, but one of the waiters was in such a hurry he pushed my partner and I around a little. Would definitely come back.",
                "datePublished": "2018-04-02"
            },
            {
                "reviewId": "mVHrIUN5_KgX3ZJQqcxndg",
                "author": "John N.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great Ramen house in the heart of SOHO. Very close to the gay district and in walking distance to the shopping areas. When we arrived a line was forming out the door. Waited for about 15-20 minutes before being seated. I don't think they take reservations at this location and from the looks of the que, seems like a local favorite. \nOf course I ordered the Miso Ramen. It was actually quite different from what i'm use too. The soup base almost reminded me of a tex-mex kind of fusion with the traditional miso ramen. It was different but delicious! Ramen noodles cooked perfectly, and pork was cooked just enough to keep a firm texture. Waiters were very friendly and understood people were waiting long for food so extra smiles and attention was given. Would definitely recommend this location for tasty Ramen. Tuna tartar was amazing as well! Freshly prepared and uniquely set for a fun and memorable experience.",
                "datePublished": "2016-07-28"
            },
            {
                "reviewId": "zbNZtGJUw_TIemnbU7HwQQ",
                "author": "Karen L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I love ramen! So, I'm always looking for a great ramen house. Bone Daddies is not your typical ramen house. They add their own special touches/spins to traditional ramen. We tried the Tatanmen and the tonkatsu. These weren't really your typical tatanmen or tonkatsu broths. I can't quiet put my tongue to it, but it's got its own special kick! The noodles were decently chewy and in good amounts. The garnishes aren't that special. I think what makes Bone Daddies special is their broth! Oh and their drinks! Mr. Sparkle and BD Rocket! I will be returning for those!\nThe decor is unique - modern yet edgy. The place is always packed. There's going to be a line. Prepare for some tight seating and maybe even eating with strangers. But really, it's not that bad! You're there for the food anyways!",
                "datePublished": "2014-12-29"
            },
            {
                "reviewId": "qjF4gkMjh_ASDGO1tH_CVQ",
                "author": "Amanda L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Was looking forward to this because I was having some serious craving for a good ramen in London. \nThe broth was thick, egg yolk was flowy and good; but something just didn't quite make the cut. \nI would say, the majority of flavor I was getting, was the taste of noodles. That starchy taste. The soup wasn't as flavorful, the meat wasn't mouth-watering. \nA little disappointed because I saw great reviews on this. \nPerhaps I just gotten a bad bowl. Will look to try shoryu ramen next tho.",
                "datePublished": "2016-09-25"
            },
            {
                "reviewId": "ksl3KWvtNTTpusyNWGBYCg",
                "author": "Al C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Disappointing ramen experience here, far below par. Spicy tonkotsu doesn't even come with an egg (or was forgotten). The broth was cold and there was hardly any in the bowl, so we had to push down on the noodles and toppings to get any onto the spoon.",
                "datePublished": "2016-03-28"
            },
            {
                "reviewId": "Q_5I4Yc0En5S2k36zQ-kYQ",
                "author": "Angela W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Maybe I'm spoiled for choice in NYC with ramen joints, but Bone Daddies really just did not do it for me.  I got the classic Tonkotsu Ramen, and didn't enjoy it enough to finish (and trust me - I eat a LOT).  The broth was nice and thick, but lacked flavor, and the texture of the noodle wasn't as chewy as I would have liked.\nThey did have this awesome brussel sprout appetizer though - the pomegranate seeds added a great kick to it, so an extra star for that!  I would go if you're looking for a quick meal but nothing worth going out of your way for.",
                "datePublished": "2015-12-02"
            },
            {
                "reviewId": "fK6OuEYemtCx9F76X83llw",
                "author": "Mark S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Fantastic ramen. I'm far from the first person to figure out Bone Daddies knows what's up, but I've now been twice, and each time I've been impressed. I decided to try to curry ramen with fried chicken - amazing. They had some appetizers that looked delicious as well, but with a big bowl of ramen, your stomach will be full, so one course is really all you need, unless you have a few people to share something with. \nWe got there at 7:30pm (on a Monday) and probably waited 15 minutes to get seated. Once in our seats, we didn't have to wait long to order though, and the food came pretty promptly. I'm excited to try some other ramen places in London, but Bone Daddies did a pretty good job of setting the bar. We'll see if anything else comes close.",
                "datePublished": "2016-10-25"
            },
            {
                "reviewId": "Tbav2eIm44RIWbZ1OAQdWA",
                "author": "Jasmine L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Bone Daddies is definitely a great ramen place to check out in London. Went with two other friends and we ordered the Tonkotsu Ramen, Kimchee Ramen, & Dipping Ramen to share among us three.\n1. Tonkotsu Ramen was on the saltier side. Definitely good, but nothing particularly outstanding in terms of how tonkotsu ramen broth. The noodles were a very good level of not too hard and not too soft. I definitely enjoyed the noodles, and was a bit let down with the broth. It was simply just salty and nothing particularly flavorful. Nevertheless, it was wonderful with a cup of water on the side.\n2. Kimchee Ramen was super spicy. You need a strong ability to handle spiciness to take on this broth. It came with a lot of seafood which was wonderful and very fresh. As someone who personally cannot handle anything too spicy, this was definitely something not in my zone of comfort. However, my friends who love anything super spicy were really happy with the flavor of the broth.\n3. Dipping Ramen was a very unique experience where all the ramen ingredients came on a platter next to a cup of sauce. The sauce appeared clear but was extremely flavorful. I personally really enjoyed this dish because it was not only a unique ramen experience, but also something well-flavored and worth the price!\nADVICE: Arrive at an early dinnertime! There will be a line! The line will most likely be outdoors so bring a nice coat to wear. There will be hooks on the wall inside of the restaurant, so you can hang up your coat when you're seated.",
                "datePublished": "2015-03-13"
            },
            {
                "reviewId": "iIDYKIqhsXd03eUKMLOHGQ",
                "author": "Heather B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Not much more can be said that hasn't been already about the ramen kings, bone daddies! \nArrived just after 6 on a Thursday, and pretty soon there was a queue out the door, as expected! \nMy friend and I nabbed seats by the front window (excellent people watching while dining) and stared with an order of the Korean chicken wings; they had a sweet and spicy sauce and were crispy and delicious!! But messy, soooo messy! \nWe both had the tonkatsu ramen with the now famous pork bone broth. Rich, creamy and flavoursome, loaded with noodles, spring onion and a perfectly soft poached egg- ramen perfection! I did add a load of chilli to mine, so think next time I'll order the spicy version and see how I get on!\nWe ended our meal with a selection of moochi ice creams. The green tea was good but slightly bitter, the raspberry fresh and fruity and the chocolate has a rich, mousse like quality to it. \nStaff were friendly and the atmosphere was buzzing - yet another great spot in soho!",
                "datePublished": "2016-01-07"
            },
            {
                "reviewId": "DgNkR0EKNkSFROQC5q66Cg",
                "author": "Tejel P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I finally got my ramen fix after craving it for a while ever since I started watching a Japanese Netflix TV show called \"Good Morning Call' (totally hooked on this show). I liked the sound of this place as it was casual dining and has received great reviews. \nAt 4pm, it was not very busy so my husband and I decided to take the seats near the window gazing out on to the street. I was glad we had the room around our seats as it created a little privacy . The only downside to this was having to turn around to talk to the server, but that was no big deal. \nI liked so many things; the little jar of elastic hair bands, bibs, fresh ginger with press, the music and most of all, that there's no shame in slurping.\nWe had the fried chicken, which was served piping hot. It came with a lemon wedge, but we preferred a dipping sauce and found the soy sauce, which was good. I then had the Tonkotsu Ramen with extra egg, corn and chicken cock scratchings. Now I was unsure about the latter, but the waitress explained it's a nice crunchy garnish, which it certainly was. After my meal, I was nicely full and glad it wasn't raining as I totally needed to walk off the ramen.  I can't wait to go back to try the other dishes.",
                "datePublished": "2016-04-10"
            },
            {
                "reviewId": "rJ-4aDNUFKPaSTA83DhdWg",
                "author": "Angela O.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I have been to Japan and while I know good ramen, I am not super picky. \nWhen you first walk in, you will notice it is super dark. You can't read the menu if you are seated in the corner. From a distance, I thought the place was closed.\nI ordered the IP Tonkatsu ramen. It came looking nice but I notice black spots on the ramen , as soon as I stirred, it turned the whole broth deep brown. This was not the color of ramen that I wanted nor is expected. It should be a creamy oily white broth.\nAfter a few bites, I couldn't eat anymore. It tasted overwhelmingly like soy sauce. There are soy flavor ramens but this was just too strong of soy sauce. \nI thought ok, let me order another ramen and maybe it was just a one off. I showed a picture of what I wanted and they said it was spicy miso.\nThe spicy miso appeared nothing like the photo I pointed to the waitress. All the ingredients were the same yes but again the color of the broth was wrong. It was a pale red dull color. The taste was better than the tonkatsu but still not what I wanted.\nI basically ordered two ramens, ate half of one and paid £30. Oh guess what, they also tack on service charge 12% and force you to donate £1 to charity in your bill.\nThe worst experience I've had in London so far. \nThe two stars is for the fact that the ingredients themselves were very good. The noodles were not typical ramen firmness or cut but were still very delectable. The corn is from a grilled cob and sliced off in small stacks. The egg is soft boiled but might have had too much soy flavor or that was due to my broth I'm not sure.\nThe service in general was nice but they should have known better or tried to accommodate me in some way when they knew I didn't like any ramen even after ordering two. I'm not asking for free food but it would have been nice if they at least asked if I enjoyed the food after I said I didn't enjoy the first ramen. I think that means they don't genuinely care and just want your money.\nWatch out.",
                "datePublished": "2016-09-09"
            },
            {
                "reviewId": "PLZBnO0fsP5XUw1k52uLTg",
                "author": "Brianna L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good location and we were seated right away on a Sunday afternoon. The food was quite good, I had the salmon poke and I really enjoyed it for £10. It has a nice atmosphere and I would definitely go back.",
                "datePublished": "2018-02-23"
            },
            {
                "reviewId": "8RQ5Pfg-uVLGh5Tcb9Tg-Q",
                "author": "Martina C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I really wanted to give this place 4 stars instead of 5, because I despise crowded places, stools, small table space and queues, and this Bone Daddies has all of the above. \nThat said, as soon as I've put food in my mouth I went to ramen heaven and back, and as my friend pointed out, I didn't say a word for 20 minutes. \nI've ordered the Tonkatsu (Tonkotsu? Tonk...whatever) ramen, and added the cock scratching because in all the pictures I saw of ramen from Bone Daddies I could spot these crispy bits on top and really wanted to know what they were and try them. \nOH. MY. SWEET. BABY. DAY. IN. THE. LIFE. \nCan I just go back there RIGHT NOW?\nThe 20h pork broth was so rich and creamy, it would have been delicious on its own. Like, even without the perfectly sliced thin pork, the flavourful noodles, the hard-boiled eggs that kept a soft but not runny yolk, the soy sauce on the one side of the bowl, the spring onions, and all the other bits, including the scratching. Which were out of this world delicious. \nI would love to say something more about the place itself, the hairband and bib they provide for mess-free experience, the atmosphere, etc. But I have a parade of ramen soups dancing in front of my eyes and can't think of anything else but going back there asap. \nSo if you're anything like me (i.e. a fussy introverted mess) you'll want to run away when you see the crowd, PLEASE BE PATIENT BECAUSE IT'S WORTH IT. I promise. \n(Ps. Thank you Charlotte K. for being to me that one friend to take me here, as someone else did with you years ago. Let's keep the tradition going eh?)",
                "datePublished": "2015-07-23"
            },
            {
                "reviewId": "NdmGqQsyLM9sUaurba0VRw",
                "author": "Ioannis K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Environment: casual and noisy, not in a bad way but don't expect privacy. You're going to sit with other people at the same table. Expect some waiting time, around 20 mins in average. \nFood: great stuff. Probably the best ramen I've had so far. I even had friends from the US with previous ramen experience express the same view. It's a huge bowl filed with broth noodles and whatever other ingredient you order.",
                "datePublished": "2015-10-28"
            },
            {
                "reviewId": "_iSRhvjUnOoAS63LCLg0BA",
                "author": "Irene L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Ambiance is nice, definitely a good spot for late night bite (but not too late they close at 10 p.m.). The place gives off very hipster vibes.\nI actually really enjoyed their Salmon Tartar with the Lime Wasabi Ponzu and it came with Renkon Chips! The salmon was definitely fresh and the ponzu was amazing with the salmon, it's bright, citrusy, and a nice kick of wasabi! Actually one of the best things I've had! I really liked what they did with the sauce for the salmon. \nI had the Tonkotsu Ramen and it was okay. It definitely is one of the better ramen places that I've visited in London, but the ramen itself was still a little lackluster in general. The broth was fine, it's actually a little less salty than other places which I liked. The broth is also very creamy. The ramen egg was really nice, but the menma (bamboo shoots) were quite awful...lots of unchewable strands of bamboo shoots! There were hard and hay like strands in my bamboo shoots and toppings. The noodles were quite bad though, it was mushy for me. Perhaps it was just that night or my ramen had been sitting out for a while, because ramen noodles should never be mushy! Mine had no bounce whatsoever (it was also quite thin), very limp, and it was just overall unpleasant to eat in general. Not quite consistent with what I've heard about their ramen, but that was what I had. LIMP NOODLE!!!\nI had the Gini Hendrix cocktail as well and I highly recommend the drink! It's like a Gin and Tonic but much more refreshing and bright! Love the addition of cucumbers and yuzu liquor instead of tonic, so refreshing and much more complex. Oolong syrup didn't really add a tea taste to it, but it was a very sweet drink. Probably my favourite cocktail ever!\nIt's a great place to meet up with others and have a decent meal, but it is actually quite dark inside. Prices are also pretty steep for food.",
                "datePublished": "2016-08-29"
            },
            {
                "reviewId": "D1rYpoEIbT7hqAKUc13r7A",
                "author": "Robyn H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I came here on a bank holiday around 5:30 and managed to get a seat right away with my mom. But we got lucky because I don't think anyone was seated long after that and there was a huge lineup outside. \nI got the curry ramen. I thought it was pretty good. The fried chicken managed to stay crispy and the broth had really good flavour so I didn't have to add anything to it. I also was sceptical about the noodles since some of the reviews weren't so great but I thought they were fine. They were ramen noodles! Didn't find them chewy, hard, soft or too big. The peppers were interesting and didn't do much for the dish in my opinion \nMy mom got the tantanmen ramen. The soup was a little peanuty and she thought she didn't get enough meat, but other than that it was good\nWe were sitting right at the window and since there was a line up people were constantly watching us eating which was a little weird for me but, can't really blame the restaurant though.\nThere were some other ramen that I wanted to try so I would go back \nI didn't take pictures as it was quite dimly lit and they wouldn't have turned out\nShoutout for the great service though! Even though it was crazy busy the servers made sure to come over to us every so often to check up on things and managed the line well",
                "datePublished": "2017-01-02"
            },
            {
                "reviewId": "u2zplxPoVH8iDfdvFP5i-Q",
                "author": "Elizabeth H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "As far as London food goes, I can see why this place is hyped. It has enough uniqueness going for it, and Asian foods are trending pretty hard right now. But as far as Japanese food goes in particular, I'm a snob and very much an isolationist. I want my dishes simple and authentic. Not a huge fusion fan either. And I want my tastebuds to feel the sensation of being transported to the land of the rising sun. \nWith that disclaimer out there, if you want an original experience, sure, hit up Bone Daddies. But if you want an authentic experience, you won't get that here. This is big-time, hipster noodle fare.\n- The noodles are frozen. You can't customize the consistency and they cook them pretty soft here (firm should be the standard). They're also crimpy to the max. T_T\n- They don't serve rice. At all. No rice. Zero.\n- Tea is from a packet.\n- They don't have togarashi. Seriously? \n- No vinegar either.\n- The broths are not so much flavorful as they are intensely spicy. If spicy broth is your thing, then by all means, jet on over here for some indulgence. But I prefer rich and full broths.\nThe milky / creamy broth in the tantanmen was very interesting. I've never had it like this before. Or with peanuts. Or with chashu. But with very little ground meat in the first place. Hmmm. I ordered it without the extra chilies and it still had a crazy bite to it. The tantanmen 2 is even moreso, veryvery spicy.\nI'll end this on some positives. \n+ Their karaage is good as far as fried chicken goes, but no need to go crazy for it, guys. \n+ Kudos on offering black sesame and kinako flavours for dessert, but those dishes were too diluted for one to truly appreciate such unique tastes. Less subtle, more concentrated, please.\n+ Fresh garlic!\n+ Their bamboo had a good crunch and their eggs are cooked perfectly.\n+ Hilarious bibs on request, haha.",
                "datePublished": "2014-02-04"
            }
        ]
    },
    "60": {
        "id": "_2XoQQKE0AXHgmbONR-5mw",
        "name": "Bone Daddies",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Soho",
            "streetAddress": "30-31 Peter Street\nLondon W1F 0AR\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UUBXhkhhCHFeYv3HAB9ZoA/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7287 8581",
        "review": [
            {
                "reviewId": "qWzITWyccNnj0gH67HZcFA",
                "author": "Owen B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Excellent ramen. Excellent atmosphere. Excellent mochi ice cream.\nThe ramen is deeply flavorful with unique toppings like \"cock scratchings\" which is crushed fried chicken skins. The atmosphere is hip and trendy, with tight quarters, communal seating, and no reservations. The service is quick and kind. Top it all off with excellent mochi, a Japanese dessert that are tasty balls filled with ice cream.\nI was a tourist and this was the best meal of my trip.",
                "datePublished": "2016-09-13"
            },
            {
                "reviewId": "1_RmCTg508HN0RYyA0MkDA",
                "author": "A H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Good service, long lines but moved quite fast thanks to staff efficiency. They gave us complimentary warm sake shots while waiting in line. Ordered yuzu tonkotsu. Quite tasty; the broth is a bit too thick for my taste but some people may prefer it. Noodles were ok, a bit skimpy on the meat but satisfying overall. Chili sauce was more Chinese style than Japanese. It was fine but a bit of an ecclectic mix if you're expecting a Japanese ramen shop. Soft shell crab apps was very tasty & fresh; though the accompanying dipping sauce was quite odd & not a really good pairing. Agedashi tofu was quite disappointing. \nMay return but probably will try the chicken broth ramen instead and the chicken wings app (they look quite appetizing).",
                "datePublished": "2017-01-07"
            },
            {
                "reviewId": "r9OPkpe-vOG5aDfvMHgyMA",
                "author": "Tida C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Came here while roaming London on my own. It's tucked away in Soho and quiet a gem. I walked in and found that it was very busy. I'm not sure if it was due to the rain outside or if it was always like this. Luckily, since I was by myself, I was seated immediately.\nAfter much debate, I ordered the Spicy Miso Ramen. The ramen is in a very rich chicken bone broth. The broth had a padron pepper floating in it, and complimented the pork neck chasu. I've had my fair share of ramen and I really loved this ramen. I found that although it was spicy (just the way I like it), the broth was just a teensy bit sweet. Not sure if that was due to the Miso? This did not bother me though. The pork and spiciness of the broth offset that sweetness and it was very well balanced. I'd love to try the tantanmen ramen the next time I am here though!",
                "datePublished": "2014-08-28"
            },
            {
                "reviewId": "t1Gj3Dn67rs2USjT7NO8Cg",
                "author": "Paul A.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Yes the pork broth is tasty but this place is just that bit too pretentious for me.\nI asked for a side of kimchi even after being assured it would be on the side they threw it into my soup. This coupled with loud music and too cool for school waiters - there is better ramen in London.",
                "datePublished": "2015-06-11"
            },
            {
                "reviewId": "q_mnq3BZ-nDMNq-zfc029w",
                "author": "Benjamin G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Top-shelf ramen with great flavor in the broth and tender noodles as well as a diverse selection of toppings to be added a la carte or at the table. I am told by friends that I made a big mistake here by not ordering the Korean chicken wings or the fried chicken, although the salmon tartare with crispy lotus root chips and a ponzu oil flavoring was dynamite as well. I would definitely go back, although I would make sure to try the chicken next time.",
                "datePublished": "2016-09-16"
            },
            {
                "reviewId": "OB-I0MUmGLGiGlTkMZ5whA",
                "author": "Shermaine W.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I... \nI honestly don't get it. \nAfter visiting bone daddies last week,  the high praise is pretty startling to me. I absolutely love ramen, and though I've spent a few months in Japan eating tons of it,  I'm no snob. I've slurped my fair share of 89cent pre-packaged block ramen and know that hey-- there's a spectrum. \nFrom what I'd read from others regarding ramen in London,  they don't really come close to the authentic fare,  but are still incredibly delicious. So when I saw that bone daddies was super hyped here and other places online,  I was actually really excited (despite the overwhelmingly hipster vibes). In the end,  I left disappointed. \nI had the tonkotsu ramen, hyped for a punch of that 20 hour deep, rich porky flavor, but instead I got an over salty (and trust me,  I loves me some salt) bowl of mediocrity. I can't speak for any of the other dishes,  but really... Even the crazy blaring music wasn't enough to distract me from how lacking in any depth of flavor this was. Like some basic stock and noodles. It was nothing special, so for the price, I didn't feel I'd gotten my money's worth. I've still yet to try some of the other recommended ramen places in London,  but as of now,  I definitely opulent rush back to bone daddies. \nTwo stars because the egg was perfectly cooked,  edamame delicious,  and asahi flowin'.",
                "datePublished": "2015-05-11"
            },
            {
                "reviewId": "oQGNBIlylpVHsWcsvHsifA",
                "author": "Vivien Y.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "We decided to try something less formal today so we went to Bone Daddies for some Ramen.  Lining up seems to be the new trend in London.  \nTomato salad with their Japanese sour vinegar dressing was delicious. We had Tonkatsu ramen and Kimchi ramen.  The  soup base was made with pork broth that has been cooked for 20 hours, so imagine the flavour and thickness of the soup.  \nHowever, there is one thing interesting, I tasted ginger in the soup which is not the normal ingredients of Tonkatsu ramen.  I prefer the regular ones though.  \nThe seating is not amongst the most comfortable ones, and I preferred to just stand there eating than sit on those wooden stools.",
                "datePublished": "2015-07-23"
            },
            {
                "reviewId": "tDL5Th-0OHMR1RO5gtAtiA",
                "author": "Jenna S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is one of the best ramen places I've ever been to. I got tantanmen 2, a dish that promised a little spice, and it absolutely delivered. I've been having a hard time finding dishes that are actually spicy in the UK, so I was beyond excited to find one that was. Aside from that, the flavor was amazing. Just thinking about it now I'm craving it. It was perfectly creamy and spicy, and there was just the right amount of chicken. I loved my dish, but it was huge and I couldn't finish it, and I was leaving on a plane so I couldn't take it go to. I wish there were smaller portions. Also, I do prefer to not eat meat when I can, but the only broth they had was mushroom, which I'm allergic to, so it would be nice if they could get more vegetable broths. The service was also really weak despite there being 5 people working. They stood around and talked a lot and seemed kind of irritated to be asked for water or for the check. However, the food itself was so good that the rating deserves to be high. Definitely recommend this place even with the service not being the best!",
                "datePublished": "2017-12-19"
            },
            {
                "reviewId": "1-3wkjbxNIOUhCweqwY4kQ",
                "author": "Sam O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "T22 is perfect on a cold day when you haven't eaten anything all day and feel a bit depressed... in another word, this ramen is a perfect comfort food for the soul!  The service is attentive and all smile even thought it was a bit late.",
                "datePublished": "2015-08-17"
            },
            {
                "reviewId": "OkJtD42P6yA6Qjsmyi9VNA",
                "author": "Charlene L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "+ Perfect soft-boiled egg\n+ Full-bodied flavor of the soup\n+ Nice appetizers (try the spareribs, YUM!)\n+ Great touch with readily available hair ties to hold back the hair when working on the ramen!\n+ Hooks on the wall for purses and jackets!\n- The seating.. not a fan of bar stools.. need that back support\n- A bit on the pricey side for a bowl of ramen.. but I guess this holds true for all areas with not a big Japanese population",
                "datePublished": "2013-10-25"
            },
            {
                "reviewId": "vn9MSO0hJBsgF5a5DTPFkA",
                "author": "Mital P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "So, I went to Japan for a week, and stayed in Sapporo, on the island of Hokkaido. I ate a lot of ramen there.\nThen I came home and met a friend for lunch at Bone Daddie's. I didn't even know what kind of food they were going to serve until I got there. I thought to myself \"oh no, here we go, the last thing I need after a week in Japan is some hipster place pretending to be a ramen restaurant\" but I hadn't seen my friend for a while and she has good taste so I didn't kick up a fuss.\nAnd I would have been really embarassed if I had kicked up a fuss, because this place is great!\nThe ramen is really authentic, just like the stuff you'd get back in Japan. In many ways better because they have pork-free broth for those who are sensitive to it.\nFor the price they charge, you get a tasty bowl of soup, with good noodles.\nIt's just a shame everyone else in the world seems to know this and there's always a queue to get in!",
                "datePublished": "2016-04-15"
            },
            {
                "reviewId": "_2yOyDJvNO4olYpuni4vQg",
                "author": "Erin R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Confession: it's controversial, but I don't think I really like ramen. I've tried supposedly good places in the past and not been impressed so thought I'd give it one last crack at the grand daddy. Bone Daddies was actually great. I don't think I'm a convert but it was definitely good, super tasty! If you're a ramen lover you'll like it!",
                "datePublished": "2016-05-11"
            },
            {
                "reviewId": "I0OtGo3Vs4PT1T1QIyZQGQ",
                "author": "Elizabeth G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "How have I not reviewed Bone Daddies yet?\nAs a vegetarian this is my go-to ramen stop, offering an alternative to the predictable miso broths. \nBone Daddies often has a queue, in my experience Sunday lunch time is the best time to avoid this. Music is a little loud, and the high-stall seating doesn't make me feel so inclined to stay here all evening. Bone Daddies will always be a bit of an in and out affair for me. \nThe uname-rich vegetarian mushroom broth at Bone Daddies is a solid veggie alternative to the traditionally meaty tonkotsu. At around £10, the price is a little steep, but this is Soho. The mushrooms in this broth are delicious, though on my last visit I got only three pieces of tofu. Inconsistent but delicious.",
                "datePublished": "2016-06-14"
            },
            {
                "reviewId": "NlFHz3KK-CcYzpEjEp6jqg",
                "author": "Jenny M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "PROS - Absolutely loved the rambunctious music upon entering. I mean, what do you expect from such an awesome restaurant name, \"Bone Daddies\"? Very straightforward menu with great descriptions. I'm always a sucker for Tonkotsu based soups so of course I got that and it tasted dreamy. My friends got the Spicy Miso (lots of flavor, almost overwhelming but in a good way) and the T22 (a chicken broth based soup, he got it because it said \"cock shavings\" haha but my Tonkotsu still had more flavor than the T22). \nHopefully the hair ties don't get reused but that is hilarious touch. I also dig their bathrooms. \nThe ramen is solid, but could have been more generous with the noodles and broth (or maybe I'm just a piggy). I would like to try their chicken karrage next time as well. \nCONS - None really, I need to update this review once I try the neighboring competitor, Shoryu. ;)",
                "datePublished": "2014-04-15"
            },
            {
                "reviewId": "9u6dZ0UCGrIGUV8rBBTmuw",
                "author": "Taylor X.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I used to go Bone daddies regularly. I don't any more because my partner and I we pretty much foodie on the run and have this mission not to go the same restaurant again within a short period of time. But I have to say bone daddies does the best soup (?) I believe. Ramen king!",
                "datePublished": "2016-04-12"
            },
            {
                "reviewId": "mWBmgImQyJ0xG1_Fb5Rugg",
                "author": "Jenny C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Tonkatsu Ramen broth has been pretty salty the last two times that I've been here. You need water to help you finish the ramen. \nPork ribs - not much meat to the bones!\nI really wanted to like you Bone Daddies but fool me once, shame on you. Fool me twice...well you can't get fooled again.",
                "datePublished": "2016-09-19"
            },
            {
                "reviewId": "NjgcFne9luy-SKo1UopSqA",
                "author": "Valex D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ok maybe I am getting old and if I am going to eat somewhere in Soho, certain things will affect my decision regarding WHERE to go.\nBone Daddies was a must when I first arrived in London 2 years ago and I have to say that I'm still enjoying going there once a month BUT there are some Pros and Cons that I would like to share with people mid 30's like me. Let's start!\nPROS:\n- Ramen is really good, tasty and rich. I normally go for a TANTANMEN but also SOY RAMEN is lovely and the price is good (11£ or less),\n- food is coming quickly,you don't have to wait ages and there are also some nice thing on the table like elastic band for people with long hair or additional garlic, chilli and sesame.Nice!\nCONS\n- nice food = big queue. Don't think you go there on a Thursday/Friday/Saturday/Sunday evening (after 7pm) and you will get a table in 5 mins. You will get a table in 15 mins (if you are lucky...)\n- This place is really loud!Loud music playing all the times. If you are going with friends, the conversation with them could be quite difficult.\n- small venue: I think they might have 10 tables in total and quite closer one to the other so if you want a bit of privacy or having a chat (hard with the loud music playing in the background), this could be a problem.\nIn the end, I give you a 4 star my dear Bone Daddies, but trust me, you'll need to get some areas improved :)",
                "datePublished": "2016-05-09"
            },
            {
                "reviewId": "gfzqCG1jHxGpGhzRydmmvg",
                "author": "Juria Y.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "What can I say? I'd walked past this place a few times and read about it when searching for good ramen in Soho and I have to say I was pretty disappointed :( The place itself was cool, nice ambience, good decor, clean, good location.... Was quite promising when we came in, but.... The food was average... Bummer. As a general measure when I get ramen, I always try the tonkotsu... If the place can make a good flavoursome clean tonkotsu then it's gotta be a bangin' place... Sadly the only thing good about this tonkotsu were the thin yellow noodles.. The broth was way too fatty and 'creamy' in a not so nice way as the flavour lacked depth and seasoning. You have some egg in there and a couple of slices thin pork. For the price you pay and the lack of real tonkotsu flavoured broth you're better off going to a Shoryu chain or even Wagamamas and that's saying something 'cos they're average too. The food also came out super fast which was a little concerning. Service was inconsistent depending on staff. Hmm... I feel bad to give them a dull review but... Maybe I'll come back and try something different...",
                "datePublished": "2016-04-20"
            },
            {
                "reviewId": "900s_l5uiURHxhqrhwY5_Q",
                "author": "Camie T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Oh, gosh. Three stars at best. Two stars at worst. Let's settle with three because the service was really something special.\nI think part of the problem I am going to have with all ramen shops in London is that none of them are going to match the ramen I ate in Tokyo a handful of months ago. It's just not going to happen. Plus, diners are waaaaaaayyyyyyy too politically correct with how they eat a bowl of Ramen in England. Please, people, just shove your head into the bowl and slurp those noodles up into your mouth. \nMy husband and I started off on a good foot. We popped in at prime dinner time and were seated straightaway at the bar in front of the windows. I liked the curtains hung on the entance, very Japanese. I ordered a Berry Berry Somethingorother which was made of gin and had a fresh raspberry in it but I wasn't wowed by it. I mean, it was OK but nothing special. I was more wowed by the fact that such a fancy cocktail was served to me in what is considered a fast food shop in Japan.\nOn the table was:\n-a bottle of fresh garlic cloves and a garlic press\n-chopsticks, napkins and bibs (happy I brought my own fork, BYOF)\n-a bottle of hair ties (yes, like to tie your hair back into a ponytail)\n-various sauces like soy and some chili-based looking sauce\nWe ordered the fried chicken, the T22 and a second kind of ramen which fails to come to memory at present. The fried chicken came in a little stainless steel bucket and looked a bit like popcorn chicken but larger pieces. Some of the pieces had been sitting underneath the heating lap for an extended period of time because they were cold and chewy. Other pieces were hot as though they just came out of the fryer. I remember commenting, \"I'd rather have wasted these calories at KFC).\" So, there's that.\nMy ramen, the T22, was not super great or even great. Now that I think about it, it wasn't even that good. I highly disliked the crackling. The noodles looked like they came out of a packet. The chicken was sparse. And, in general, it just was not my cuppa ramen. Also, as an added bonus, I started burping up the broth about 30 minutes after eating.\nPerhaps it my ramen selection that literally left a bitter taste in my mouth or perhaps Bone Daddies just doesn't have as great of ramen as claimed. Either way, there are too many other ramen shops in London to try before returning to Bone Daddies.",
                "datePublished": "2015-07-01"
            },
            {
                "reviewId": "8kwxQRw2Ld62vm3gfEqKMg",
                "author": "Heather P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Nom. Just, nom. \nThe tonkatsu ramen is delicious. Perfectly cooked noodles, broth so thick and pork bone-ish it's almost white. The right amount of spring onion, bean sprout, crispy garlic slices, bamboo shoots, and a little picked ginger right in the middle. Perfect eggs, perfect slices of pork. Topped off by a little house chili oil sauce, and wow. I ate the whole bowl and would have licked it if I could have fit my face inside. \nJust noticed I used the word \"perfect\" three times! So it's just not getting that fifth star because I think £11 is a bit much, and a pint of Asahi for £4.5 is a bit steep too. A beer and a bowl of (admittedly totally delicious) ramen coming out to £16? I happily paid, but secretly wished was more like £12 (£9 for the ramen, £3 for the beer) - then it'd get 5 stars. Perhaps I trifle. \nAnyway, as I said, nom.",
                "datePublished": "2013-06-14"
            }
        ]
    },
    "80": {
        "id": "_2XoQQKE0AXHgmbONR-5mw",
        "name": "Bone Daddies",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Soho",
            "streetAddress": "30-31 Peter Street\nLondon W1F 0AR\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UUBXhkhhCHFeYv3HAB9ZoA/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7287 8581",
        "review": [
            {
                "reviewId": "bKPvp1gxb_fKVBP8XLudTQ",
                "author": "Jeanne-Marie B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Bone Daddies is surely my favourite restaurant in London to eat ramen. I love them all, but I have a little favourite : the Tonkotsu ramen. All the broths are delicious and very tasty. \nI go to Bone Daddies at least once a month if not more.\nMy friends and I shared tenderstem broccoli and fried chicken while we were waiting for our ramen to be cooked. The broccoli were nicely cooked but none of us liked the sauce served with it. We didn't think it's taste went well with broccoli. Instead we ate them with soy sauce. The Fried chicken were good and tasty. I liked the fact the batter was not too greasy and slightly spiced.",
                "datePublished": "2015-08-12"
            },
            {
                "reviewId": "kj54Fsu1exVcOezZckXfhA",
                "author": "Chris P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The agedashi tofu is one of the best I've had outside of Japan. The soyu ramen was also on point. However, please please PLEASE train your staff to know what \"togarashi\" is when I or anyone else asks for it. I speak pretty good Japanese, but asked for it in English multiple times. Only the Japanese member of staff knew what I was after and brought it. In Japan, it's on the table in every ramen shop I've been to. Consider putting it out to avoid this problem.",
                "datePublished": "2017-11-02"
            },
            {
                "reviewId": "eaBQ1dR7FiTp44ObMIAmvw",
                "author": "Kelly R.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Bone Daddies is okay. My friend and I both got the tonkotsu ramen. While the broth was okay, I thought it could have used more flavor, and I thought the noodles themselves were pretty basic. The pork, however, was great!\nI think what it comes down to is this: Bone Daddies is more of a trendy, hipster spot than an authentic ramen joint. Great if you're looking for the former (this is the kind of place where your menu comes on a clipboard) but a bit disappointing if you're looking for the latter. Maybe they make up for it with the free hair ties?",
                "datePublished": "2015-06-17"
            },
            {
                "reviewId": "7nG3uVqVA2nkWJ0Ad5B0eg",
                "author": "Laura S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Really, really, really good ramen and stupidly long queue - even on Mondays.\nI completely buy that ramen places are supposed to be quick eats - order, sit, eat (slurp) and leave - but that's in Japan, where awesome ramen places are at every corner, not in London where delicious ramen with amazing broth and plenty of seafood for a good price - is a rarity. They should definitely open another branch - one of this is just too little of goodness.\nCrammy inside, so don't expect fine dining, but then again - it's soul food! So, come in, enjoy, slurp as loud as you can (that shows your appreciation for the chef if they did a good job) and LEAVE. Don't sit and chat - let others enjoy this too (and not stand outside waiting for you to finish... yes. Even on Mondays.)",
                "datePublished": "2015-04-10"
            },
            {
                "reviewId": "YECj1c7FDAI2x_79s6r_XQ",
                "author": "Ela T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I must admit I've become disappointed in this establishment now. \nMy mum was visiting for lunch and I missed their yummy perfectly cooked egg and thought I would take her there for a treat.\nYes it is lunch hour and yes it is busy but this is a ramen joint, you know, something where they have the broth pre-cooked and they just dump the noodles and remaining ingredients in to complete the meal?\nWe waited 20 minutes for the starters. We ordered soft shell crab and a pork/corn croquette. After 20 minutes I complained, I said where is my food? My lunch hour ends in 20 minutes! Waiter went away and then started serving other people.\nAt this point the starters got delivered. Flagged down another waitress and said I wanted to complain that the 3 different groups who arrived behind us got their STARTERS AND MAIN delivered before us. She explained our starters were fried so it takes longer.\nWhat? Frying food take longer than regular food?\nRamen came with the original waiter. He explained because there was a big group and because it was fried it took longer. I said well then you should have told me frying food takes longer and I would've just told you to bring me the ramen first! He said he didn't know we were in a rush. Mate, I came here before, I didn't need to explain I was in a rush, the food arrived at decent intervals!!!!\nI was speechless. It's lunch hour in the middle of Soho which is pretty much surrounded by working types yes? We are not in the suburbs here! I was too shocked to speak and my face must have given away a million words. He explained the croquettes were on the house. \nPAH.\nBecause of this farce the food tasted horrible and tasteless to me. I was in no mood to enjoy any of this. We had about 7 minutes to chow down the ramen and pay and leave. I was late back to work anyway.\nI'm not coming back. Don't do lunch hour if you can't handle it. \nI actually just remembered the same thing happened to me at Flesh n Buns during lunch. My colleague and I ordered 4 starters and 2 mains. After 20 minutes we chased and 2 starters came. After 20 more minutes the other 2 starters came. We had 10 minutes to make main course and run back to the office. They didn't have a takaway licence. We ended up paying for 4 starters and eating instant noodles at the office. The place was empty mind you, it's not like they had a full house to cook lunch for.\nDEFINITELY do not come here if you don't have more than an hour spare.",
                "datePublished": "2015-04-30"
            },
            {
                "reviewId": "3JxOtGltpMnnAlk0xgGFDg",
                "author": "Francis H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I'd like to give this place 3.5 stars. I usually like to try a popular ramen spot whenever I travel to a new city. This place satisfied my craving and was pretty decent. \nI got the Tonkatsu ramen with extra egg. The eggs were exceptional! On par with the eggs at Ramen Dojo in LA. The problem was that everything else was mediocre. The noodles were thin which I tend to dislike in Ramen (but that is personal preference). The broth did not seem to have a very distinctive taste and the slices of chashu were pretty thin. \nIf this were my first point of reference for ramen I think I would walk away pretty happy. This place is not bad but also not really distinctive if you have tried other ramen.",
                "datePublished": "2016-09-06"
            },
            {
                "reviewId": "idx73ISZer1Sa1i2_GL_1Q",
                "author": "Natasha K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Quite a nice ramen joint, in a fantastic location, and thankfully, is open quite late on weekdays.\nI'm not in raptures about it, as I've had better ramen in both Japan and Australia; but as far as pork tonkotsu goes, I would come back for this one. The noodles were quite thin, but they were tasty and filled the bowl with deliciousness. And I'm pretty sure I added a couple of extras... It's not cheap, but it's not expensive for London. Give it a shot!\nThe apple cider was also quite tasty.",
                "datePublished": "2016-10-05"
            },
            {
                "reviewId": "Xnfu3Zce47pM4SGD7z0ezQ",
                "author": "Heena W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I loved the ramen here! Fantastic, To be honest, one of my favorite even though people swear by Kanada-Ya or Shoryu, in my opinion this place trumps them of all. Great creamy tonkotsu and best of all Asahi on tap which tasted that much better with a creamy lip on the pint glass. All in all my favorite ramen place in London, worth a try! Their sides are also good, but for us 2 big bowls of ramen were enough! be warned, it gets very busy and its not uncommon to wait 30-40 mins for a table!\nThe service is great, even when it is very busy service is attentive and helpful. But most important is the food.",
                "datePublished": "2016-03-21"
            },
            {
                "reviewId": "fH5jquncGoUc4XsX4p_QQA",
                "author": "Erica U.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Didn't have the ramen but really enjoyed the starters. firstly, its totally not baby friendly as far as tables and stuff but the staff really handled a fussy baby well. Thanks ladies and gents!\nWhen one has a fussy baby only a cocktail can curb the angst. Too bad they were out of the watermelon juice.  That sounded amazing. Instead I had what tasted like a 'porn star' minus the champs. The passion fruit drink was still yummy. The dza had the 'mule' and liked it very much. \nWe tried and loved the fried chicken which so happened to be baby's first taste of chicken and she loved it too. \nThe yellowtail sashimi reminded us of our favorite dish back home so we were more than pleased to see some jalapano on the plate. \nThe soft shell crab was pretty bland and i'm actually n ot sure if it was cooked all the way through, but we still ate it. was ok, batter was like, and the dipping sauce was ok. Just an overall meh dish. \nBut I really really enjoyed the food that we did try and will most def go back for more.",
                "datePublished": "2015-04-25"
            },
            {
                "reviewId": "ZLjHZk753oBDMtUC_kSJ9g",
                "author": "Geoff Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I love this place, I really do and the only reason why I knock it is that it's a lot of money for what amounts to a bowl of ramen. I went for lunch with my mum and my sister (a quick lunch mind as it was a workday) and our total bill was over £50.\nThat said, it is damn good ramen, having tried Shoryu and Tonkotsu, it is, in my opinion, the winner in the area. Get there early, there aren't reservations and it's all communal seating. If you're a big party you might even lose your place in the queue as smaller groups are seated where they can fit.\nMy sister loved the fact that they had a) plastic bibs, and b) a little bottle of hairbands for tying back your hair so you didn't eat it while you slurped your noodles. And you want to slurp your noodles. Ramen arrived quickly along with a single order of croquettes and we went to town. If your noodles don't come with an egg, order the egg as an extra, it's worth it. 2 Tonkotsu and a Tantanmen were ordered on this day and the bowls went down a treat.\nGet there early, sit and enjoy your noodles and then make way for the next customer. A long drawn out meal this isn't!\nI'm going to um and ah about this one for a while but yes, for now, Bone Daddies your are a solid 4 out of 5. Who knows, I might upgrade it later.",
                "datePublished": "2015-04-13"
            },
            {
                "reviewId": "KDZ-TGkF_3svUIfNbz2esg",
                "author": "Josy A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Yay!! London seems to be getting better and better at ramen!! Finally!!\nI have been excited about Bone daddies for aaaages! I've been following them on twitter and drooling over the photos...so I had high expectations that this would be a decent ramen venue. It seems like other yelpers had the same idea as we had the biggest turn out ever for a ramen club! Thank you all for joining me!!\nOn to the noodles:\nOh my goodness the tonkotsu ramen made me happy! The soup was rich, creamy and you can tell those bones have been brewing for a looong time. I initially thought there was not quite enough broth for that number of noodles, but actually it was all so rich that I found it difficult to finish it all.\n- Soup = Gorgeous...now I want to try all the other flavours\n- Eggs = Cooked to perfection with squidgy middles and well-seasoned\n- Meat = Fatty, full of flavour and so tender that it falls apart on your chopsticks\n- Extras = It was good that you can add extra garlic...and I shared some of Rob's extra pipette of fat. Yum\n- Noodles = Perfect\nThe staff were complete sweeties and coped well with such a large group.\nThe only let-down for me was the karaage chicken...the taste was okay but it wasn't crunchy (maybe they made it in advance and reheated it???) \nThe drinks were also a bit pricey... over £8 for ume-shu!? wha!?\nHowever these weren't big enough gripes to detract a star, so I think I have found my new favourite ramen shop.",
                "datePublished": "2012-11-07"
            },
            {
                "reviewId": "lKU5T8n6YDCRgYwUi8w8oA",
                "author": "Aditi P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Highly recommend this restaurant for your Ramen fix if you're near SOHO. It offers a nice selection of ramen options, with new 'daily specials.' \nFried Chicken 7/10 (tasty, well seasoned)\nEdamame 7/10 (great starter, quite small)\nIP Tonkotsu Ramen + egg 8/10 (very flavorful & filling)\nAssorted Mochi 9/10 (favorite was sesame & chocolate)\nMake sure to arrive before 7pm to avoid the long lines!",
                "datePublished": "2016-10-22"
            },
            {
                "reviewId": "OnS9kLB9i_SJlDusqYI_8w",
                "author": "Samantha M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "So it's a good place on the cheap which means no reservations and just work on luck. We found a table and I ordered Korean chicken wings, this is more of a tomato based chicken wing and not authentic Korean wing but tasty anyways. The ramen, so I ordered the pork and found that the base stock was rather salty and very thick. I think I will just select a miso base next time. Good drink selection.",
                "datePublished": "2016-05-29"
            },
            {
                "reviewId": "aeV4YkF-lYl8u-8Y_6QtHA",
                "author": "Daniel F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Bone Daddies. Well the name alone should have perked your interest. In cool spot within Soho this Ramen spot is uber trendy. Certainly judging by the queues and type of people you see in it.\nThe Tonkotsu Ramen is my personal fav, with its 20 hour pork bone broth. Corr blimey it's good. Seems to be a trend to outdo each other with how many hours you can make that broth within Ramen places but let me tell you it makes a difference.\nI also really like their fried chicken. And you can't go to a Japanese without getting the chicken. Though I prefer the proper term Karaage Chicken.\nNext time I will come purposely a little drunk and for their late night menu. 10.30pm-11.30pm they have a great deal for 2 courses and a whiskey cocktail for £15. Banging!",
                "datePublished": "2015-12-10"
            },
            {
                "reviewId": "xU6JzYRGCNYECHTwvmKRgQ",
                "author": "Natalie W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Calvin T recently reminded me I haven't tried Bone Daddies so when I unexpectedly had a case in London I seized the opportunity to take my bff along for some ramen. We're big Koya fans but Bone Daddies is equally as good, if not quite as zen (and of course the menus are very different).\nWe had some delicious sake to keep us warm in the queue and then were ushered to some of the best seats in the house (near hooks for hanging coats! joy!) where we were swiftly served with drinks and our fantastic starters - soft shell crab and tenderstem broccoli with their respective sauces were absolutely top drawer. We were surprised to discover the sauce with the broccoli is made with a Japanese citrus fruit - it's hard to describe its unique flavour but that's not what we would have guessed. The fiery green pepper/jalapeno based accompaniment with the soft shell was also unusual and a great match.\nRamen was outstanding. I followed Yee Gan's lead and had the tantanmen - it's fiery kick caught the back of my throat more than once, which was awesome! My bff also loved his tonkutsu ramen, he drained the bowl in about 10 minutes.\nService as I said was swift but also friendly and enthusiastic with the staff despite how busy it was taking time to explain the sauces to us and not rushing us out despite me taking forever to eat my ramen (it really is filling!).\nFinally, at £11 a bowl this is perfectly priced - for the quality of the food it's excellent value.\nExcited already for my next visit!",
                "datePublished": "2014-11-07"
            },
            {
                "reviewId": "eOeenLr2ee-b1a-F45JY5g",
                "author": "Rene H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Learned of Bone Daddies on IG and figured I would give it a shot while I was in London. I ordered the tonkatsu ramen which is typically what I order when first trying a ramen shop. The ramen noodles where good but nothing amazing the broth was thick but I didn't find the flavor I know and love. When I go back to London I would stop by again and try something else on the menu as well as grab a couple bottle of Asahi Super Dry Black so good!",
                "datePublished": "2016-06-24"
            },
            {
                "reviewId": "3PTvczgyPTX1zjeRmlb1kA",
                "author": "Axelle A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Be ready for this hipster ramen experience. Bone Daddies has arranged the perfect union between an hipster atmosphere and quite authentic ramens. \nI hate the food fusion but mixing atmosphere with (good) food is fine. To the ramen, Bone daddies has added this typical low-light, hipster-waiters with beard. The only Japanese elements I spotted in the interior was a photo of the Yoyogi park where Japanese dance disguised as Elvis - indicating which bathrooms were for women or for men (which did not seem obvious to everybody though).\nAnd as the food was indeed very good, let me add a few word on what matters the most in the end. For appetizers we had CHASHU PORK & CORN CROQUETTE which was a rather random choice but it was a very good pick and I highly recommend you to taste that: we were really surprised. For ramens, i had the \"T22\" (they were really inspired on this one or maybe I miss the reference) and the broth was really really tasty. Hipsters do know how to make ramens, they are evolving.",
                "datePublished": "2015-03-26"
            },
            {
                "reviewId": "7zoQ8TXAiyqEtE7uQi0oag",
                "author": "Jack J.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "If they want to open a pub-like Reman restaurant, they really need to think twice as sometimes innovation could just go south...\nThe taste of Reman was even worse than fast noodles... The noodle was too soft and soaked too much... The soup was just too artificial and the taste was bad...\nIt's better if its just a bar for a drink...",
                "datePublished": "2016-04-24"
            },
            {
                "reviewId": "lwFiPYptQMTgZE35mBBTBA",
                "author": "Mashael Z.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Bone Daddies' steaming ramen \"hug\" (as the waiter charmingly put it) is lovely on a cold, wintry day! I am a ramen newbie and this was my first time having authentic ramen (Wagamama's doesn't count!) and I wasn't sure what to expect. \nWe started with the salmon sashimi which was so pretty and delicious! It came with bubu arare (puffed rice balls, I've never had them before but I love them!) ponzu sauce, and coriander and was so so yummy! I am a big salmon sashimi fan and I think this was actually my favorite part of the meal:P\nI ordered the tantanmen 2 ramen with chicken broth, which was one of the only two options without pork on the menu. I found this a bit limiting, but I'm told that in the future they will have some beef broth options. My friend got the miso broth and enjoyed it a lot. We also admired the cute logo of the place and the interesting name (it fits so well! what a neat place!)\nWhen my tantanmen arrived I wasn't sure what to expect with my first real ramen, and my first impression was that it had quite a kick! The broth is spicy and much thicker and creamier than I expected. After a few sips I got used to the spice and enjoyed the intense flavour it gave the ramen noodles. I was skeptical about trying the eggs at first since I am not an egg person, but they looked so good sitting there with their melting yolks that I had to try it and am glad I did. They are as silky as everyone here is saying and the perfect ramen eggs. The noodles and chicken were good and the few random pieces of bamboo. I think for a first timer, I found the broth too rich and heavy to drink it all but I enjoyed the half of it I managed. \nThe service was friendly and very helpful. The place itself is probably hipster heaven with a long line of cold people waiting to get into a very busy and tiny place. I am still not a huge ramen person because the broth takes getting used to, but it is comforting in this weather and I look forward to coming back another freezing day and trying the fried chicken appetizer too!",
                "datePublished": "2012-12-01"
            },
            {
                "reviewId": "cWSH2dKEj_cWak_wxsyAgg",
                "author": "Jocelyn T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Meh. I'm surprised this seems to be the best London has to offer. Got the IP Tonkotsu. The broth had a rich creamy flavor but was VERY salty with little depth of flavor. The \"spicy\" IP sauce was anything but spicy. Could have done with a bit more chashu and some more varied ingredients. They also use thin, straight vermicelli  noodles, which is not necessarily bad, but it didn't satisfy my craving for springy wavy style egg noodles. Our waitress also disappeared completely after dropping our bowls which was a bit annoying. \nThat said, it wasn't the worst ramen I ever had. The chashu was good and overall if you're craving ramen you'll be ok here. They also had a huge selection of toppings on the table-- crushed sesame, fresh garlic with a garlic press, spicy sauce and vinegar. I was really impressed with those options.",
                "datePublished": "2015-12-23"
            }
        ]
    }
}