{
    "0": {
        "id": "rAAuLQbWTVZlfJcufwwdDw",
        "name": "Tokyo Diner",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "2 Newport Place\nLeicester Square\nLondon WC2H 7JP\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/RvIBiv2XKnxHUDScvGMk8Q/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7287 8777",
        "review": [
            {
                "reviewId": "B7nVHEUefQKLyRGB8uyIZg",
                "author": "John D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Went for lunch nach with a colleague. \nStaff is probably Japanese. \nThey have a live stream of a camera on their website which makes it easy to check how busy they are. We went on a Thursday and is was rather quiet. \nFood was good. The portions are pretty good and you get extra free rice with some dishes if you are still hungry but is is not necessary. \nI would go again.",
                "datePublished": "2018-06-14"
            },
            {
                "reviewId": "-MrFmcD5t5Pwbi4AIOJAlQ",
                "author": "Tove B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "If you are a fan of noodles, this is a prime spot. We had the Udon (tofu) and Soba (chicken), and now I'm hooked. This visit was really worth the cost: We had sashimi, beer and noodles - total cost 38£! Also the green tea is really nice and refreshing. Service was very quick and polite as well.\nThe place looks a bit rough, but don't be dissuaded. The food is yummy.",
                "datePublished": "2018-08-01"
            },
            {
                "reviewId": "CSdv8QcrY_jeKRRpfl_DRQ",
                "author": "Rachel K.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I've had better, but if I lived in London, I'd be a regular.\nWhat I liked about Tokyo Diner was the interior design of the restaurant. When inside the restaurant, I really felt like I was in Japan. I didn't get to see the second floor, but the first floor is very cramped. I had to wait outside the restaurant for about 20 minutes.\nI got the gyu don, and it wasn't too special. I am huge tofu fan and I enjoyed the age-dashi tofu.\n-- \ntaste / 3\naesthetics / 3\nvibe / 4\nservice / 4\nprice for quality / 3\nOVERALL / 3.4",
                "datePublished": "2017-11-05"
            },
            {
                "reviewId": "GC7lR1Gao5OcnqLH3p9ngA",
                "author": "Elizabeth W.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Dined here with my family last night .... positive reviews on Yelp. We were tired after a long day of touring. This spot had such positive reviews on Yelp and it fell SO FAR SHORT of our expectations. Pros were quick service & good green tea. Cons were the food ... ordered the Chicken Katsu Bento ... fried, breaded chicken cutlet - dried out, no flavour. My sons had the Chicken Teriyaki... soaked in sauce. Husband had the Salmon Bento - better. Seafood salad was forlorn & limp. Chicken was dry and without flavour. Cold, cooked veggies accompanied the meal and had an odd taste to them. Beyond disappointing.... DON'T GO. A disappointing & a disastrous food experience.",
                "datePublished": "2018-06-17"
            },
            {
                "reviewId": "0f9CBwtc3iCFA0nBEJZvFg",
                "author": "Jessica K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I'm shocked I've never written a review for this place before, but seriously my favorite Japanese restaurant in London! It's one of my priorities to eat here at least once during my stay, and been here more than I can count even before it became so popular. Definitely happy for their success!\nTypically I always order the salmon don, but I've tried the salmon bento box as well and thoroughly enjoyed both. I had ordered the crispy tofu, which was so fresh and silky! Amazing!!!!\nThe restaurant offers authentic Japanese cuisine as well as the tradition of not accepting tips, which is pretty cool. Feels like I've been transported straight to Japan!\nMy favorite restaurant!!! Try it!!",
                "datePublished": "2017-01-27"
            },
            {
                "reviewId": "s6r_PkXgn70KY9_bdIyOkg",
                "author": "Clèm B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "An amazing and real Japanese restaurant! I really feel like I was back in Japan\nThe restaurant itself is really small but feel comfy and welcoming, especially on a cold day. The atmosphere and the decoration really reminded me the kind of restaurant I've been on a weelky based when I was living in Japan.\nThe service is nice, quick and they're paying attention when you need more water or warm tea.\nThe food itself was delicious and as good as in Japan! I ordered the chicken katsu don: it was big and fullfill and warm, exactly what I was expecting !\nI totally recommend this place for people looking for real japanese food and for Japan's restaurant atmosphere. Of course it's much more expensive than the same in Japan but, the price worth the quality and these real japanese culinary experience.",
                "datePublished": "2016-11-07"
            },
            {
                "reviewId": "wKkh-vjICJiwAAihMKH5eA",
                "author": "Seo Young M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Real Japanese home food! Feels nice and cozy and would love to come again to try other menu!",
                "datePublished": "2017-04-12"
            },
            {
                "reviewId": "bm94vIcf2t_78X7rMLb2Jw",
                "author": "Sanj M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This place has become a reliable choice for me - not somewhere I'd travel into town for specifically but perfect for a reasonably priced meal in central (usually pre/post cinema nearby!).\nMy mister loves it, I think because you can order an extra large 'omari' portion of rice for free if you're feeling hungry (which he always is). I think we both also appreciate its simplicity, with basic wooden furnishings and straight-to-the-point staff, which I guess lends it authenticity. There's also something endearing about its no-tips policy which I'm told is the norm in Japan.\nIt's a menu of no-frills Japanese dishes and I usually go for one of the donburi bowls which I find quite filling (and the boy usually finishes mine too). He's quite fond of the chicken katsu curry too, and we usually pair it with mugs of hot green tea. The food is nothing particularly creative then but executed well.\nIt's not the cheapest at c£9-10 a main but very reasonable for the area, and with the added perks of speedy service and a haven from the crowds (esp if you sit in the quiet basement area). Recommended if you're craving an asian food hit in the area - I know we'll be back!",
                "datePublished": "2017-02-21"
            },
            {
                "reviewId": "-Rw5mnT3AkZ--7n2BCLmTw",
                "author": "Kyle S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "There was a wait early on a Weds night. This had to be a good sign of greater things to come. After our twenty minute wait, we got seated in the downstairs dining room. We ordered Katsu don and the spinach with sesame seeds. I have to say that this was the best katsu don that I have had in a long time. And it was wonderful to be served Japanese tea and for it to be refilled constantly throughout the meal. This meal was thoroughly enjoyable!",
                "datePublished": "2017-10-07"
            },
            {
                "reviewId": "YYHFzNAd2f2fItg4PkqHig",
                "author": "Luis M. F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Fantastic place, tried a bit of everything. Drinks wise: the plum wine's delicious, but very strong and sweet and the Asahi beer is fantastic, but it's a bit dry, so take that into account.\nAs for the actual food: we had a Bento box, which was larger than it seemed from the pictures, the salmon which has absolutely delicious, the rice tofu which also served as a great starter and a salmon sushi set with two nigiri which hit the spot. \nThe waiter was terrific, very nice and prompt with fast service. I can confirm that you get free green tea with refills and snacks, and absolutely no tips. Great Japanese vibe to the place as well, feels like a corner of the country right there near Leicester Square. Absolutely delighted with the experience. We came out full and satisfied and what we paid was more than fair!",
                "datePublished": "2017-07-09"
            },
            {
                "reviewId": "FEzohSQspVdEsw0_Czn0dg",
                "author": "Carrie U.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I was skeptical about eating Japanese food in Chinatown, but I was pleasantly surprised. They have a pretty limited menu but do cover the basics. I ordered zaru udon and chicken karaage. The zaru udon was average. The chicken karaage looked really ugly but ended up being moist and tasty. \nIt is higher than my standard of normal pricing for Japanese food, but for the area seems average. \nSeating is limited but there is a downstairs section if you're not picky about being able to see out a window.",
                "datePublished": "2016-01-02"
            },
            {
                "reviewId": "VCHYORf6T-gqIYogo9C0yw",
                "author": "Alison H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love this place. Despite a fascination with Japan I've never been and this place really hits the spot. It's very affordable and has a minimalist atmosphere. The food is truly Japanese dinner food it's not fancy but it's very well made and tasty.",
                "datePublished": "2018-04-28"
            },
            {
                "reviewId": "URe_7yX6S2LevDXAxqJzcg",
                "author": "Daisy C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Decent place to get Japanese food. They offer complimentary tea and snacks. They have a wide selection of Japanese food. Service was also great. They donate all \"tip\" to charity ehich is a very good cause.",
                "datePublished": "2016-10-29"
            },
            {
                "reviewId": "8hC_dMg0Mycr2NutHFQD6Q",
                "author": "Brandon C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Stopped using Yelp for a while after returning to the States, but I saw this partially finished review and it brought me back to my experience of the place. \nFood: We had the Tofu Don Ju, Katsu Curry, Nigiri Set, and Wakame Green Salad. All of the food was pretty good, although I wouldn't say it was amazing. Definitely check the place out and try their food, but don't expect anything gourmet.\nService: This place has absolutely amazing service and I love their tipping policy. They were extremely fast with taking out order and were always available to help us out. Our tea was never empty because the waiter always refilled it for us when it got low. As for their tipping policy, the waiters don't actually accept tip. Rather, all tips go to a local homeless charity. To me, I think that's a really nice gesture for the restaurant to its community.",
                "datePublished": "2018-01-05"
            },
            {
                "reviewId": "1Q66vVeeK40QOgDzIzvSVQ",
                "author": "Ed T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "You've likely walked past Tokyo Diner a dozen times and never thought twice about it. It's the fun looking Japanese restaurant in the middle of Chinatown, and to be fair, you've probably been walking to a Chinese restaurant when you have actually gone past it, so fair enough if you haven't been in. \nStop! Go in. Eat. Enjoy. \nTokyo Diner offers some truly authentic Japanese food, with great service and atmosphere. The dishes on offer are exactly like what I saw on offer while I was going through Japan, and it was great to see such traditional dishes like cold noodle dishes or the simple tofu side dish with spring onions and ginger.  \nIt's not exactly the cheapest restaurant, both in Chinatown or for Japanese food in London, but when you consider there's no tip asked for, green tea is included and the food is great tasting (plus you can order extra rice for free), there's not much you can really complain about!\n4 stars overall for great service, great food, but not the best nor cheapest!",
                "datePublished": "2016-07-29"
            },
            {
                "reviewId": "5Z60FmBG-UBME2Ivlp3eRA",
                "author": "Billy S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I really like this place. It's cheap and cheerful. It kind of reminds me of being in Japan too.\nIt's reasonably priced given its location, with bento boxes ranging from £12-20. While the quality is not the best of the best, it delivers. The service and food is quick and efficient too.\nI was also surprised by how tasty the sashimi was. There might be a wait though as this place is small. Oh and the Szechuan place next door, Baiwei is very, very good! I once did starters at Tokyo Diner and main courses at Baiwei.",
                "datePublished": "2015-06-05"
            },
            {
                "reviewId": "MNg5a-AMTl_lfR8Ac0fApg",
                "author": "Kirsty H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "A consistent performer! This is a restaurant you will want to keep coming back to! \nThe restaurant is set on the ground floor and basement and can get packed very quickly. But don't worry, you're likely to get a table from my experience.\nThe staff are always happy to serve and the food is prepared in good time. The food is always outstanding and I don't have a bad thing to say about the place - so what are you waiting for?",
                "datePublished": "2016-02-04"
            },
            {
                "reviewId": "xOlcXw4Ap9fSCkpx7RebmQ",
                "author": "Heather W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Very good food, good portions, and great prices. \nWe were promptly greeted by a friendly hostess, and our party (including children) were seated in a nice corner table. Shortly, free green tea, and crackers arrived while we reviewed the menu. \nAuthentic Japanese items are abundant throughout the menu, however you can tell they are accustomed to different taste choices (or picky little kids). You can simply pay 70p to change from bone in chicken to boneless in some of their dishes for example. We were not rushed to finish our meal, only asked if we needed anything every little bit. They don't take tips, but you wouldn't know that given the attentiveness of the staff. \nWe will be back!!",
                "datePublished": "2016-06-03"
            },
            {
                "reviewId": "DN0mL9PlJumj6r8qKTFNgA",
                "author": "Alaine H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good Japanese restaurant in Chinatown. I had a craving for pork Katsu curry on a rainy day and looked on yelp for recommendations. This place received quite a lot of good reviews. The place is no frills and simple service. You can let the server know whether you want more or less rice. I asked for less rice because I don't really eat much rice. The Katsu curry came with a side salad which is nice because I have to consciously order a side of veggies or a side salad when I'm traveling and living out of my suitcase. Portion size was still big, taste was good, and price was affordable.",
                "datePublished": "2016-11-22"
            },
            {
                "reviewId": "lB-RwUgUPy44SN08iCPhpg",
                "author": "Dominique R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I popped here before a yelp event for a quick bite to eat and was really surprised by this place! There weren't too many vegan main options, but most side dishes were suitable and not too pricey so you could get a few. I had the hiya yakko which is a chilled tofu cube. A great big chunk!! It was plain, but lovely and fresh and i ate the whole thing up. I also had the veggie maki, which was six pieces of sushi with cucumber and six with Japanese radish. Yummy and veryyyyy filling. The prices here are quite random. Veggie dishes are generally cheap, but meat ranges from reasonable to pretty pricey. One of the many benefits of eating vegan =p\nThis place is interesting as a business as they are focused on using sustainable produce and give lots of information about their principles on the menu, which I thought was really cool. Their website is also interesting as it has a live webcam of the restaurant, which they say they use to attract potential staff and chefs =] very different!",
                "datePublished": "2016-08-16"
            }
        ]
    },
    "20": {
        "id": "rAAuLQbWTVZlfJcufwwdDw",
        "name": "Tokyo Diner",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "2 Newport Place\nLeicester Square\nLondon WC2H 7JP\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/RvIBiv2XKnxHUDScvGMk8Q/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7287 8777",
        "review": [
            {
                "reviewId": "JnrFse-SPcHmg7bXJ7b_AQ",
                "author": "Ruby K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great Japanese food, nice staff and an okay environment.\nWe waited in line for about 10-15 minutes before being seated.\nWe ordered quite quickly, and got out food in pretty good time.\nThe food itself was really great, I wish I'd order more.\nI got two side dishes (as I didn't think I was going to eat that much) and my partner got a main course.\nWe both had miso soup which was brilliantly made, and quite a big portion.\nThe prices were a bit high, but we were happy to pay due to the quality of the food.",
                "datePublished": "2015-09-11"
            },
            {
                "reviewId": "e2YXfTh4X4ioOeMVEc44RA",
                "author": "Jenny M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "If you are exploring Chinatown, this place is hard to miss. Husband and I decided to share a bento as we wanted a light snack (but weren't starving). We ordered their teriyaki chicken bento and paid extra for substituting the thighs with chicken tits. \nThe neat thing about ordering here is you can ask for a bigger portion of rice at no extra charge. We did that and even though the portions were good, everything was so bland. From the teriyaki chicken tits to the assorted marinated veggies - ehh. Really fresh sashimi though. Good presentation but probably will venture off to try another place for Japanese bento. \nSide note - if you bring in bubble tea from another place, you cannot consume it in the restaurant. \nSide note 2 - The black shaped large ceramic spoon in the center of the bento holding three green beans is not to be used as a spoon...oops.",
                "datePublished": "2014-11-06"
            },
            {
                "reviewId": "0pXpV5v23QULz8-yFI_39Q",
                "author": "Elisabeth C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I really like Tokyo Diner. It's by far the best affordable Japanese restaurant I have visited outside Japan. I will admit that having first tasted Japanese food in Japan, I'm truly spoiled and have always found it hard to find the same level of excellence elsewhere. The vibe of this place reminds me very much of Japan though and that adds to the experience.\nI have been here on three occasions and would definitely return. I tried the bento box with salmon the first time and thought it was definitely worth the value. The next times I tried the sushi (simply delicious) and a good bowl of curried udon. The free tea that is served makes me incredibly happy and I'm happy that the restaurant is relatively small, even if that means you usually have to wait for a bit to get a seat.",
                "datePublished": "2015-07-14"
            },
            {
                "reviewId": "oUllzzXGlQ3_haPPMOReMw",
                "author": "Sean C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Really good fast food that will not break the bank.   wine £8.50 a bottle!     \nI always feel like a pig when I come here as I always feel that I order half the menu but I end up eating it all as it is sooooo good.",
                "datePublished": "2015-12-10"
            },
            {
                "reviewId": "R-QE1FMcRsSy3M8CmLzS5Q",
                "author": "Amanda T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Good Curry Katsu. Wish it was more spicy but overall amazing. Small cozy space. Free hot tea.",
                "datePublished": "2017-06-25"
            },
            {
                "reviewId": "mVlDi6zrG65kpdkAD7Fz6A",
                "author": "Brittany T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Cold broccoli was delicious.  Had the bento box.  Many things I have never tried at any Asian restaurant before.",
                "datePublished": "2016-10-02"
            },
            {
                "reviewId": "S4bkfc5RfdcP8z1GWK9TRA",
                "author": "Joseph S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The service was friendly and quick, and we were enchanted by the food!\nThe zaru soba was fresh and tasty. The nigiri, however, really took the cake. Every piece had wasabi lovingly nestled between the sashimi and the rice, which made for a savory and authentic taste. Unlike some other Japanese restaurants in the area, the portion of rice was not overwhelming compared to the size of the sashimi, resulting in a far more balanced flavour.\nAnother pleasant surprise was their eco-consciousness. All their fish is environmentally sourced, as is their electricity!\nTip: they don't take tips. Which is why we're writing this review, because the least we could do is spread the word about their amazing food and warm service!",
                "datePublished": "2016-03-20"
            },
            {
                "reviewId": "UKP3FmxCQBFDont3ap2iXQ",
                "author": "Anuj B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Excellent sushi! I got the nigiri set (some sushi, some nigiri) and the miso soup. Soup was quite good, not too salty, but no tofu in it. The sushi+nigiri were excellent! Rice was a bit sweet and delicious, and the fish was quality.\nAmbience was relaxed; not loud, not quiet. Easy to hear anyone you're there with. The venue is quite small, I wouldn't go there with a group of more than 4, but 1-4 is appropriate. Service was solid; they're friendly and attentive, and our food did not take long to arrive. Bit odd that the soup came at the same time as the nigiri set.",
                "datePublished": "2016-01-14"
            },
            {
                "reviewId": "eRcLpKGC6VkH_K-cCcVwSw",
                "author": "Steve W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I've been coming for over 10 years, amongst the dross in Chinatown this is a really solid restaurant that ticks all the boxes. \nIt's clean, fast, friendly and everything there from the donburi, to noodles to the sushi are all solid.  It's classic Japanese food done well and it's nice to see it still going strong.  It's not haute cuisine you go for here but comforting meals you know and love.",
                "datePublished": "2016-05-21"
            },
            {
                "reviewId": "qqVqY3JQ3nlrhhIj-b2bYQ",
                "author": "Joe Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good meal for the price.  Located in Soho and very busy area in the evening.  I got the chicken katsu curry.\nRecommend this place for a cheap meal.  Cash only.",
                "datePublished": "2016-07-17"
            },
            {
                "reviewId": "sKVgNqu4-6Dsb3iCTBabjg",
                "author": "Bruno S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A good spot in Chinatown to grab some quick sushi or a bowl of rice and protein. Nothing special but the staff is nice. It's biggest pro is that it is open late and not the typical dark pub. Serving staff is very friendly.",
                "datePublished": "2016-12-28"
            },
            {
                "reviewId": "OSg1XU9YipOaQFBA-UbXVA",
                "author": "Sam K.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The food here is great and very authentic Japanese cuisine. So far, we tried the katsu curry with rice and the nigiri set. Both are extremely delicious. One great thing here is that you can get a bonus on rice if you ask for them with any donburi or curry rice. \nBut there is something less to be desired about the owners' attitude toward their customers. I tried to be friendly and speak Japanese with them, but they were extremely protective and replied in English sternly. Service level could be improved to make this store a better experience to be honest. But at least people will not be disappointed with the food! This place can also get quite crowded during weekends due to being a relatively small place.",
                "datePublished": "2014-01-28"
            },
            {
                "reviewId": "YNqDSntaiNqUBMs7pxNRRA",
                "author": "Bilbo L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Found this place via Yelp. I love the tofu appetizer and spicy fried chicken better than katsu chicken over rice. Gosh, I was simply amazed by the tenderness of the tofu",
                "datePublished": "2016-11-27"
            },
            {
                "reviewId": "AyC26ZymsU7v4m2Vo4wdcA",
                "author": "Valex D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Amazing place and great food! You should definetly go there if you want real Japanese food. \nI had the Gyu Don and my mom the vegetable curry... both were incredibly good! \nWhen you arrive they give you tea, I also ordered the Miso soup that was lovely!\nHighly recommended!",
                "datePublished": "2015-06-17"
            },
            {
                "reviewId": "VmPGNmIeVwrD9Sdk_ugOUw",
                "author": "Schelly Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I was a bit skeptical as Tokyo Diner is right in the middle of Chinatown and the name sounded a bit odd as well. The ambiance is simple and clean with attentive staff. Prices are very reasonable and they do not charge service nor do they ask for tips.\nWe tried the sashimi, kastu curry, and chicken karaage. The chicken had a great crust and was super juicy. You have the option of white or dark meat for the chicken karaage which I do not see often. The fish was fresh and nicely sliced.",
                "datePublished": "2013-10-14"
            },
            {
                "reviewId": "Hkxp5hZs-3d-WStDGAlsBw",
                "author": "Morgan G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Tokyo Diner is a gem. For starters, the food is delicious--this seems like a good place to start. I've been here twice and have tried the udon noodles and their salmon teriyaki set lunch. The shop itself is small and cosy. The staff is courteous but no-nonsense. Table turnaround happens quickly here and they are unapologetic for it. That being said, the staff is extremely accommodating to diners and offers a great deal of information about their food and the customs associated with a Japanese meal (no tipping, free tea, free extra portions of rice) on their menu. \nAnother thing I love about this place is their extensive lunch menu (so cheap) and the further discounts they offer--if you rock up between 3-6pm (their least busy hours) they offer a £1 discount off of their already affordable fare. \nWhen planning a meal in Chinatown it can be difficult to be decisive--as delicious food surrounds you from all angles--but the next time you're faced with a moment of indecision, I urge you to check this place out.",
                "datePublished": "2015-07-23"
            },
            {
                "reviewId": "qKlmh7vih2aAk-nmi7rGWA",
                "author": "Jenny L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Very good katsu curry, but nothing exceptional. If you enjoy having the traditional Japanese katsu curry, this is your place! I also read on the menu that you can get an extra-large portion of rice at no additional cost. \nI really enjoyed my food. It has been a while that I just had a katsu curry without anything fancy or the chef hyping it up. Good tasting and fresh :) It reminds me of what a katsu curry originally taste like.\nThe place is nicely decorated to look traditionally Japanese, so very simple. They do try to maximize the space as much as possible, so I felt like I was having lunch with the people sitting at the next table. Perhaps this is part of the appeal. \nIf I am hungry in Chinatown and unsure of where to go for a sure-thing good tasting meal, I would certainly return. However, I would not travel just to eat here.",
                "datePublished": "2014-04-17"
            },
            {
                "reviewId": "6mlu3YE5V5uHSrI4X7jNgQ",
                "author": "Jennie C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Katsudon! That's what you should get here :). They make a mean katsudon and it's very good values (large portions). You get hot tea and rice crackers while you wait for your food. It gets a little crowded in there, but I've never had to wait too long to get seated.",
                "datePublished": "2014-01-05"
            },
            {
                "reviewId": "mNYHlb6m1CDMD7PP2wbRBA",
                "author": "Melissa C.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Yuck. Ordered 4 rolls. None of them tasty. Fish wasn't particularly flavorful, too much sauce on top of rolls that had it, and 3 of the 4 were mostly rice. No refills on the green tea, and no sight of these rice cakes everyone is talking about. No low-sodium soy sauce. No WiFi. Edamame was fresh, crisp, yummy. Miso soup was also good. We ordered an extra edamame, ate the centers of our rolls and left hungry. Boo",
                "datePublished": "2016-07-30"
            },
            {
                "reviewId": "hYU-l-CuFj6ItBDxUwiLCQ",
                "author": "Anoop K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love myself a bit of Tokyo Diner.\nHaving not been here for about a decade, I needed a good post-cinema meal, and a lightbulb went off in my head reminding me that I hadnt been here in 10 years.\nNote: my stomach has just started rumbling thinking of what I had here :)\nSmall,  but perfectly formed, Tokyo Diner is kinda on the outside of Chinatown, but it reminded me of Asia: relatively understated in decor with all attention going to the food, with service very quick and no nonsense. The staff were very friendly, and I like how, if you're especially famished, you can ask for an Omari portion which is larger but free serving of rice. Mmmm.\nAs it stands, I was particularly hungry and got myself Omari with a Katsu which was dreamy. Tokyo Diner's authentic no-tips policy took me back to the land of the rising sun, and I shall be defo coming back here, as soon as I can.\nThe maps of Japan have also had a knock-on effect of making me wanting to travel again, so at least I have something else to daydream about for a few days :)\nPrice wise, £10 for a meal which isn't bad for the centre of town.",
                "datePublished": "2015-01-06"
            }
        ]
    },
    "40": {
        "id": "rAAuLQbWTVZlfJcufwwdDw",
        "name": "Tokyo Diner",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "2 Newport Place\nLeicester Square\nLondon WC2H 7JP\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/RvIBiv2XKnxHUDScvGMk8Q/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7287 8777",
        "review": [
            {
                "reviewId": "w_dYql9_igN_HAAEJK1o8g",
                "author": "Daniel J.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "A girl took me here on a date once. It was great. We had sushi and we also had a big tofu thing that looked disgusting but was delicious. \nThings didn't work out but I kept returning to the Tokyo diner. On dates. And the girls are always impressed by me. \"Wow, what a find.\" \nWhen I say impressed by me, I mean by the sushi. They soon forget about me. \nAnd pretty soon I'm going to take some girl there and I'll bump into the other girls there and it'll all get a little awkward. Especially if the first girl is there, because she'll know that it wasn't my little find, it was hers. \nAnyway. The sushi's good. If you're pretty and like sushi, maybe I'll take you there sometime.",
                "datePublished": "2014-12-15"
            },
            {
                "reviewId": "rTuJeFcX3_7vVdo_9ZE_Tw",
                "author": "Jules H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I'm a great, great, great fan of Ramen or any other noodle soup. I always wanted to go to this authentic Japanese diner, but it was normally too full to even step into it. Meeting up with some friends on a schedule that included a pub quiz later on in Walthamstow, we were early enough to get seats. \nThe service is nice. The chairs are incredible uncomfortable. The menu is great. The food is great. the space is so small that whenever someone opens the door the draft will hit you wherever you chose to sit. The food is worth it!!",
                "datePublished": "2015-01-12"
            },
            {
                "reviewId": "UQrTgQKUuUGuE5ws1D8Rcw",
                "author": "Carlos Alberto R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "We where strolling around Leicester Square really hungry but didn't want any of that fast food stuff... there in a corner we found this nifty little place just waiting for us. \nPlace is small but nicely kept, menu has several choices to choose from and we pretty much liked everything, but mostly: Salmon Tataky, sushi plater, sashimi and the chicken karate. Everything was fresh and quickly served and for london, I don´t believe it was that expensive for what we got.",
                "datePublished": "2013-11-14"
            },
            {
                "reviewId": "Yw-gKfwLChxgQPd-oMJKVQ",
                "author": "Selina P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "From the exterior, Tokyo Diner looks simple and isn't eye-catching. However, the inside is beautiful, clean and as if you walked into Japan. \nThe menu is descriptive, explaining what goes well with what and on the front of the menu is a little description explaining they don't accept tips. I felt this was helpful to avoid embarrassment or avoid any insulting behaviour. \nI ordered the Nigiri set which was plenty for lunch along with edamame and miso soup. The fish was very fresh and presented wonderfully. There was just something about the restaurant I really admired. It was quiet, many diners ate on their own and they were comfortable doing so. \nThe price was extremely affordable, the restaurant very clean and the service I found helpful.",
                "datePublished": "2013-06-11"
            },
            {
                "reviewId": "tXfTIw3B4f7aCSGCMDTWdQ",
                "author": "Ting Ting L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Beautiful Japanese food, lovely service, given the location, I thought it would be one of those \"fake Japanese restaurant\" - secretly own by non-Japanese Asian. However, I was pleasantly surprise that this is not the case - if it was, they hide it very well.  Lol\nI particularly enjoy the curry, and for those who are VERY hungry, you can even ask for extra rice too!\nHighly recommend!",
                "datePublished": "2013-05-21"
            },
            {
                "reviewId": "U7ZllE_aA7L6e7iB91xd3Q",
                "author": "Beth W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Eating here honestly just made me miss home more, I guess. I'm not Japanese, but growing up in Taiwan there was no shortage of good, cheap Japanese food, and I guess this place is the closest to that standard I could find in my short stay in London, with somewhat reasonable prices.\nTheir katsu curry is my favorite. Crispy fried pork chops in hearty curry - what more can I ask for, really. As for appetizers, I often get the chicken karaage - it's just simple, no-frills Japanese fried chicken. Yum. The free tea and rice crackers give it an even more authentic feel, and the staff was always nice to me.\nUnfortunately they do not do takeout (apart from sushi, if I remember correctly) - hopefully that might change? At any rate, a nice place for ordinary Japanese fare, nothing fancy.",
                "datePublished": "2014-03-26"
            },
            {
                "reviewId": "d4att-AB9ush6obPn_0AOQ",
                "author": "Charlotte K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "My mum lives far enough out in the sticks to not have a good sushi place close by, so as soon as she gets into urban areas, she has one craving: SUSHI.\nSo after a long morning of shopping in Covent Garden, I unleashed my Yelp App to pick the best place for sushi - and Tokyo Diner popped up. I've been past the place a few times and never considered it since I thought it looked a bit \"gimmick-y\", but if the Yelpers say it's good...\n... And as usual, Yelp did not dissapoint. It was really good!\nThe prices are what you would usually expect. And even though the place is a bit \"cliche\", it does feel very authentic.\nThe food was nothing super special, it was plain, simple tasty Japanese food, and I thoroughly enjoyed it, and would also recommend it for if you have some similar cravings when in China Town :)\n(Man, I totally have cravings from writing this article already!)",
                "datePublished": "2015-01-02"
            },
            {
                "reviewId": "GjD7G2Do1i0lpm3AoygdYQ",
                "author": "Daniel P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "3 stars for food + 1 star for value/service. \nI had a chicken katsu curry and it was pretty bland even after dumping shichimi on it, so it would have been nice to have spiciness levels for the curry. Fukujinzuke would also have been nice.  Additionally some shochu options would be cool.",
                "datePublished": "2015-01-31"
            },
            {
                "reviewId": "lCdUFTOHiErUVb66jMYNyg",
                "author": "Geoff S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "If you are looking for Sushi, almost any other Sushi place will be better. Little selection.",
                "datePublished": "2016-04-16"
            },
            {
                "reviewId": "-nwi1QQ0J-j2jO-z7hM2UA",
                "author": "Christie K.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I'd really give this place a 3.5 stars if I could.\nI've passed by this place so many times and finally stopped here for lunch the other day.  They have a pretty good variety of items on the menu - and I went with the katsu curry.  I thought it was good but it didn't get me excited enough to give it 4*s.  The age dashi tofu is really good.  I'll have to go back and try some of the other things on the menu.",
                "datePublished": "2012-12-13"
            },
            {
                "reviewId": "D84A7ID1s7WnlwF_Pm5A4w",
                "author": "Ira P.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Pretty unimpressed.  This place is right near my office, and my wife and I always notice the line outside, so we decided to check it out one Friday evening.  I'd call everything \"okay\" and give it 3 stars if it weren't for the tuna.  \nI generally avoid ordering tuna these days due to the general overfishing problem with bluefin, but my wife loves it, so we usually wind up with at least a couple pieces.  The ones from Tokyo Diner were outright bad. Greyish (should have been our first clue), tough, and distinctly fishy-tasting.  If I were running the place, I would have let people know that there was no tuna we were willing to serve that night rather than dishing out that mess.  I would have respected that decision much more.\nIt's also crowded, fairly noisy, and the service was so-so.  Not my scene.",
                "datePublished": "2014-10-06"
            },
            {
                "reviewId": "TeSkSy_zCMLlhfono4VK7w",
                "author": "Leo U.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Summary:\n+ A Japanese canteen, that's exactly what this place is \nOverall: \nThis place is a Japanese canteen. A canteen in Japan. Canteen japonaise. \nI don't know what else I can add. \nThe food is definitely authentic. Their food is kind of comfort food that would be served in a canteen. (For the third time. I won't say that again.) Their food is decent but not special. To use proper foodie terminologies, they are \"hmm yummy\" but not quite \"OMFG! You gotta try this sXXX. This is f-ing AWESOME!\". \n \nThe restaurant is very small and it's right at the heart of China Town so it gets packed. \nI have never been impressed by their staff, though. Most of the time they are rather blunt. I thought all Japanese people were nice and polite. \nIn one of my recent visits, I overheard two waitresses chatting quite loudly at the back (in Japanese) for quite a long time. Maybe it wasn't the busiest time of all but it doesn't feel right. \nBut they can get away with it. They are at a prime location with high visibility. The food is decent. So there is enough influx of tourists (they are one-off transactions) and locals who need a quick and filling meal. \nI will still go back for the high cost performance. I only care about food.",
                "datePublished": "2014-05-26"
            },
            {
                "reviewId": "W9XWe9WBRPctWGO-zJAyPA",
                "author": "Laura B.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Husband and I ate there tonight based on the number of great reviews, however I have to say this place was pretty average and a bit over priced for the food you receive. The menu isn't very large and it's crazy that the bento boxes were about £16-19! I ended up eating some teriyaki chicken ( only comes with about 4 small to mid size pieces) and is £7.20. The chicken itself was pretty tasty but not amazing. I would have priced it at £4.50. Also since this doesn't come with rice I had to order it separate. The miso soup was a bit bland, I've had better. My husband had the katsu curry and said that both the curry and the katsu were very bland. The included salad was not the best. We've eaten at many Japanese restaurants that were better and cheaper than this one.",
                "datePublished": "2015-10-09"
            },
            {
                "reviewId": "H_MQlYgxUZW6BzYv8g0HyA",
                "author": "Rachel R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I used to come here all the time with my friends when I studied abroad in London. The chicken karaage bento is wonderful, especially washed down with some plum wine. I'm not a huge fan of katsudon, but I had a friend who loves it, and the Diner's was some of the best we had. Everything seems very fresh and tasty and basic, but in a good way. Japanese home cooking, I suppose!\n Waits can get long in the evening, but they seem to move everyone in and out very fast. The waitresses are very nice--but no tipping! Despite the plethora of restaurants in Chinatown it's sort of a culinary wasteland, and Tokyo Diner is a respite and a delight.",
                "datePublished": "2014-09-05"
            },
            {
                "reviewId": "Hh3reCM6ybzo06PFfx_uQg",
                "author": "Wendy L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A simple no fuss Japanese restaurant.  There is nothing  I could fault about the food in this place. I couldn't give it 5 stars because it was just simple Japanese comfort food, nothing out of ex-ordinary and all the usual Japanese dishes I could get in any other Japanese restaurant. Tokyo Diner focuses really mainly on one plate dishes like donburi and also their famous big portion bento boxes. There are also sushi platters but it just does not have a large a la carte menu. It's a place for a quick fulfilling dinner if you don't fancy Chinese in China town. \nI do love it's concept of 'No Tipping'. With its free tea, Japanese crackers and no service charge it felt like a Japanese Wong Kei's with better service and better food. Portions were just as big though with free refills of rice for those extra hungry ones. Awesome.\nWe started with starters of agedashi tofu, spinach goma, miso soup and pickles. The tofu was average, not the most silky I've had but still very satisfying in a very well made dashi sauce. Spinach goma stood out the most although I wish they let it warm up a bit rather than it come out straight out the fridge, Still I love the nutty sesame sauce that made this dish so moorish. It tasted just like peanut butter but sweetened and gave the dish a slight sticky texture. It no longer felt healthy but indulgent instead. Wasn't a fan of the plum pickle that was too sour but the rest was fine.\nMy main of pork katsu was massive with a lovely marinated leaf salad on the side. It was one of the better ones I've had with next chunky soft carrots and potatoes in the curry which was perfectly seasoned and flavoured, not too sweet or salty. The katsu was perfectly fried, a nice crunchy batter into a thick succulent tender piece of pork. Rice was fluffy and cooked perfectly. A good choice.\nHowever weirdly enough I preferred my boyfriend's tamago don. Something so simple like on egg on rice was so good and comforting. Where my katsu curry cooled down very quickly my boyfriend's dish remained hot throughout due to the egg acting like a blanket. It was soft, mouthmetling and cooked in a dashi stock that wrapped it in a nice savoury flavour. Together with the al dente sticky rice it was just the perfect combination. \nWe also shared a zaru soba which was faultless again. A nice portion, noodles cooked as they should and sauce flavoured well. \nThe most disappointed part was our cold sake which tasted like they had watered it down. Still it did not effect our overall opinion of the place as we were very satisfied with meal. \nI do love this place and will probably return very soon. The automatic push button door was a nice touch as it made my boyfriend feel nostalgic about his holiday memories in Japan as apparently those doors were common over there. Also that and the light wooden tables, Japanese staff, a large map of Japan and the rest of the decor. With that in mind and the cheap generous prices do prepare to queue or get there a bit early.",
                "datePublished": "2014-02-22"
            },
            {
                "reviewId": "pmB9u-3fB1z-LaK_SH7O_A",
                "author": "Yinnie C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I don't usually eat japanese food in chinatown, for reasons quite obviously stated in the first half of this sentence. I heard this place was pretty reasonably priced so we popped into here because I couldn't touch the dim sum places until after this stupid chinese notion of not eating prawns after surgery. And in chinatown - every dumpling you eat is like a lucky dip- you don't know what meats they have. \nI would usually head for proper ramen in either bone daddies or tenten but due to not being able to walk very far 4 days after surgery, and i NEEDED to get a haircut because damn, i need to feel pampered after having such a shit time with my medical problems, I decided to treat my cousin here. (he chaperoned me so I didn't get bashed about in london, our family is close knit like that!)\nIt's basic- you get some set lunches, where you would get pickles, rice, what you ordered and soup and I love thats how simple it is, it's the epitome of japanese clean eating so you don't feel so msg-fied afterwards. I enjoyed my lunch!\nReasonably priced? for the simplicity- I don't really want to pay over £20 and we weren't that full, so no, I think that I can definitely find better japanese deals elsewhere.",
                "datePublished": "2014-02-14"
            },
            {
                "reviewId": "Iu7Li36Fa9-TMyvkZbkmwA",
                "author": "E J.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "As close to a traditional Japanese experience you can get without hopping on a plane.   Tokyo Diner has barely changed in the years it's been part of China Town, but this really is down to the fact what they are doing, they're doing very well.   The bento boxes here are probably the best value for money - though saying that, it's hardly pricey to eat here - there's a good selection of traditional Japanese food including a small sushi menu. The jasmine tea and little crackers are free, which is always a nice touch and there's absolutely no tipping aloud! This is considered rude in Japan and the same applies here, so keep your change to yourself and just enjoy the cute corner of our very in Japan in London.",
                "datePublished": "2015-09-22"
            },
            {
                "reviewId": "NK6tF8tLPHBUXqixclhvSg",
                "author": "Glen M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Distinctly OK.\nOvercooked fried tofu & katsu in general; it's a bit cheaper but about par for hte course in C-town.",
                "datePublished": "2014-05-11"
            },
            {
                "reviewId": "oqVS6_L6bJmqQjR3enIyOA",
                "author": "Sarah S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I chose this place for a first dinner date, having read the previous reviews on here and got a verbal confirmation from a friend that it was good. \nWe stepped through the nifty sliding door, and we greeted and sat almost immediately, menus in hand. We ordered sushi and edamame, and while we waited we had the free green tea (which was rather good and not horribly stewed).\nMenu wise it was very well labelled, I liked that they were clear on ingredients and common allergens. They also admitted there may be a language barrier with the server so in case of special requests to make sure the server understood.\nThe food came quickly and it was clearly very fresh- the rice was perfect and the fish was flavoursome and of a decent thickness. I could have done with more ginger but I'm sure they would have provided if I'd asked.\nDespite it being reasonably busy they didn't rush us off our table after we finished the food but continued chatting, even pouring more tea for us.\nPolite, efficient, good value. I will be going back!",
                "datePublished": "2014-01-24"
            },
            {
                "reviewId": "SpuhrYKRgqmFa2_ZfDVlUQ",
                "author": "Michał D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is one of the few places were you can taste authentic Japanese cuisine. Be sure to treat yourself to crunchy Tsukemono pickles or udon noodles. Of course free green tea only helps to cherish your meal.",
                "datePublished": "2015-01-09"
            }
        ]
    },
    "60": {
        "id": "rAAuLQbWTVZlfJcufwwdDw",
        "name": "Tokyo Diner",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "2 Newport Place\nLeicester Square\nLondon WC2H 7JP\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/RvIBiv2XKnxHUDScvGMk8Q/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7287 8777",
        "review": [
            {
                "reviewId": "ut9Yr7iHDWb9d5qh6UiYhg",
                "author": "Camila A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "We were pleasantly surprised by this restaurant. It is really clean and it had really good service. For me the fact that I could get a Bento box with sashimi was a perfect combination.",
                "datePublished": "2016-02-07"
            },
            {
                "reviewId": "reePaPPgbnSPIag8TbbbaQ",
                "author": "Philip D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Last Saturday we went to Tokyo Diner. It was a great choice. We were also very lucky because we got seated right away, but immediately after us (around 7.30) people started to line up.\nTokyo Diner is all about one thing: great standard Japanese food. The setting of the restaurant is very basic and small (don't dress up for this). All staff is Japanese and very friendly & humble. They refuse any tips because \"it's not part of the Japanese culture\" (their words). They don't sell Tuna because they believe in only serving sustainable food. As much as I love tuna, I can only truly admire this choice and position they take.\nThe food was really good. We didn't eat as much as we normally do at a Japanese place but had a fair amount of salmon sushi (really fresh), pork with curry (tasted like other ones I had before) and Udon noodles (almost the most recommendable dish of the menu! Only £8 for the noodles with chicken and better than any other trendy Udon place I've been to in Soho).\nOverall, all the prices are VERY reasonable (almost cheap) for such quality! It's about £2-3 for a beer for example. And the total bill (and in the end, we were full) was only £50 for several beers, glasses of wine, fresh sushi, pork, udon ... \nI definitely go back when I'm around in Chinatown!",
                "datePublished": "2014-04-09"
            },
            {
                "reviewId": "5igGUsI4eOuNx20FpOXNgA",
                "author": "Instrumentatia C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Nothing fancy, but the food is good and the staff friendly.  The price is good and the overall quality satisfactory.",
                "datePublished": "2016-01-24"
            },
            {
                "reviewId": "Oh50TbpsWj8yaVPhd4MILg",
                "author": "Cathy L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "A great bet for a pleasant, non-greasy meal at a very convenient location. \nRemarkably tranquil inside, for such a busy area. As soon as you walk in, you're seated and served rice crackers and green tea by the attentive staff. The menu is not as expansive as other places, but everything they serve is reliable and less greasy. My comfort foods are the soba noodles and aubergine or tofu with dashi. Besides the food and service, it feels good to support a small business that has a strong ethos. One of my go-tos.",
                "datePublished": "2013-08-18"
            },
            {
                "reviewId": "OyD6NwnSm-6xO_SJ5SjpRg",
                "author": "Ally W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Seems that whenever I am in Chinatown, I pass by this place. Since I often go to Chinatown to get my Chinese fix, I have been ignoring this place until today. This is a very down to earth diner. The food is well prepared and delicious. You can get Bento, noodles, sushi, and your standard Japanese starter dishes here. My friend and I ordered a sashimi plate and Agedashi tofu to start. At first we thought 10 pound for a plate of sashimi wasn't a bad price, but when we saw the 7 small pieces of sashimi, we realized it wasn't the deal of the century. The Agedashi tofu was really good. I had the Katzu don which I liked. It was different from the Katzu I am used to, in this version, Katzu was cooked first and then cooked with eggs to form a pancake that covered the rice in the bowl. It was very yummy and very filling as well. \nWhat I like about this restaurant is the attention to details. You will find the most comprehensive menu here with information about gluten and nuts/seeds content for each and every one of their dishes. They also clearly stated on their menu that they don't accept tips! Overall, a good place for a quick meal.",
                "datePublished": "2014-03-05"
            },
            {
                "reviewId": "uhBuzBn3QlYbP0tO3LHH3g",
                "author": "Pammi D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Very busy restaurant near the Prince Charles cinema the food was very good and of high quality we had the sashimi set, and a Couple of bento boxes. Service was excellent and attentive. Highly recommended.",
                "datePublished": "2015-10-23"
            },
            {
                "reviewId": "0DkjVulo9v-NKQ0d6OmAlQ",
                "author": "Adrienne Y.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I would like to give this place a 4 star, but it just lacked a little something to push it into that category.\nI love Japanese food, and it's quite possibly my favorite cuisine out there. I can't tell why I wasn't too impressed by this place but here are my general thoughts on my dining experience here:\n1. I thought the prices were just a tad higher than for what they were offering. \n2. I was hoping they would have more options on the menu. I know this is probably a silly thing to say considering how extensive their menu already is, but I was really expecting an izakaya style place and this was not it at all! And if it is, it is a very limited menu for an izakaya.\n3. The food was just filling enough.\n4. Despite the Japanese speaking servers, I still felt this place didnt feel Japanese enough, it feels like I'm in Chinatown...probably because it is in Chinatown =P\nIn the end, maybe my expectations were just too high before I came, or I just have my own idea of what good/inexpensive japanese dining should be like.  It's a good fill your stomach on a decent variety of food, but nothing about it deserves special attention.",
                "datePublished": "2011-09-12"
            },
            {
                "reviewId": "3-srs9uKW0RWfx4-PtY9vA",
                "author": "Yuuu Y.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Absolutely one of the best Japanese homemade food in London. I tried several other places this week because I really miss authentic Japanese food. Unfortunately many of them are not good enough. Food here is more fresh and authentic. Love their side dishes so I order bento very time. Worthy. Service is good today. One girl was very nice. But the cashier lady was distracted. Of course they should operate a no tip policy because there was no service at all( unless you consider ordering food is a service)Btw last month I also had a really bad experience with the old lady in the cashier desk. So arrogant. Never met such an Japanese in Japan. But well I love the food here so until I find some better options I still will come",
                "datePublished": "2016-02-24"
            },
            {
                "reviewId": "NYsh1tiNxqB8Z2O4zKyXAg",
                "author": "Minnie M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I never thought I'd judge a restaurant by its entrance door, but I did.  Sign of a quality time ahead, I say.\nI've passed by the restaurant dozens of times but never stepped inside.  It's deceptive on first impression as the space appears to be small, but the sign at the door that says \"seating for 100 people\" sums it up pretty well.  We were taken to the seating downstairs, where we were joined fellow diners in a windowless basement.  We promptly ordered the £8 Oyaka don (chicken pieces with scrambled egg and brothy rice), and a fried chicken bento box which was a bit of a letdown for £16 (you get several pieces of fried chicken, 3 pieces of salmon sashimi, some veggies).  I'd recommend the rice bowls.\nOverall, it's decent.  I'm a bit obsessed with Japanese food so I'm glad I found it.",
                "datePublished": "2013-12-04"
            },
            {
                "reviewId": "ObYyEkWZ1yQNIJ0oFIIDSg",
                "author": "Rob H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Considering it's somewhat of an institution, I'm a little ashamed to say that I'd not heard of Tokyo Diner until about 2 months ago, despite having walked past in probably hundreds of times in my life.  Anyway, now that I've been it renders my introduction totally pointless but hey, I had to write something there.\nTD prides itself on being open 365 days a year from 12 until 12 - they're basically the guardian angel of Japanese food.  As of the time of review (Jan 2015), they haven't been opening on Mondays due to staff shortage - whether this is a temporary or more permanent measure I'm not sure, but I'll update the tips as and when.  A couple of other things:\n- they don't accept tips (as it is not a Japanese custom) giving any mistaken tips to the homeless\n- they don't serve tuna (eco decision)\n- there's a full list of allergens in their food on the back pages.\nThere's nothing outlandish about the menu - it's pretty much on par with similar places such as Eat Tokyo - soba, curries, donburi, and a smallish selection of sushi/sashimi - simple and good.\nWhen I went, I tried the oyakodon (a hearty combination of infanticide and matricide - it's a delicious chicken omelette cooked in dashi stock), wakame seaweed salad, and chicken karaage.  The salad was fine, although not as tasty as I expected (could've done with more dressing.  Japanese dressing is the beeeest) and the kara-age was decent, if not the best; that said, the flavour was good as they've got the marinade right.  The oyakodon was solid - not overcooked and with a strong dashi flavour.  Prices are reasonable - £8.50 for the oyakodon, curry dishes are around £10.50 - whilst not cheap cheap, the place is good value given the quality of the food.  As it's well known to everyone apart from me, it gets fairly busy, but it has quite a bit of downstairs seating; service isn't super friendly but it was reasonably efficient when I went, so all's good.  Overall, I'm glad I finally got round to trying here and definitely recommended for a good, simple dinner.",
                "datePublished": "2015-01-13"
            },
            {
                "reviewId": "G-bmvB7X1BwNasB9DWapPw",
                "author": "Ryan L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I've been here a few times and it seems like they have a lot more space than they used to (both upstairs and downstairs).  I imagine it would still fill up on a busy night but it was a Monday so we didn't have to wait.  I had sushi with a side of more sushi, miso and edamame.  Overall the sushi wasn't amazing but it was still very good and definitely for the price.\nIt's definitely one of my favourite places to go around Leichester Square.",
                "datePublished": "2013-10-25"
            },
            {
                "reviewId": "hC5Tl6nmXet_r0-EIsOo3g",
                "author": "Larry T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I was there yesterday for lunch. Nice place, authentic Japanese food in London's Chinatown.\nI had a great sauce chicken katsu don - YUMMY ! The resto has a strong Udon menu but perhaps lacking in the sashimi department. \nI also appreciate its sustainable development policy re not serving tuna. \nWould definitely return.",
                "datePublished": "2014-04-14"
            },
            {
                "reviewId": "n5_-x1pP6iN_MtJ39BTgyQ",
                "author": "Fotios T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The Tokyo Diner doesn't serve Tuna due to ecological concerns. They donate all their tips to charity, and they give you more rice if you ask for it.\nThe people in the Tokyo Diner are nice people.\nIt also helps that their food is also pretty good. It's not going to change the world, but it's well-prepared, honestly priced and arrives as soon as it's ready. This can cause some social complications if someone in a group orders a quickly prepared dish (something like the aubergine - something I strongly recommend - which is served cold), though. The lunch deals are all very good value and come with a selection of pickles, miso soup and a side dish that varies day to day. Everyone also gets free tea (and refills!) and some rice crackers to munch while they wait.\nThe only slight downside is that there's no tempura on the menu, which struck me a bit strange for a place focused on bento-style meals, but it's not exactly the end of the world.  On balance, it's one of the better 'authentic' Japanese places around here.",
                "datePublished": "2012-11-09"
            },
            {
                "reviewId": "8d9Wj00r1J9tbfrLlk_VxA",
                "author": "M A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Not like the other places I usually eat Sushi at, but i decided to give it a try! Fresh, light, and many interesting choices.\nI would return back with my wife for sure! she would love it.",
                "datePublished": "2014-02-02"
            },
            {
                "reviewId": "CvgNSdEidt3xoAzovqvslA",
                "author": "Emmanuelle B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "In bubbling Soho and Chinatown it's difficult to make a choice for a restaurant. They all look similars and you wonder if the quality is everywhere good not to be disapointed and unfortunately it's not ! \nThat's why I definitely recommand to go to this address. It has good prices, ethical concept (they don't use tuna because it's a specie in danger even it's cultural for Japanese to normally eat it) they don't take tip and ask instead to come back and bring friend ! Love the concept :-)\nInside the decoration is classic, wood table and some Japanese flag as decoration. You have lunch menu or a la carte suggestion. You can go for hot meal such as soup or fried meat or fish but also some sushi and cold sashimi. \nI've been a couple of time and never been disapointed. The service is efficient, polite and friendly even quite shy as it's common in asian culture. Might be busy but worth make a try and even try a bit if the queue is not too long. If this one is full, then walk around and catch one with as much as stickers as possible from all the guides and travels books that have rated the place, the best way to find something else !",
                "datePublished": "2012-03-06"
            },
            {
                "reviewId": "y3CEflKqnL0KSdIT4pYLbQ",
                "author": "Tyn R.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "There's nothing really much to say about this place. Everything was pretty mediocre. The atmosphere, the service, and the food were all very average. Me and my friend were close to running out the door after having been served our drinks, but our morale enforced us to stay put!\nThe only thing bringing my star rating up a notch is my passion for Japanese food, and well.. I suppose I did get to eat that (as unsatisfying as it was). Plus, I needn't pay for tip, which saved me change for a post pick-me-up.",
                "datePublished": "2011-06-15"
            },
            {
                "reviewId": "0QPlW1_2_V3DSRgXHoQtJw",
                "author": "Richard G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I loved this restaurant. Really funky with excellent food at good prices (service is included). Crowded, but space available.",
                "datePublished": "2014-08-07"
            },
            {
                "reviewId": "HUdFcnMmGnFFzb3Xfmk1TQ",
                "author": "Eric H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I found this place on Yelp after craving sushi late night after a long day working and not wanting room service.\nI opted for the sashimi set at 11:40pm. They close exactly at 12:00am and no yelp, they do not offer take away... \nSushi was typical but not exceptional. As the other reviews say, the place is run by Japanese and is a good place to stop by but not anything special.",
                "datePublished": "2012-04-24"
            },
            {
                "reviewId": "UK8oZAyxGVDETMIrd6YWqA",
                "author": "Yee Gan O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Tokyo Diner was one of the first Japanese restaurants to open in the Chinatown area. I remember peering at the menu at the time, wondering about this new cuisine invading the homogeneous Anglo-Canto food in the rest of Chinatown.\nAt those prices, it was definitely worth a punt and I haven't looked back since. I usually go for a bento box as I get some sushi (essential for me) as well as another dish included. It's a complete meal in itself.\nIt's not swanky and a little cozy but a reliable cheap Japanese meal.",
                "datePublished": "2009-04-25"
            },
            {
                "reviewId": "W9FZxN1DKaVUEvp-oreIhg",
                "author": "Michael C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Usually have a great meal at Tokyo Diner. Good Hoso Maki and spinach as usual. Problem was the Soba noodle soup and edame beans were drenched in salt/ soya sauce, the kind that gives you headaches after. I fear they might be adding salt based additives to the food now so will unlikely be returning!",
                "datePublished": "2014-12-01"
            }
        ]
    },
    "80": {
        "id": "rAAuLQbWTVZlfJcufwwdDw",
        "name": "Tokyo Diner",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "2 Newport Place\nLeicester Square\nLondon WC2H 7JP\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/RvIBiv2XKnxHUDScvGMk8Q/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7287 8777",
        "review": [
            {
                "reviewId": "V9LKB_a9X8vvr-H5C8S3Rg",
                "author": "Ken D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Really good value and great quality. We were quickly seated and served with complimentary tea. Our food was served quickly and came with miso soup at no extra cost. Couldn't ask for more given how much every other restaurant in that area overcharges.",
                "datePublished": "2014-11-22"
            },
            {
                "reviewId": "AEIgz-sFdtKmfRNhVxbMrQ",
                "author": "Polo C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Service is ok but the sushi is fantastic. The salmon is as fresh as it gets. Try the salmon nigiris, Salmon set, miso soup, and salmon tataki. The place is very casual and in the middle of chinatown, the place has a very laid back feel with traditional japanese vibe.",
                "datePublished": "2013-11-29"
            },
            {
                "reviewId": "-A4uEVEzZic6bRqrfok4Pw",
                "author": "Thomas R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I've been here several times with friends and I'm endlessly amazed by the friendliness of the service, value of their menu and fabulous taste of the food. For Japanese food that's more authentic than the usual London offerings, but still affordable, you really can't beat it. I would recommend the pork katsu bento box, which comes with candied sweet potato and other delights.",
                "datePublished": "2014-08-30"
            },
            {
                "reviewId": "3P0DPGWn5pLGCCcch1QaCw",
                "author": "S. A.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This place is a good place to stop into after a show.  There isn't anything especially good but it seems like mostly a traditional Japanese sort of place and I appreciate there consideration of the environment in terms of over-fishing of tuna.\nThe service is slow at times which is unusual since the place is so small.",
                "datePublished": "2012-01-08"
            },
            {
                "reviewId": "C2UozPmovRMw68j6Be8Asg",
                "author": "Rachel W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Totally Japanese~ some people may not get used to it, but I love it! It's smooth and soft~ noodles are terrific! However,  sushi is a little bit loose, so it is easy to fall apart. Anyway, good place to try Japanese food! Definitely try it out!",
                "datePublished": "2014-04-04"
            },
            {
                "reviewId": "i8sLbeCBI6U9KSv8q59HdA",
                "author": "Y C.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "There is a reason you dont tip. Worst service in chinatown and that's pretty bad. Cheap meal does not make up for the rudeness from the polish and japanese staff. Avoid this place it has gone downhill.",
                "datePublished": "2013-05-09"
            },
            {
                "reviewId": "uTy5dBqI9-AxBZIlfAk7Fg",
                "author": "Martin G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Very nice place for an authentic sushi dinner. Was there in line with a vacation in London. I already made the place out via the internet from Germany and specifically went there one evening.\nNice area for nightlife around it.\nTwo stories, ground floor and cellar. I got a table in the cellar, where it was a bit crowded but the atmosphere was nice. While I waited for my order I was served a pot of jasmine tea and some japanese crisps. Nice gesture.\nSushi was quite tasty and the price was alright.\nThe restaurant made the decision, that they do not serve tuna due to the catching conditions. They state that nice sushi is also possible without tuna. They shall be assuered. Respect for that. Next time in London, next time at Tokyo Diner!",
                "datePublished": "2011-12-18"
            },
            {
                "reviewId": "eGwdl73RjLHsT59_zD5qsQ",
                "author": "Qype User\n adride…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "These guys are saints. Quite amazing that they manage to keep up standards and politeness in the heart of the west end. Reminds me a little of a single trip to Tokyo a decade ago.\nFree rice crackers, green tea and extra rice. Tips and wasted food strongly discouraged by the owners",
                "datePublished": "2012-04-28"
            },
            {
                "reviewId": "j9YDN4Al2V8EuVgv7rVD9w",
                "author": "Daryl A.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Very good food but service...well, lets be nice and say it was \"odd\". Off for another beer.",
                "datePublished": "2013-09-12"
            },
            {
                "reviewId": "oHsyIyRLzytZ0z80IRUrAQ",
                "author": "Emily Y.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Not bad, but not the greatest by a long shot. Good for a cheap and quick dinner or lunch, but not much else.\nOrdered the chicken katsu, which was pretty good and miso soup. Pretty standard, but when you're cold and freezing (as I was back in January 2010 when I ate here), miso soup is AWESOME. \nIf I'm ever in town, probably won't make the trek over here...",
                "datePublished": "2011-04-27"
            },
            {
                "reviewId": "g5VLnydoyMaYt1m2lQ9EWg",
                "author": "Qype User\n absint…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I used to come here a lot, but have mostly stopped going since finding out that there is meat stock in all the katsu curries, including the vegetable one which leaves only maki and other cold dishes for vegetarians :(\n It is otherwise a fun, if slightly cramped, experience. This is great value food for central London, and it's a good relaxed place for a quick meal if you're catching a movie in Leicester Square. I just wish they did more I could eat!",
                "datePublished": "2011-05-28"
            },
            {
                "reviewId": "4Grz_-GO_zTmDqkGDcDaNA",
                "author": "Mital P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great food, great atmosphere, great service... if you can get a table! :)\n One of the best Japanese restaurants in the area, and a huge cut above the likes of Wagamama.",
                "datePublished": "2011-02-17"
            },
            {
                "reviewId": "0cyqQR8toUMB60Y5i4lqLA",
                "author": "Stephen A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "An awesome way to experience Chinatown! The soup, sashimi, tea, salad, rice, and everything else were very tasty and came out quickly. The staff are also very attentive",
                "datePublished": "2013-12-23"
            },
            {
                "reviewId": "-wj-j02WQIpE1FDsxsrv-g",
                "author": "Hussam B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Limited sushi selection but fresh and delicious. Great value for money.",
                "datePublished": "2014-02-13"
            },
            {
                "reviewId": "uKxAVCfbQ2TxSKfsYangFw",
                "author": "Grace L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "After skirting by this place maybe 87 times in my life...I finally decided to go in.  And I've repeated that decision.  So that means it's 3 stars (somehow this review seems very unenthused).\nGreat prices and tasty noodle and rice dishes (unagi mmm!) - I would skip the sushi though, seriously...just no.  If you're looking for something that's open relatively late for this city, perhaps after a show (I had just watched Jude Law's modern portrayal of Hamlet, complete with skinny jeans), then this would be the spot to go to.  \nDon't expect to be able to sit and wax lyrical over something or other for hours and hours; it's in the heart of Chinatown and next to a bar complete with colorful patrons spilling out looking for a bite.  \nI do love people watchin here though !!",
                "datePublished": "2010-05-20"
            },
            {
                "reviewId": "eFPi3jQMRWHrL7-swQOBRQ",
                "author": "Jill A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "You get a lot to choose from in this part of London so it can be very confusing. Tokyo Diner is one of those rare places in this area where you can guarantee good food and excellent service.\nMany places in the city will treat you like tourists and often the food is simply not that good unless you are willing to pay to venture the more expensive choice restaurants. Tokyo diner is therefore a rare find.\nI therefore go here for a quick lunch and order the Chicken Teriyaki Bento box which I highly recommend. This place is excellent value for money. I suggest you give it a try.",
                "datePublished": "2008-12-23"
            },
            {
                "reviewId": "ydUtC5MqL7ms0UGF_54pBg",
                "author": "Minal P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The Tokyo Diner is the best place to go for some good value sushi in Central London. Its just a short walk from Leicester Square tube station, and its open till late. This makes it a great place to go for a light bite to eat in case you are totally past the reasonable dinner-time due to a late movie or show. \nContrary to expectation, they hold a different view to service and its value. The menu lists the inclusive prices for each item, with service charge as well. They don't accept tips either. The service is excellent - they serve green tea and rice crackers as soon as you arrive, and keep refilling your cup through the evening for free. \nI love the hospitable efficiency at this Japanese diner. There are some good value Sushi sets at 6 pounds and more. There is a large variety of starters and some soups as well. I would strongly recommend visiting this place if you love sushi, and if you don't, well you just might start to.",
                "datePublished": "2008-11-18"
            },
            {
                "reviewId": "8pDd2Hc2-6o1RIN3-ws9KQ",
                "author": "Chiaki N.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Well what people say about London is quite true, food ain't all that great. But this place won my heart over. While my 2 week stay in London, for the first couple of days kebabs and pizza held me over but it wasn't before long that I started craving for Japanese food. Lo and bohold, I came across this goldmine. What made me even more happier was that the servers spoke Japanese! Service was good, we weren't being ignored or rushed. I find it fascinating that they don't accept tips! \nWill be back in August, can't wait to go back there again!",
                "datePublished": "2010-05-12"
            },
            {
                "reviewId": "Y4rCabWWBOiy_b7FivnpfA",
                "author": "Qype User\n Rutche…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "One of my all-time favourite places to eat!\nNo nonsense, pleasant and great, great food. And a spot of peace and quiet from the hurly-burly.\nAnd it's great for those with challenging diets.",
                "datePublished": "2011-03-14"
            },
            {
                "reviewId": "8IN3hwx5ETydlQ1w_e9ruw",
                "author": "Qype User\n crypto…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I used to go here all the time; went back recently and not much has changed, which is a good thing! It used to be extremely cheap but now it's a bit more. Still very cheap for Soho without being as dodgy as those Chinese buffet places all around the area. Bonuses include complimentary tea, free extra large portions if you want them, and strictly no tipping (which keeps prices even lower in real terms). The food is not extraordinary but there's plenty of seats and it's quick. Lots of people people have a katsu dish of some description because it's reliable, but the bento boxes are also good.\n One minor gripe: they missed one of the dishes from our group and we had to wait quite a long time for it. But they responded well: since it was so late in the end, we asked not to pay for it. They agreed without being stroppy, and it was struck off the bill.",
                "datePublished": "2011-04-21"
            }
        ]
    },
    "100": {
        "id": "rAAuLQbWTVZlfJcufwwdDw",
        "name": "Tokyo Diner",
        "category": "japanese",
        "servesCuisine": "Japanese",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "2 Newport Place\nLeicester Square\nLondon WC2H 7JP\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media2.fl.yelpcdn.com/bphoto/RvIBiv2XKnxHUDScvGMk8Q/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7287 8777",
        "review": [
            {
                "reviewId": "YBIMvHzYukV5OkbtP6F00Q",
                "author": "Qype User\n gutter…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great place to have lunch if you're in Central London. Situated on the edge of China town, this place makes a refreshing change from the sometimes stogy fare on offer. \nThe Lunchtime set menu will set you back about £8 and it really does fill you up.\nIn the evening there is more of an a-la carte feel to the place and the prices go up a fair bit, but it's great for either pre or post theatre munchies.\nWell worth a visit.",
                "datePublished": "2008-10-31"
            },
            {
                "reviewId": "q8olO118h6HS88km1MjCaw",
                "author": "Qype User\n ljric…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Tokyo Diner is tucked behind the Vue Cinema on the corner, and looks a little odd and unconventional that's because it is - the place is a golden find! The other night, pre-Batman, saw a power cut in this street, but happily there were still tea facilities and an incredibly friendly staff on attendance, easily making up for some dishes being unavailable due to London's dodgy grid.\n 2 things to know before you go:\n 1. Tokyo Diner have a sustainable food policy, which means no tuna at present, but the rest of the menu more than compensates, including authentic japanese dishes like Zaru Soba (buckwheat noodles on a bamboo mat, you dip the noodles in the given soy-based sauce then slurp), and delicious agedashi tofu which was pretty much inhaled rather than eaten.\n 2. No tipping! As they don't tip in Japan, any money mistakenly left on the tables is given to a London homeless charity. This hippy-esque approach only serves to increase my newfound love of the place, I'm so happy to report the food was as good as the philosophy behind it.\n So, excellent pricing structures, a smile on arrival and a great location will make Tokyo Diner my next pre-cinema dinner choice.\n Dinner: around £9-15 per person for food and tea.",
                "datePublished": "2008-07-29"
            },
            {
                "reviewId": "ODt52MQiEmHgWH45vyI9EA",
                "author": "Mark H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The best Japanese food I've ever tasted.\nThe bento box set meals and katsu curry are not to be missed, and try the eda mame if you want to try something new and tasty.\nCan get quite busy, but the prices are very good, especially for central London.\nIf you're ever in the area, and are feeling peckish, be sure to drop in.",
                "datePublished": "2011-02-27"
            },
            {
                "reviewId": "MfSh0Mrzid8Avsx4lcqHEA",
                "author": "Qype User\n Hungry…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "For photos please refer to\nhungryinlondon.com/2010/…\n \n Ironically in the middle of Chinatown there is Tokyo Diner, a cheap but decent Japanese restaurant. Even though the owner appears to be English (if you agree with me that Richard Hills does not sound terribly Japanese) the place has a distinct Japanese atmosphere to it. I have just been to Japan couple of months ago and Tokyo Diner feels very much like one of the Izakayas I went to in Kobe. I am talking not only about the furnishing and (as far as I can judge it) Japanese waiters but also the fact that, just like in Japan, tips are not taken, that you pay on the counter when you leave and that green tea (I think it was Hojicha) is served free of charge.\n The menu is really weird but at the same time rather entertaining: you can spend ages reading the detailed description about every dish as well as some trivia about Japan and Japanese food. In addition the menu contains 5 whole pages with allergy information regarding the nuts/seeds and gluten content for each individual dish.\n The food only partly lived up to my expectations. I was a bit disappointed actually by the Hoso-MakiI Set (6.20). The rice was too sticky and the salmon didn't taste that fresh. The vegetarian cucumber and pickled radish maki were much better actually but also they did not quite satisfy my palate which has become used to the outstanding quality of sushi in Japan.\n I love all kinds of Japanese noodles and particularly when I am hungover, as I happened to be at this particular occasion, nothing is comparable to the healing powers of a Japanese noodle soup. I chose the Curry Udon with Chicken (8.20) which was a very decent bowl of soup drenched with the rather mild but strangely addictive flavour of Japanese curry. The udon were not quite Koya quality but really not bad at all.\n It is not the best Japanese restaurant I have ever been to but considering how cheap, friendly and uncomplicated it is, it is well worth a visit for a quick pre-theatre bite or for a hangover cure.",
                "datePublished": "2010-10-25"
            },
            {
                "reviewId": "i_xEUlKVzv0s6yN6KPYwWA",
                "author": "Qype User\n marmar…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Tokyo Diner is everything you could wish for if you're looking for a no-nonsense delicious Japanese eatery, and comes with an elaborate menu and background information on all the (authentic) dishes.\n The vegetable curry udon were juicy and aromatic, the Tofu Katsu Ju, apparently one of the chef's own creations, brings a smile to my face with its crispy breadcumbed tofu and flavoursome miso based sauce and the edamame are nice and fresh. As a vegetarian, or even vegan, you're more than welcome and they mark vegan dishes especially.\n Then there's the free green tea that the friendly staff top up without needing a prod, free large rice portions (ask for an oumori portion), and the refreshing 'no tips' policy, and I'd say it's a winner. Sugoi!\n (PS: Wouldn't necessarily recommend it for a fancy dining experience, but at the prices offered, it's definitely fantastic value for money)",
                "datePublished": "2011-05-30"
            },
            {
                "reviewId": "KzAYgfmrJ8nME06n8lzAfA",
                "author": "Larissa R.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Average.\nThe sushi menu was limited.  I read a little anecdote on display about how the Japanese will travel across the country (of Japan) for freshly prepared soba noodles.  But, um, the soba noodles I got were so obviously not fresh.  \nIs this a dishonest or an ingenious marketing strategy?  I can't decide. \nIn any event, Okawari is just down Lisle Street, and it has a bigger sushi menu and lower prices.  If you want a more stereotypically Japanese dining atmosphere, stick with Tokyo Diner.  But you'll get more for your money at Okawari, and that's what counts, I think.",
                "datePublished": "2009-07-11"
            },
            {
                "reviewId": "BMrU9Y2R5Xmfczt0NlcJaQ",
                "author": "Phil R.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I'm sorry, I just wasn't feeling it. I wanted to like it. God, I wanted to have an awesome meal when I took friends out to thank them for helping me move, but it just didn't happen.\nI went with a couple of friends for whom Japanese food is not a specialty and so weren't sure what to order. I gave some advice, but their tastes (ie meat!) are different to mine so they asked the waitress. Very unhelpful. There was just no sense of 'oh try this' or 'if you like that then this is for you'. It was as if she hated being there and was nervous about anyone saying anything that resembled a question and didn't know what to do when it happened.\nWe ordered edamame to get things started.... which was fine until one of the party found a live maggot crawling over them... ok, so you don't eat the skins, but... just..... no. not for me, thanks. After the earlier 'conversation' with the waitress, we felt at pains to point it out, and we were tired anyway so didn't want to kick up a fuss.\nThe rest of the food was fine. Nothing spectacular but a good cheap option in a great location, just set back from Charing Cross Road, a minute from Leicester Square station.\nI'd like to go and try it again to see if I caught a new girl on a bad night, but I just don't want any more maggots on my food.",
                "datePublished": "2009-05-10"
            },
            {
                "reviewId": "ybTSW1qQqc1VOTPzLP1tUw",
                "author": "Qype User\n jokell…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Simply astonishing! Authentic dishes, might the most delicious food I have ever eaten. The food is just amazing, portions are as big as they come and on top of that there's green tea for free. There is a wide variety of food to chose from for some reasonable prices. Recommended!",
                "datePublished": "2012-12-14"
            },
            {
                "reviewId": "8OQcApBBitsNGPnx0m_4wA",
                "author": "Josie T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This restaurant is great it looks so japanese! The sushi was soo good I really love it. The green tea was for free. I cant wait to visit London again and have dinner at Tokyo Diner?",
                "datePublished": "2012-02-12"
            },
            {
                "reviewId": "wODhONofrh3e4POiP_1RpQ",
                "author": "Qype User\n ycf…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Fantastic. Friendly and informal but not in the least bit scruffy- as soon as we sat down we were given a complimentary cup of green tea and rice crackers and our food arrived very quickly. My udon curry was delectable, I've eaten plenty of East Asian food in my time but this was something else: flavoursome and spicy without being too hot and a generous portion to boot. Excellent value for money given the location and drinks are VERY well priced.",
                "datePublished": "2012-05-20"
            },
            {
                "reviewId": "ZOqmwpJjbxnbADZ4bE19jw",
                "author": "Gen E.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Before bentos, katsus, sushi and noodles became ubiquitous in London thanks to the like of Japanese Canteen, Wagamama and Wasabi, there was Tokyo Diner. \nTucked away in a corner in Chinatown, Tokyo Diner is an authentic Japanese-run restaurant serving unadulterated and homely staples of modern Japanese cuisine including katsu curries, udon noodles, donburi, sushi and bentos. The menu and dishes are straight forward, but the quality here is far superior to that of the aforementioned chains. You will actually see Japanese people eating here, which is always a good sign, as are the tight crowds during the evening rush. \nThe food quality here is superior to that which I've seen at 99% of the 'Japanese' diners in London though this is in part reflected in the prices. You can get away with spending under 10 pounds but I often find myself going closer to 15. \nI love the Japanese touches which make the dining experience here particularly welcome and authentic. There is no tipping or automatic service charge, you can request a complimentary large-sized portion of rice if you're extra hungry and the nifty automatic door which is cleverly disguised to look rather old and run down is a nice trick too.",
                "datePublished": "2011-01-04"
            },
            {
                "reviewId": "Upm2BY3KjDgz7LiLft4wnQ",
                "author": "gipi g.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "\"We do not take tips\" \nThe above words are what you see first. The food is ok. I had the Mini Una Don ( Grilled Eel served with rice and sauce ) and it was tender and tastes good. \nDon't know why they said \"NO\" to Tuna but serving eel as both are getting on well are on the endangered list!!! They serve hot tea; which I liked as its aids in digestion. \nThe first restaurant I visited in China town. I would recommend food lovers to try it.",
                "datePublished": "2010-03-03"
            },
            {
                "reviewId": "Hv56qwI4toN5wLb761Hf3g",
                "author": "Midnight B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is very japanese style restaurant with no tip required. The food is worth the money and there's green tea served unlimited. The atmosphere is very cosy and it's very nice during winter or cold days. Open most of the days and hours, it's definitely a good restaurant for money value and city lives.",
                "datePublished": "2011-03-01"
            },
            {
                "reviewId": "_UHhS-uRXbCPip_cJtI8Aw",
                "author": "Liam B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Having been to Japan I find this the closest to the dining experience there. From the sliding door, great noodles and paying at the desk when you leave. This is as close as your going to get to eating in Tokyo without going there. If you like Japanese food definitely give this a try.",
                "datePublished": "2012-04-22"
            },
            {
                "reviewId": "QnPFAKcs_BigqTbQ8l_6Hw",
                "author": "Qype User\n humano…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great cheap meals always to be had here! Their portions are very generous and for 10 squid you'd get a full meal. I love their salmon donburi, the freshest salmon sashimi over a bed of rice. You can also ask for more rice free of charge, but the restaurant asks to make sure you are able to finish your meal as to prevent food wastage.",
                "datePublished": "2011-12-24"
            },
            {
                "reviewId": "vIteC2uLOo2pZW5hGoP8qw",
                "author": "Hana V.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This place is quite small and you will probably have to wait if you go during a busy time, but it's worth the wait.  It's got character, lots of maneki neko and decorations from Japan (I want their sushi clock so bad!) and good service.  I had sushi one time and udon noodles another time, and both were very good.",
                "datePublished": "2011-03-12"
            },
            {
                "reviewId": "TZlQWXbAen3PJMRA5_9KKA",
                "author": "Qype User\n shogot…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Really love this place. best japanese restaurant in london so far. will definitely return when visiting the city again",
                "datePublished": "2012-02-12"
            },
            {
                "reviewId": "oKP9mTUhFqWBqXYWq7i1uw",
                "author": "Tom H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The food here is really good. Traditional Japanese. Really good katsu curry. The only reason it doesn't get a 5 star is the price, though the serving size almost makes up for it.",
                "datePublished": "2011-09-07"
            },
            {
                "reviewId": "dgpLkocbiDKQ6C0GVy_Miw",
                "author": "Seisei T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Not bad! I wasn't sure what to expect, but dishes were authentic and good. It's not fair to compare it to Japan, where the ingredients are better quality, but I am glad that a place like this exists, if only because I abhor Wagamama. This is where you can get things like hiya yakko (cold tofu), katsu curry, tsukemono, and una don. Very good value, great hours, and central location.",
                "datePublished": "2011-04-10"
            },
            {
                "reviewId": "edHTdvBGKw9e_2QhyIz6KQ",
                "author": "Karl V.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Very good japanese diner. The place is china town in London Soho. The dishes are cheap and cheerful. The servants speaking japanese and english. Awesome ambient. All in all my favorite japanese restaurant in Soho! A good space for discussions of japanese studies.",
                "datePublished": "2011-08-01"
            }
        ]
    }
}