{
    "0": {
        "id": "D5MqfwQo7qOS4VOYrlhGFA",
        "name": "Kanada-Ya",
        "category": "japanese",
        "servesCuisine": "Ramen",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Bloomsbury",
            "streetAddress": "64 St Giles High Street\nLondon WC2H 8LE\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/BgA-fOCfoFBEqfzTsSrk4g/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7240 0232",
        "review": [
            {
                "reviewId": "R03FLTuKWNJKJTNkgbfZUA",
                "author": "Nicole R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place is cute and delicious!! I came with my boyfriend and we each had a bowl of ramen as well as the fried chicken to share. It was all yummy.\nThe service was relatively quick and the ambiance is casual and fun :)\nOne of my favorite meals while I was traveling!",
                "datePublished": "2018-07-12"
            },
            {
                "reviewId": "nSGLVGGnCmf2c228LCjdZA",
                "author": "Jennifer Z.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "One of the best ramen I've ever had. It beats a lot of the ramen places I've been to in New York. The spicy yozu ramen is SO GOOD. The noodles were the perfect texture and the soup didn't taste like it was full of MSG. When I went the line was crazy long, but there's a reason why people wait that long to get in. Honestly if I had to wait that long on line again I would. Wish I could've gone back at least one more time before leaving London.",
                "datePublished": "2018-07-03"
            },
            {
                "reviewId": "j1Hd9h59htx8drUggyauZQ",
                "author": "Sharon T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Dubbed one of London's top ramen shops, I can only think of one word to describe Kanada-Ya: underwhelming. \nPerhaps it is London's pre-eminent ramen shop with lines flying out the door. Across, you'll find Ippudo, a world-renowned ramen chain that has hours-long waits in its NYC shops, sitting slightly emptier. Has Kanada-Ya taken the throne away from them in London? Maybe.\nI waited about 15 minutes on a Tuesday night. It is a very small, quaint corner restaurant that can fit less than 40 people. As I was approaching the from across the street, I could already smell the heavy truffle aroma from their popular Truffle Ramen from the swinging door. The patrons leaving, too, smelled like truffles as they dashed past me. Being a truffle fanatic, I was so pumped for the Truffle Ramen.\nI'm no ramen expert but this was far from the best ramen I've ever had. You might like this if you like light broths, but it's not creamy at all. The truffle oil felt more like it was there for the smell, and maybe some flavor. The pork was a bit on the dry side and took me awhile to get through. For the most expensive ramen on the menu (£14), I wish they'd included a Hanjuku egg or something because it felt...plain. Kanada-Ya is definitely overhyped. I can't speak for Ippudo in London, but I try to avoid it altogether like a plague since it's overhyped in NYC. London doesn't seem to have a very competitive ramen scene and that's sorta sad, given how many trendy Japanese restaurants there are in the area, I might as well have just gone to Japan Centre.",
                "datePublished": "2018-02-21"
            },
            {
                "reviewId": "XpLh7c16cC3-AHVz84pRMg",
                "author": "Miko B.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "It's kinda sad if this is the best ramen that London has to offer. I got their classic Tonkotsu X which was very very plain. The noodles were too thin and the broth didn't quite any punch. I should've ordered an egg to go with it, but the side black garlic sauce was a good choice.",
                "datePublished": "2018-04-19"
            },
            {
                "reviewId": "u9l2jzgw3pCBajedyumA_Q",
                "author": "Diyang Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I gotta say. I was kind of disappointed with the ramen here. Maybe it's my picky New York tongue, but I expected better out of supposedly London's best ramen restaurant.\nI got the Tonkotsu and the char siu don. The Tonkotsu broth was good. It salt level wasn't too high, and it certainly packed a punch! However, the noodles certainly let the meal down. It lacked that special pizzaz that great ramen-yas have. \nThe two redeeming factors were the meat and the char siu don. The meat was absolutely amazing; so soft like I was eating clouds. It was juicy and OMG my mouth is now watering just thinking about it. The char siu don (using the same meat) was equally as good. \nAs weird as this sounds, if I go back in the future, it would definitely be to just crush three of those char siu dons.",
                "datePublished": "2017-12-12"
            },
            {
                "reviewId": "9sJM1_TwtrhAChpUWR-hhA",
                "author": "Jordan H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great place to grab ramen on a cold evening, but not a place to go if you're in a rush, because of the wait. Once you're in the door, everything is quick to come and fresh! I had the spicy yuzu ramen and some karaage japanese fried chicken. Big portions, so I couldn't eat it all. Both were awesome! I would definitely come back.",
                "datePublished": "2018-09-19"
            },
            {
                "reviewId": "Bmpso7Bjj6GrieJvlbIUgQ",
                "author": "Sarah C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "From the reviews, best ramen in London. Not surprised as it was quite good. First off, it is a small place and they don't take reservations. Be prepared to wait in line (no wait list to sign up). There's a bench outside and they provide small cups of tea sometimes while you wait. The turnover is quite fast so don't be too intimated by the amount of people. \nThe food comes out ridiculously fast. I got the only in London ramen and my husband got the truffle. The ramen is pretty bare bones in terms of toppings. If you want anything like an egg or garlic oil it's extra. You can pick your noodle toughness which is nice. Portion is just right so you can order something else. The broth is really thick and flavorful. I personally enjoyed the charsu and I normally don't.  \nKaraage was pretty good. 4 pounds for three decent sized pieces. Nice crispy outside and good sauce. \nNot the best I've had but it was pretty good. If I was a local I would come back but not often given how expensive it is.",
                "datePublished": "2017-09-27"
            },
            {
                "reviewId": "Nxt5qs67GIQAVljPyNuNSQ",
                "author": "Cindy T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great ramen option in London. We were swayed by seeing the line when we were initially planning to go to Ippudo across the street. The line moves pretty fast. Be ready with what you want to order before you get inside. You could always grab a beer at the convenience store next store and have it while you wait. \nOrdered the spicy yuzu which actually had a good amount of heat with the soft boiled egg which you must add to any ramen you get. I would even budget more stomach room for more eggs! Also ordered the chasu with garlic oil and egg. Both were amazing with hard noodles. The noodles are thinner than most ramen places. The chicken katsu was the perfect amount of salty and crunchy. Definitely filled my ramen craving. Also pretty large portions so be sure to budget stomach room.",
                "datePublished": "2017-09-23"
            },
            {
                "reviewId": "f07iokiyZ78ag2UIEA5XBA",
                "author": "Carolyn Z.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Nothing special, and I still needed to wait in line for 30 minutes.\nI hail from San Francisco where we have a very competitive ramen scene. After eating at Kanada-Ya, I have to say that if this is the best that London has to offer, I feel really bad for people who live in London. \nI decided to come to Kanada-Ya at the last moment, so when I got there about 15 minutes after they opened, there was already a line of about 20 people waiting to get inside. I waited about 20-25 minutes and was allowed inside. Because we were given menus while waiting in line, before I even sat down, I placed an order for the tonkatsu X ramen with noodles cooked hard, umeboshi onigiri and the chicken karaage. I figured that if I was only to come once, I was going to order everything I wanted to try. \nThe food came out relatively quickly. The chicken karaage came out first and was the highlight of the meal (that's sad considering that the ramen is supposed to be the highlight). It was crispy, very well seasoned, and the dipping mayo was very good. I highly recommend you order this when you are here. It was a reasonable portion for the price. \nThe ramen came next. I prefer the thicker ramen noodles, and these were the thin kind. The broth didn't taste very special. They claim that this broth takes a really long time to develop, etc., but it really doesn't taste like 20 hour (or however long) broth. There were no complex flavors that you would come to expect from a broth that took so long to make. The char siu was pretty good, but when I eat ramen, I expect the broth to be the highlight. \nI don't recommend the umeboshi onigiri. I grew up eating umeboshi and they give you the large, cheap, sour kind, not the expensive honey somewhat sweet and sour kind of umeboshi. Sure they were big, but definitely not worth the price. But honestly, what did I expect from a place that specializes in ramen.\nIf there is a line for this joint, I recommend going to the Ippudo across the street with no line. There is no reason for you to stand outside in the freezing cold (if it's winter) for 20-30 minutes to eat a bowl of subpar ramen. My friend did try this place out before me, and suggested I not go because this was nothing special, but I didn't listen to him because I just love ramen.",
                "datePublished": "2017-12-28"
            },
            {
                "reviewId": "m4L02rRUj45KumJHNSOB1A",
                "author": "G P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great ramen with a decadent and rich tonkatsu broth. Noodles were also al dente and perfect amount of tender chasu pork. Only issue was the lack of air conditioning! Slurping ramen in a 80 degree room was not fun hahhaha",
                "datePublished": "2018-05-31"
            },
            {
                "reviewId": "caI5ai1wKCECC5CtLO7TCA",
                "author": "Irene K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "After living in the Netherlands for a few months, I was craving ramen like no other. I tried to get it in Switzerland (major mistake, their ramen was from the instant ramen packages from the supermarket) and then tried it again in the Netherlands for brunch (also mistake, the noodles were soggy and the broth/meat had no flavor). So when we were going to London for a weekend, I decided that ramen would be our first meal. \nKanada-Ya doesn't take reservations, so we got there around 7:45 and there were about 6 people waiting outside the store. We got seated in about 20 minutes which was much better than I expected. I got the truffle ramen and my boyfriend got the Tonkotsu-X, and we split a chicken karaage. This was too much food for the both of us but I really liked the chicken (not overly fried or oily). My ramen was good, but not amazing. I love truffle but I actually didn't really like it in my ramen, but the Tonkotsu-X was great. The ramen also doesn't come with an egg so make sure to add one if you want! They recommend you get the hard noodles which were perfect to me. \nOverall, great ramen spot in London.",
                "datePublished": "2017-11-29"
            },
            {
                "reviewId": "3smb0qh3yEr9OsyD07jVfQ",
                "author": "Taylor Z.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Quite a delicious ramen place. From the reviews, I guess this must be one of the best ramen houses in London. I've been to ramen places around the world from Tokyo to San Francisco, Kanada-Ya is probably somewhere in the middle on my list of great ramen places (still pretty good!)\nThe seating inside is quite tight but that's pretty typical of ramen places. The broth they use is a classic and you can tell that they brew it for over 10 hours with pork. I absolutely love this style of heavy broth, it gives the ramen a richness that is quite unique compared to other styles of noodles. The chasu is decent but nothing that floored me.\nAll in all, a decent place for a bowl noodles. It is quite expensive but that's expected in the heart of London. If you need ramen in London, this is probably the place to be (as evidenced by the rave reviews and long lines).",
                "datePublished": "2017-05-30"
            },
            {
                "reviewId": "rYbKd2M34DCnMa9medxBLQ",
                "author": "Jun O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Possibly best you can have in London. Qualified evwn for Japanese. However please surely come to Tokyo for much better ones. Forget Ichiran or Ippudo",
                "datePublished": "2018-05-23"
            },
            {
                "reviewId": "vBG9dkeiy5joKPWHOc3GXw",
                "author": "Aiza C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Very good ramen and queuing is worth it, doesn't take too long anyways. Chose the Tonkatsu with black garlic oil, which had to pay extra for. \nAlso had the chicken karaage, which was very crunchy on the outside and chicken was moist. Highly recommend! \nOverall delicious taste. I would've given it five stars but only four stars as had to pay extra for the black garlic oil as well as a portion of the eggs on my bowl of ramen. I would go back, but not quite in a hurry.",
                "datePublished": "2017-09-08"
            },
            {
                "reviewId": "WcsM_tv9CTWxICurjPJO3A",
                "author": "Kamran N.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Amazing ramen but you will end up waiting a long time if you arrive at peak hours. Service is also great and friendly and I would agree with other comments that probably best ramen in London . We are now regulars here and have learned when to be there to avoid the queue",
                "datePublished": "2018-03-24"
            },
            {
                "reviewId": "q1oTiM10zy3Jfvx_ty04vA",
                "author": "Amy H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Kanadaya does the best ramen in the UK! Try avoid 1-2pm or 7-8.30pm slot as you will most likely be queuing for their seats. Early lunch like 12.30pm or early dinner at around 6.30pm are always good time slots with no queues. \nEven though their speciality is added truffle oil, I find the truffle oil smell a bit too thick and strong in noodle soup or with the edamame beans. My favourite dish is their Tonkatsu x with 'hard' noodles (yes, you can customise your noodle!). No matter how many times I dine at Kanadaya, I can't get enough of their noodles and I will always be back!",
                "datePublished": "2017-08-12"
            },
            {
                "reviewId": "UmY6Q-NBeFe71qGOGS7JSw",
                "author": "James A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The Ramen here is simply amazing, the best I've had. I tried both the spicy options at different times, and they both have a good level of spice, while maintaining great flavor.",
                "datePublished": "2018-07-20"
            },
            {
                "reviewId": "z0ZfNaboV6Ot2heg1Sml8Q",
                "author": "Jeanne N.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hi. We really liked this little place. There was a fast seating line - true to ramen houses.  We all had different ramens and I loved my chashu ramen. We also got a side dish of chashudon and the rice under the meat was so good.  \nI think everyone wants to go back.  So far we've tried a dumpling house, fast Japanese food and Indian in London and surprisingly it was not good.  \nSo glad we found this little chain",
                "datePublished": "2018-06-19"
            },
            {
                "reviewId": "Y3McA9KZ8SjKTQLLeIQecA",
                "author": "Ching T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The broth is kinda light, and mixed with noodle's smell. Go there 5 minutes before they open and avoid lining up.\nUnfortunately, I can't finish their ramen because the strange taste of the broth.",
                "datePublished": "2018-03-10"
            },
            {
                "reviewId": "h7duOc9KwuAIcZxKDdqETA",
                "author": "Danielle R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The spicy yuzu ramen was so delicious I had a dream about after eating it. The spicy, savory, tangy flavor was insane. Loved every bite of it! This is my new favorite ramen spot!!",
                "datePublished": "2018-04-17"
            }
        ]
    },
    "20": {
        "id": "D5MqfwQo7qOS4VOYrlhGFA",
        "name": "Kanada-Ya",
        "category": "japanese",
        "servesCuisine": "Ramen",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Bloomsbury",
            "streetAddress": "64 St Giles High Street\nLondon WC2H 8LE\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/BgA-fOCfoFBEqfzTsSrk4g/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7240 0232",
        "review": [
            {
                "reviewId": "GiK8zOJLEkprpdYHxBAEUQ",
                "author": "Alison A.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Cute little ramen shop on the corner of St. Giles High Street.\nCan only speak to the experience of making a light and early lunch out of a few side dishes, the chicken karaage (small portion for £4) and the truffle edamame (large portion for £4). I went there with the intent of having a nice bowl of ramen, but they were out of char siu, which doesn't make much sense for a ramen house since char siu is such an integral part of the dish in general. Every single one of their bowls contains char siu, and the Yelp photos suggest hearty portions, and to not have it available is like saying they're out of ramen broth or noodles, hence my reasoning for just ordering a few sides at that time.\nWhen time came to pay the bill, I was told by the staff that if I want to ever dine there again, I have to order ramen. Okay, that makes sense, and I came with the intent of having ramen but decided against it since I would be paying full-price for a meal that lacked an integral part of its essence: the thick slices of char siu. So it was a little off-putting to be blatantly told this. \nNext time, I'll probably opt for a different ramen joint in the area with better prepared karaage and one that would have char siu in stock.",
                "datePublished": "2016-08-04"
            },
            {
                "reviewId": "PglsBSlO8vZ_wmkuOUjpRA",
                "author": "Jiaying K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Pretty authentic Kyushu Tonkotsu Ramen, definitely one of the best in London. The broth could be heaven for some and too thick for others.\nI've been here for many many times so you know how good it is.",
                "datePublished": "2017-05-29"
            },
            {
                "reviewId": "7ahvzd5DVaGTjGaYMwAQJA",
                "author": "Ali C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Yes!  Finally, I have found it after eating hundreds of ramen.  The best ramen in London!  This establishment has only tables for about 24 people.  I suggest coming here early to ensure you are the first 24 go get in the door first.  If not, you will need to wait for one (or more if in a group) to finish the first round before the line starts moving.  The queue here is definitely long especially on a weekend.  I arrived 20 minutes before it opened and there were already at least 20 people queuing.  When it was time to open, I guesstimated that there were about at least 60 people waiting in line.  You definitely need to come early or you will have to wait in line.  \nThis place is a no fuss, quick and efficient place with a quick turnaround like a pure ramen bar in Japan.  The menu is also very short so you will already know what you want by the time you sit down.  I suggest when you sit down, order straight away.  They expect you to eat and leave so best not to hang around too long.  I got in alone bang on at 12noon and out 20 minutes after.  That's how quick it was.  \nThe noodles was cooked to your liking and this is what I love about this place.  I suggest the extra hard noodle so it is 'al dente'.  A lot of other ramen place has the noodles cooked too long and soft which is not what I like.  The broth is simply the best in the city and it leaves you wanting more.  Rich, creamy, smooth and so much flavour.  Do not bother with the sides as they are not worth it.  Just go straight for the ramen.  Make sure you get the mayu and marinated eggs together with your ramen.  Oh the eggs, so good and I usually have 2 of them instead of one.\nThe ramen here is definitely worth the wait for no doubt.",
                "datePublished": "2016-04-10"
            },
            {
                "reviewId": "YuJESth-GTyREft-5A8q_Q",
                "author": "Justin R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place specializes. Pork ramen is their thing. The menu is basically 1 pg, and that's for the best, because what they do, they do very well. Come here if you love ramen, pork, and dedication to craft. Don't come here if you give a shit about fancy decorations. Was hot and steamy inside like a bowl of ramen. The front window looks out onto a much fancier, much more expensive Japanese restaurant called Ippudo. Pretty sure this is the way to go though. Compliments to the chef.",
                "datePublished": "2017-06-24"
            },
            {
                "reviewId": "ukRlz5fcyY20i-SWaV-1og",
                "author": "S R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good ramen. Nice portion size and filling. But not sure if it merits the 30 CAD price tag per bowl. Service is friendly enough. \nNo reservations. But there are benches outside. \nRepeat: Perhaps.",
                "datePublished": "2017-07-22"
            },
            {
                "reviewId": "2N2_9c_zolzNrlD7i7Atog",
                "author": "Lynn H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love the Truffle Ramen.  My second trip to London this year and I had to order this dish again!  I would say they have my favorite broth.  However, I wish they can do soft boiled Instead of hard boiled egg. My son got the spicy Gekikara ramen, which he also thoroughly enjoyed. The chicken karaage was also excellent.",
                "datePublished": "2018-07-02"
            },
            {
                "reviewId": "xwJ3LXqAMtDXoIT9RcZYqg",
                "author": "Christine H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hands down, best ramen in London. Better than ippudo or shoryu. The broth is the real deal. Love the thin ramen noodles. The different flavors you get with tonkotsu x, yuzu and gekikara broths are so satisfying in their own ways. Tonkotsu x has a nice creamy taste and not too rich like some other places. I was able to finish the broth. Yuzu has that extra kick in it with a slight citrus (note: not lemon or lime.) More of a tart, pepper zesty taste. It cuts through the richness of the tonkotsu broth. Perfect for me. My fiancé had the gekikara and wow. The minced beef adds a deeper taste of beef to the broth. I think I have to get it the next time I go. \nI was able to come here twice on my trip. First time I had tonkotsu x and fiancé had yuzu. Second time I had yuzu and he had gekikara. Next time I'll have gekikara and he will have..??? :) probably spicy miso!  \nAlso I'm usually not a fan of chicken karaage. Actually I don't like it at all. BUT I tried it and it is better than most other ones I've tried. Not oily and very crunchy. Their onigiri also comes out hot! Very homey in the winter time.",
                "datePublished": "2016-12-02"
            },
            {
                "reviewId": "iyzcMEQnao_hRa4vZZIMyQ",
                "author": "Andrew J.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Ok so im a Japanese ramen aficionado. In California I have been to all the top Japanese ramen spots.. This by far is the best i've had. Put it this way Ippudo is right across the street and I did not go there. Why? Because a line started to form before they opened so I walked over and started speaking to the locals and they said by far Kanada-Ya was better and I have to agree. This broth is so rich.. The broth is simmered with pork bones for 18 hours and you can really tell. \nI ordered the classic and just added eggs which were perfectly cooked, you know what im talking about, that dark yellow runny yolk in the center mmmm. It was perfect for the chilly 40 degree weather in London. Im a westerner I use fahrenheit so excuse me lol. I also got a side of spicy miso and added a little to spice it up! \nKanada-Ya you guys know how to cook up a bowl of delicious, comforting ramen! Definitely recommend!!!",
                "datePublished": "2016-03-11"
            },
            {
                "reviewId": "NNWiuBiUAqQ-5H_HP1ztMw",
                "author": "Maria L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The place is very small and everyone is a bit crumbled inside, plus, there is usually a waiting time. But the food absolutely makes it up. Amazing ramen and fried chicken. \nService is fine, could be much better. A really good non expensive option for ramen.",
                "datePublished": "2018-04-01"
            },
            {
                "reviewId": "xGVdHUTnUwRHn6FQF9ilFA",
                "author": "Shelley S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I had the fried chicken which was just OK - not something I'd order again. The Spicy Yuzu Ramen on the other hand, was INSANE! So freakin' good. Spicy, with citrus and a buttery lobster-like broth. I ordered the egg add-on which was good, but not a game changer. The odd thing about this place is that they don't have takeaway containers that you can carry leftover ramen home in, so skip the appetizer and come hungry so you can eat every last bit of your ramen. This is a must-return spot.",
                "datePublished": "2017-07-09"
            },
            {
                "reviewId": "sYQWuRS8tSPkRp-vPX2OGg",
                "author": "Carolyn V.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The Good:\n  :: it's a local business!\n  :: this place is the real deal. you see tons of asians eating here, and we all know that is instant street cred. :D\n  :: they have a simple menu and they do those few items really really well\n  :: their ramen is LEGIT. the broth is rich, the noodles are cooked to your preference (soft, normal and firm), the fixins in the meal are tasty and fresh...everything tastes DELICIOUS.\n  :: the karaage (japanese fried chicken)...so so so so good\n  :: service is friendly\n  :: clean and bright inside\nThe Bad:\n  :: it can get CROOOOWDED bc everyone loves this place. prepare to wait in line outside, which can suck if it's really really cold out or if it's raining out. but remain steady bc the wait is worth it!!!!\n  :: very small...not good for crowds at all. think you or you and another person, that's it.\nThe Ugly:\n  :: none\nWould I go back? A thousand times yes!!!! For an authentic ramen house, you won't go wrong here, I promise.\nThis place is IN.",
                "datePublished": "2016-08-18"
            },
            {
                "reviewId": "X7ON2jm7VDwKJTMIB2aDzg",
                "author": "Jonas M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love Ramen. Whenever I have the opportunity to try out a new ramen spot, I go for it, so naturally, I couldn't just leave this one out. Having read a lot about this restaurant I wasn't sure what to expect and whether it would be the real deal or just a massively overhyped tourist-trap. Now that I've been there, I do believe the hype.\nThe first thing that caught my attention was the line in front of the restaurant, which is perfectly normal in Japan but rare to come across in the West. Like in Japan, you are handed the menu in advance so you can already decide on what you want before getting a seat as the line moves rather quickly. We opted for a classic Tonkotsu Ramen, a spicy Yuzu Tonkotsu and some Karaage (fried chicken) as a side.\nI wasn't sure what to expect from the Yuzu Tonkotsu but it was absolutely delicious. The acidity added by the Yuzu was just right, combined with a hint of spiciness it nicely balanced out the fatty broth, adding a little freshness to an otherwise hearty and earthy dish. While the soups were stellar, what really stole the show was the Karaage. Coming with Yuzu-flavored mayo and a slightly spicy batter, the fried chicken was modeled after the flavor profile of the spicy Tonkotsu, which worked great. The meat was super juicy, and perfectly cooked through while the spices didn't distract too much from the chicken itself. Probably the best fried chicken I've had in my life.\nIf you like Ramen and you're in London, I'd highly recommend giving this one a try.",
                "datePublished": "2018-01-06"
            },
            {
                "reviewId": "pugRpSC_hCR67cPYn_7emw",
                "author": "Christina L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Super tiny ramen shop located right across the street from Ippudo and likely to have a queue during peak lunch and dinner hours. I came here at 1:30-2:00 pm on a weekday by myself and didn't have to wait which was awesome.\nIt's easy to make a decision on what to order since they don't have a very extensive menu. They make a few things very well. They serve some karage, some other appetizers, and 4-5 types of ramen. I got the Tonkatsu ramen, added some spicy miso paste (which came in a spoon so you could control how much you wanted to add), and added an egg. I like that you can specify the texture of the noodles (hard, medium, or soft).\nThe broth was rich and flavorful, and the noodles were perfectly al dente, and it was certainly one of the better bowls of ramen that I've had. But having just eaten at Ippudo in NY the week before, I just preferred Ippudo a touch more. I'd wait for this ramen again for ~30 min, but not sure I'd wait 1+ hour for this. Perfect for a grey, cold, blustery day. My total for the ramen, spicy miso paste, and egg was £16 so it's not exactly cheap, and it seemed to be smaller than the Ippudo NY ramen I had.\nCome solo or with only one other person, and be prepared to eat communally at the bar or a long table. The space is small and fits only ~30 people, so if you have a party of 4+, go elsewhere!",
                "datePublished": "2016-09-29"
            },
            {
                "reviewId": "Rogm8rc0EDAeMgV2QVRyhg",
                "author": "Seo Young M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I'd say it feels like a typical Japanese ramen place. Ordered the Tonkotsu X and the noodles tasted okay (pretty thin noodles) and the broth was pretty good.",
                "datePublished": "2016-10-11"
            },
            {
                "reviewId": "GIYpqB-0OwsyvJkred_fcA",
                "author": "Yean D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I thought the ramen here was well worth the wait (approx 30 minutes during dinner time)! I had pretty high expectations for this place, as it came highly recommended, and it didn't disappoint. I had the tonkotsu x, and my friend had the spicy yuzu. Both were great. Quite a small space, so don't expect much wiggle room.",
                "datePublished": "2017-12-30"
            },
            {
                "reviewId": "1hUDJ_r70vfRlqt28Tpb5g",
                "author": "Yummy Jubbly Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "We continued our venture of Ramen in central London and we went to their original branch.\nThe menu is as small as the restaurant, with a choice of only 4 types of ramen. As we went as a party of 4, we got to order all of them to try.\nOriginal Ramen (£10.50) - The Original Ramen at Kanada-Ya forms the basis to all their ramens and what you see is what you get! A generous portion of ramen noodles served with an 18-hour pork bone broth, topped with slices of chashu pork belly, wood ear fungus, nori (seaweed) and spring onion. The menu also says there's a secret sauce in this, not sure what it was, but it definitely tasted great! The broth was intense and full of flavour. The slices of chashu pork were melt-in-your-mouth tender. All the different toppings not only made the bowl of ramen pretty, they also added to the overall flavour and texture. If you like the simple things in life, then you won't go wrong with this Original!\nMoyashi Ramen (£11.50) - the Original Ramen, topped with steamed beansprouts. This is one for those of you that like a bit of veg in your ramen. The steamed beansprouts were just cooked, so they still had a bit of crunch to them.\nChashu-Men (£13.00) - the Original Ramen, but instead of the pork belly slices, you get massive pork collar slices. The pork collar had just the right amount of fat, evenly distributed across the meat. Which means it was super tender, but also had a bit of bite to it.\nGekikara Ramen (£13.00) - Served with spicy 'tan tan' style minced pork and pork belly chashu. This is perfect for those that like a bit of a kick in their ramen. As you can see, it's pork mince, with pork belly slices, in a pork bone broth. So this is pretty porky! The spiciness isn't too overpowering, so you can still taste all the different levels of flavours from the ramen.\nWe also had a side dish of Karaage (£6.50) - which were deep fried chunks of chicken, served with creamy Japanese mayonnaise. These were super crispy and moist. The seasoning was in the coating and on the chicken itself. So we could tell they were freshly cooked for us. Extremely yummy and a must try if you come to Kanada-Ya. We think they would've tasted even better if they were spicy tough.\nAlthough the ramen was nice, the broth could've been more intense. We also felt that the ramen needed the additional toppings of the pickles, garlic and sesame to really bring it to life.",
                "datePublished": "2016-07-13"
            },
            {
                "reviewId": "OJCS5zyacxi4JCUkhbxgtg",
                "author": "Matthew G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "THE BEST RAMEN IN ALL OF LONDON! \nSorry for the capitals, but it's true! You won't find a better Tonkotsu Ramen in London than the selection you'll find here. I found myself as a bit of a ramen fanatic this passed year... Trying all the varying ramens in London (I have a lot under my list now!).\nI almost always for go the Tonkotsu or Chashu Men Ramen. The Chashu comes with more pork than the Tonkotsu, but is slightly more expensive. The taste of both as fantastic. Always get Hanjuku Egg to accompany your ramen, the way Kanada-Ya boils these eggs is amazing.\nTo accompany this incredibly tasty ramen I always have a Calipis to drink, and Salmon Onigiri and Karaage as sides. \nSeriously, there is no better ramen in London. You MUST come here.",
                "datePublished": "2016-06-15"
            },
            {
                "reviewId": "7Wo9av5VnKl7ouOLcCi4bg",
                "author": "Xinmin Z.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Tonkotsu ramen X is quite like what I've had in East Asia. All in all, good place to enjoy some delicious ramen.",
                "datePublished": "2017-12-04"
            },
            {
                "reviewId": "vUYGxGjFIE6S66FC9_SnpQ",
                "author": "Rafa P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "After 2 Museum walks, We were looking something different, We saw Ramen and walk to this small place to give it a shot, Well is really good, We ate Tonkotsu and was deliciuos. Packed with flavor, I add the spice red sauce and then it really came to life.",
                "datePublished": "2017-02-20"
            },
            {
                "reviewId": "GPtYAhzQopGDnfYlZK_t_w",
                "author": "Sharon L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "We originally wanted to visit Ippudo that was across the street. But after talking to my friend who lives in London, we decided to visit Kanada-Ya, as she said was much better. I'm very glad we did! We came on a weekday evening at 8PM, and there was still a wait outside. The place isn't huge but they utilized the space very well to maximize the number of people they can seat. We got an order of karaage to share, along with a bowl of ramen for each. They also serve onigiri, but it would've been too much food for us. I told my boyfriend that the ramen was comparable to the ones we had in Japan. And afterwards, I found that they actually do have stores in Japan! Anyways, super solid ramen place. If you're in London and want some authentic ramen, this is the spot!",
                "datePublished": "2016-07-09"
            }
        ]
    },
    "40": {
        "id": "D5MqfwQo7qOS4VOYrlhGFA",
        "name": "Kanada-Ya",
        "category": "japanese",
        "servesCuisine": "Ramen",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Bloomsbury",
            "streetAddress": "64 St Giles High Street\nLondon WC2H 8LE\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/BgA-fOCfoFBEqfzTsSrk4g/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7240 0232",
        "review": [
            {
                "reviewId": "yEdx5YK8JYQQDDmWyKkFXw",
                "author": "Kristie Y.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hands down, one of the best ramen eggs I have ever had in my life. The yolk had a great consistency, not too runny, not overcooked.The ramen they serve are the thinner ones, so if you're a fan of thicker chewy ramen, you might not like this place. I had their Chashu ramen, and it came with 4 slices of chashu which was great. Overall, I have absolutely no complains about this place. Although the queue gets rather long during peak hours, I think it was worth the wait.",
                "datePublished": "2016-11-30"
            },
            {
                "reviewId": "WgwJ9zXvItOXWYzmpyrOwA",
                "author": "Marine B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good ramen - excellent ingredients, fresh condiments (esp. freshly grated garlic when we went) which you can add as you wish, and they master their yolky eggs to perfection. We found that the broth maybe lacked a little bit of flavor - but that's probably because we are used to more soja-y or miso-y flavors in France (and most ramen shops propose different broth flavors, which you choose from when ordering your ramen). \nNote that it is a bit expensive: £10.50 for the most basic version, £13 for the version with more pork of better quality, £2 for an egg, plus 10% service charge - free tap water though.",
                "datePublished": "2016-06-22"
            },
            {
                "reviewId": "anl8tHYYZBGFn704u7_qXg",
                "author": "Nicole J.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "If Yelp would let us post just one word, then that is what I would do....scrumptious!  I have tried other Ramen spots in London, and no one can compare to Kanada-Ya (all their locations).  The flavor of their broth, their perfect noodles (my entire family prefers the hard noodle), the sauces, fried chicken, beer...all amazingly tastey.  We have tried every one of their ramen offerings and not one of them disappointed.  Typing this now I am actually salivating...I just may have to run over there for lunch today.",
                "datePublished": "2017-09-28"
            },
            {
                "reviewId": "sJyS_YDyc4JiYGaIEnZnAw",
                "author": "Lloyd S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I finally built up the patience to get in the Que for this place.... For over a year now I've had my eye on it waiting for the hype to die down and a chance to have the famous ramen without the infamous pre-que!.. but today I realised it was never going to happen and I'd have to que like the rest of the world. In fairness it wasn't that long a wait (maybe 20mins)\nOnce inside you see the reason for the line.... It's really small. Comfortable but small. To maximise the seating, you will probably have to share a table. If your a group of 3-4 be prepared for a longer wait and bigger groups..... At your own peril!!!\nThe Ramen... This is what it's all about! The standard product is as good as the reviews make it out great broth, good noodles (choose how they are cooked) and great additional ingredients. Make sure you read what comes as standard though as I didn't and it meant I missed out on the egg (in most other places this comes as standard) I couldn't be bothered to order it after the ramen arrived . Btw, it comes out quick!! We also had a side of carage chicken, not the best but ok.\nThe service is economicical, but you won't be in there long enough to have any complaints... You may line up longer than you spend inside. They also also add 10% service on to the bill.\nThe food is good, the place is nice and the price is reasonable in comparison.... But damn, I hate quing!",
                "datePublished": "2016-01-16"
            },
            {
                "reviewId": "29NS1NsBlM9WrxRj8qrBdw",
                "author": "James H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Delicious ramen. Nothing fancy, just amazing ingredients prepared well. Dropped by after a long day and a big bowl and cold beer perfectly hit the spot.",
                "datePublished": "2017-08-31"
            },
            {
                "reviewId": "XrxZ029C7pbrB2SjaDpYpA",
                "author": "Eric L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Spicy uzu ramen was amazing! Truffle is a little overwhelming for the pork broth.  I prefer the OG pork broth.  Our favorite ramen spot in London.",
                "datePublished": "2017-08-21"
            },
            {
                "reviewId": "GVxAutJJwt40o5kZJ21DqA",
                "author": "Josy A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Oooh I do like it when a ramen-plan comes together!!\nKanada-Ya has been advertising in Japanese newspapers for aaages, so I had the soft opening on my calendar for weeks (and my colleagues and I have been drooling at their twitter feed's pictures of perfect Tonkotsu and eggs...) Today was the soft opening, and although it wasn't perfect, it was still pretty damn good.\nThe Goooooood:\n- The soup is rich, thick Tonkotsu and is really, really tasty. I thought this was one of the best Tonkotsu soups I've tried in London. \n- The spicy miso paste was also good. One portion was enough to spice up both of our bowls. Seriously yum.\n- You can add extra noodles if you run out and are still hungry.\n- The service was really friendly and sweet, despite the madness of people queuing around the block.\nThe saaaaad:\n- Tonkotsu was the only option today. I'm not sure if they'll add more broths later, if not, don't bring veggy friends or non-pork-eating friends.\n- Even though there was only one broth on the menu they ran out of looooads of options. I was planning to have an egg and the black garlic sauce, but they ran out before 7pm. Boo.\n- They gave us the option of hard or soft ramen. We chose hard, but our ramen were pretty normal (not particularly al dente.) They weren't bad, but they weren't \"hard\". \n- Hopefully they'll improve the ordering system, as we had to ask for our spicy miso twice, and it took aaages for drinks to appear. We'd finished half our ramen before drinks and miso arrived. Doh!\nI think I'll have to come back once they have opened properly to see if it gets even better. For now (as the soup was sooooo good) I'd give them 4 stars for flavour and 2 stars for service.\n* It's 50% off during the soft opening, so do go and try it!\n* Get there early before they run out of everything!!",
                "datePublished": "2014-08-27"
            },
            {
                "reviewId": "D5eBfGtAHofh1zr6KPXigg",
                "author": "Linda J.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "We've been dying to try Kanada-Ya, but wasn't about to wait in a queue.  We decided to give Monday at 2:15 PM a try and we were lucky to beat the lunch rush and walk right in!\nFood: We both ordered the original ramen (one order with egg) with our noodles \"regular\".  They ask you how you would like your noodles cooked which is awesome.  We added two original onigiris as well to our order.  The ramen broth was so flavourful and just down right delicious with the perfect noodles.  The onigiris were simple and perfect.\nDrinks: We ordered one diet coke and one Japanese lemonade which is their version of sprite.\nPrice: 29.40 GBP for two people.\nAmbiance: The restaurant is very small, but bright and cosy in a good way.   \nService: The service was efficient and very friendly.\nWould I go back?  Definitely!  This is my new favourite ramen house in London.  Sorry Bone Daddies and Shoryu, there's a new kid in town.",
                "datePublished": "2014-09-24"
            },
            {
                "reviewId": "vN1yQOrEPtgfTkvXmvSa2A",
                "author": "Alexis T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is the absolute best ramen I've ever had by far.  The broth is so rich - full of flavor alone. I always ordered the Tonkotsu Ramen and add black garlic oil and an extra egg. I'm a huge ramen lover and I've never had a tamago (seasoned egg) as good as Kanada-Ya's. The noodles are firm just how they should be and the pork is very tender. I sometimes get Karaage (fried chicken) as a side and the Elderflower drink as my beverage. The chicken is so juicy and is perfectly seasoned. I'm from California and wish I could go back to London just to eat here again!",
                "datePublished": "2016-01-14"
            },
            {
                "reviewId": "7617tCOC9esNYiBWZJPtQA",
                "author": "Mital P.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "So... Most people will rate Kanada-Ya with 5 stars.\nI would too. I honestly think this was the best ramen I had since I was in Japan. Better than my favourite Bone Daddies.\nSo why am I giving it 3 stars?\nWell, when you go to Wagamama (yes yes it's a chain but it's a consistent and popular one) you get options for different meat in the ramen, and vegetarian options and such.\nWhen you go to Bone Daddie's you also get these options, and you also have gluten free noodles if you so desire or require.\nWhen you go to Kanada-Ya you spend ages queuing but all you can have is pork ramen. There isn't even a vegetarian option. Now this doesn't hugely bother me, but it does mean that I simply cannot go to this place when I am with a significant proportion of my friends who do not eat pork.\nThe friend who introduced me to this place told me that ramen is only supposed to come in pork varieties. But I guess she hasn't actually been to Japan, or she'd know this just isn't true.\nSo yeah, if you want a pork based Ramen, you cannot beat this place. It is awesome. But if you don't want pork, go somewhere else. I recommend Bone Daddies.",
                "datePublished": "2016-07-13"
            },
            {
                "reviewId": "ZIcuV2mB9XuU3whWYGBhfw",
                "author": "Gwen T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "One of my favourite ramen place in London! What can I say about the ramen... AMAZING! The broth.. AMAZINGLY GOOD! Can I also add that the broth was properly done?! Not one of those lousy broth where you get watered down nonsense soup made with stock cubes -roll eyes-. The broth made in kanada-ya is made from proper pork bones and meat! Took away one star for long waiting time and the slightly expensive price tag for a bowl of ramen (but still so worth it, but what can I say, I'm not that rich!) \nKanada-Ya, it's about time you renovate and expand your eatery? Yes please?! Kanada-Ya, you should, you really should.",
                "datePublished": "2015-12-31"
            },
            {
                "reviewId": "er2IxlpMKl9VJiyHQ4TlKg",
                "author": "Charlotte K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "There are a few things I am obsessed about, and Ramen is definitely one of them. \nI have been obsessed with Tonkotsu ramen since trying it at Bone Daddies 2 years ago, and fed off it in Japan last year. \nAnd truthfully, the battle for best Tonkotsu in London is VERY TIGHT between Bone Daddies and Kanada-ya - and based on my latest experience with both... I'm leaning more towards Kanada-ya. YES, yes. It was THAT good. \nThe problem with the West End is that the cool and funky places are booked up like crazy, so it's always a challenge having an impromptu meal before enjoying a good show.\nDon't let yourself be put off by the queue in front of Kanada-ya - and expect one, there will always be one. The venue is tiny, but the the turnaround is pretty quick and you won't have to wait too long (plus, as I said: worth it) \nAs I mentioned, the venue is tiny and built in typical Japanese fashion. It's not made for you to come and spend hours with friends chatting, it's made for you to come, sit your bum and eat delicious ramen. The menu is very short, meaning you get served amazing food in a record time. \nDon't be too shy, you'll probably be sitting on a communal table with other people enjoying their deliciousness. \nAnd now the food. For those I've lost, Tonkotsu is a creamy pork broth based ramen. And broth is what makes the ramen. And that brother was out of this world. I added the garlic sauce as an extra (which really worked) and extra egg - soft boiled eggs are a classic, you can't have a ramen without one. Trust me. \nPrice-wise, perfect value. You will be paying less than £15 per person for a meal and drink. \nSoo... What are you waiting for? (Also, please let me come with you?)",
                "datePublished": "2016-04-04"
            },
            {
                "reviewId": "DijTMmex5dJODJ7XpdIluw",
                "author": "Sophie B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Best ramen in London. Period. Pork with a side of pork with added pork and a topping of pork fat. But in a good way. Add perfect noodles, an egg and those lovely wood eat mushrooms and there's your great value satisfying dinner.\nThis is the original location, there's always a queue but I feel like it hasn't been quite as bad since they opened the new Leicester Square location. The new location is a better place for groups or if you want to linger with friends, but this location is perfect for the crowded noodle bar feeling, I love it",
                "datePublished": "2016-06-08"
            },
            {
                "reviewId": "D7A5KE1XVG_fLqkQTRBnmQ",
                "author": "Camie T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Better tasting than Bone Daddies but really expensive for what you get. And the seating wasn't as comfortable or as inviting as Bone Daddies. And there was no super awesome cocktail menu either.\nFirst impressions were great - 98% Japanese diners. Felt like I was in Tokyo again.\nOne neat aspect of this 24-seater restaurant is the way they handle their queue of customers. There are two benches outside of the restaurant, positioned end-to-end to create one long bench. If you see people sitting on the bench, then there is a queue, so follow these guidelines to join and \"work\" the queue: People seated on the bench closest to the door are at the front of the queue and people seated furthest away from the door are at the end of queue. As people from the front of the queue are seated in the restaurant, everyone on the bench slides down toward the door. Don't bother asking the hostess for available tables, just get in the queue.\nSecondary impressions were good - diners seemed to be enjoying themselves slurping their bowls and such.\nTertiary impressions were just OK - I found £11.50 for a bowl of Moyashi Ramen a bit too expensive. On a good day, the bowl was worth £8. Why? The lack of pork. There were three small and thin slices, possibly an ounce in total weight. A shame, really.\nThe broth was good and the noodles were cooked perfectly (forgo ordering Kaedama (an extra portion of noodles) as you likely won't need any. I found there to be too many noodles in my bowl for my liking. \nThere were a few condiments on the table, none of which included fresh garlic which was a huge disappointment. I've never eaten ramen without fresh garlic and loads of it.\nService was prompt and attentive, our server even kindly provided me with a fork so I didn't have to whip out my BYOF as I did whilst eating my way through Japan.\nOverall, just OK ramen that overpriced.",
                "datePublished": "2015-08-16"
            },
            {
                "reviewId": "Fr5D1xKXtfaqKJk0MbXIsw",
                "author": "Taylor X.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Best ramen in London. \nGarlic topping + extra bamboo make your ramen even more tasty.\n30 mins queuing time expected.",
                "datePublished": "2015-09-02"
            },
            {
                "reviewId": "sHBraM5AMIfep7T25nQacg",
                "author": "Sam T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is probably one of the best places for ramen in London. Worth every penny. Also, be aware that there usually is a line, reservations are not an option.",
                "datePublished": "2017-11-06"
            },
            {
                "reviewId": "Gk3mKj4YlD53Vj2AuS7kdA",
                "author": "Reuben W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Was here during a rainy sunday, hence we only had to wait for 10 minutes for a dinner table for two. It was cosy and warm inside. Smell was incredible. Ordered their tonkotsu ramen and sour plum sushi. Note that the eggs come separately from the ramen. This was the first time i see my ramen served in very thick broth. It tasted really good and my meal was completed with the freshness of sour plum sushi. Definitely one of the best ramen spots in london.",
                "datePublished": "2016-08-28"
            },
            {
                "reviewId": "TIxpSLftvZB1sM1yZm6sIQ",
                "author": "Marissa A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is my absolute go to place for a ramen in London. I almost think this place does not need another 5 star review. I feel that a lot of people already know how good the ramen in this place is. The ramen is excellent. I eat this ramen slow as to enjoy it longer. When I do this, when my bowl is empty, I'm a very happy customer.",
                "datePublished": "2017-04-26"
            },
            {
                "reviewId": "gO13X_yDd9RjOy2pQfsZSw",
                "author": "Nicholas T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Best ramen I had so far (comparing to the London region). I would be rated it among the top ramen places in  Egg was cook to perfection, the chashu was excellent. Right amount of fat and meat. Broth was tasty and rich (with the roasted garlic). The noodles are cooked to your liking. I would give it a 5 star, but there is always room for improvement. Also, I haven't had all the ramen places around the area yet.\nTried the original ramen.",
                "datePublished": "2015-05-28"
            },
            {
                "reviewId": "fUAQIwIs1haDWyYJlt2WJA",
                "author": "Paul A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Yes you have to queue and the space is small but quite simply this is the best bowl of ramen noodles in London. \nThe menu is small (which I consider a sign of a good restaurant).\nThey have some benches out the front too which is a nice touch when you get towards the front of the line.",
                "datePublished": "2015-06-10"
            }
        ]
    },
    "60": {
        "id": "D5MqfwQo7qOS4VOYrlhGFA",
        "name": "Kanada-Ya",
        "category": "japanese",
        "servesCuisine": "Ramen",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Bloomsbury",
            "streetAddress": "64 St Giles High Street\nLondon WC2H 8LE\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/BgA-fOCfoFBEqfzTsSrk4g/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7240 0232",
        "review": [
            {
                "reviewId": "WuWwVQ-0ssOB76pyg-3mhg",
                "author": "Beverly Y.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I came by on a weeknight at around 5:30 pm, and our group grabbed the last open table. When we got the menu I was surprised at how small it was, even though they had all the \"essentials.\" I ended up going for the original, and I absolutely LOVED it. This was by far the best ramen I've ever had - the fact that it's the only ramen bowl I've ever completely finished is a testament to that. The noodles were the perfect thickness (thin, which is my personal preference), the toppings/pork were great, and the soup was absolutely phenomenal in its richness and flavor. I will definitely be back.\nThe only downside is that the place is extremely small - I can see why people before me said there was a queue - and so it feels a bit cramped...but honestly the ramen makes it all totally worth it.",
                "datePublished": "2015-07-14"
            },
            {
                "reviewId": "UiUZKZ9AX4O-aSa60JQgHA",
                "author": "Jon S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Definitely worth the queue - best broth I've ever had. \nCool space - mostly communal tables but they're quite wide so it's not awkward at all with other parties being seated next to you. Quick and professional service and a fantastic bowl of ramen - served with thin noodles. Great value will definitely be back.",
                "datePublished": "2016-01-22"
            },
            {
                "reviewId": "1oFZ1JzXsyU0ukJ7dryiow",
                "author": "Yotsuba C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The egg wins my heart so rich and flavourful. The pork broth was lovely milky, thick and hearty. Charsu pork is a bit too tender for me though. As the broth is extremely hot, you need to quickly finish the noodles before they become too soft. Everything is great but one thing there's a queue all day everyday here.",
                "datePublished": "2016-01-11"
            },
            {
                "reviewId": "R60ZqJ6xy4ZgYmzwcy6Ivg",
                "author": "Al A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "What a line up!\nVery good ramen that's served quickly and piping hot. Perfect. \nDeliciously broth that's extremely rich. \nNo sake here. Only Japanese beers.",
                "datePublished": "2016-03-20"
            },
            {
                "reviewId": "kYHRml8VpAMEgASq8J7X6A",
                "author": "Jessica H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place has the bast ramen I've ever tried! I got the ramen with the spicy pork on top (sorry I can't remember the name) for just the right amount of spice once I mixed it all in. The sliced pork on top was the absolute best pork I've had ok ramen. It was so sweet and tasty, like it had been marinated for a long time. I'm weird about meat on ramen, so this is a huge win for me. Actually, I liked ALL the toppings. I ordered the noodles hard, which kept them nice and firm, as it takes me awhile to eat ramen. I also got the chicken karaage, which was AMAZING!! There was a bit of a line when I arrived, but I was seated within about 10 min and had my food 1 min after I ordered. This place is so much better than Bone Daddies, which was definitely a 2-3 star for taste, atmosphere, and service.",
                "datePublished": "2017-04-06"
            },
            {
                "reviewId": "RzkkepFZQRKyRl-QcBs1YA",
                "author": "Brett K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Yes, I gave into the hype and stood in line for Kanda-Ya. In attempt to be strategic, I went for a late lunch around 14:00. Even staving off my interest and hunger, I did wait around 15 -20 minutes. I will give the staff credit; they treated seating like a competitive game of Tetris. Eating solo? Don't expect to sit at your own table. In fact, you are likely to end up at a four top with a group of three. Who doesn't love communal dining? \nWho cares, let's get on to the food!\n* Sake Onigiri - I know, I know, I was there for the Ramen. It was late, I was hungry! It was a moment of weakness. I would describe it as light on salmon. Luckily, I really (really, really) like rice.  My recommendation, wait for the Ramen. \n* Original Ramen - I thought the fairest way to judge the restaurant was to order \nthe OG:\nLet's break it down:\no Noodle -The portions were plentiful and the noodles seemed freshly made.  The most genius part is you select the level of al dente that you would like your noodles cooked to.  If you don't like your noodles, that's on you. \no Broth - Rich and velvety. I like the noodles better, but perhaps you are catching  on to my love affair with empty carbs.\no Pork - Dee-lish! The pork was thinly cut. I find that often thinly cut pork dries out. Not here. The meat was nicely marbled with fat and super moist.\no Overall - Super delicious\n* Moyashi Ramen + Egg - My companion was fancier and went for the Moyashi Ramen plus an egg.  From what I can tell, the difference between the Moyashi Ramen and the Original Ramen is blanched beansprouts. To me no person would spend an additional £1 for beansprouts; I stood corrected.  \no The egg - My companion was adamant that the egg is the most important part. This egg was apparently very good. I quote \"perhaps even better than Bone Daddy's\". She did not offer to share, which could be interpreted as rude.\n* Spicy Miso - oh wait... they ran out! I am convinced that a spicy sauce would have taken the broth over the top. \n* Black garlic sauce - it was good, but you know it was no spicy Miso!",
                "datePublished": "2014-11-23"
            },
            {
                "reviewId": "TYKniAbfatU_wbWHlgqi7w",
                "author": "Jennie F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Kanada-Ya is hands down one of the best ramen places ever. The first time I walked by, a breeze carried the scent of freshly made noodles (yes that floury, doughy smell like freshly baked bread, except for noodles) right to me, and I knew that I had to go for a bowl of ramen.\nI always get the original ramen for around £11. The broth was one of the richest broths I've ever tasted! It tasted like they melted down those pork bones and made it into soup. You can choose the firmness of the noodles, I usually go for the recommended option. The chashu on top is very tender and I like all the other veggies they put on top too. They have this green spicy pickled veggie thing on the side for free and I like to add a spoonful to my ramen for a spicy kick. Sometimes, I split an extra order of noodles with a friend when I finish my noodles but there's still broth left. \nThe chicken karaage is also quite good. It was £6 and they give you around 6 big pieces. It's pretty standard so while it was really good, it's nothing extraordinary compared to other places. \nMy only complaint is that there's always ALWAYS a line when I pass by (up to 2 hours one time) and there's only around a dozen seats in the restaurant. But that how you know it's good right?",
                "datePublished": "2016-02-16"
            },
            {
                "reviewId": "yqrgLmYTeDXj9TrC4BjfEQ",
                "author": "Jill N.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Visited here after a few drinks in the pub a few doors down with friends who had been before. The restaurant is small, and there was a queue but the wait was not long and we had chance to look at the menu while waiting so it was not an issue at all. \nI had the original ramen (without fungus, I am a mushroom-phobe and they were happy to oblige) with the recommended \"hard\" noodles. The broth was delicious, noodles tasty and I would certainly eat here again if in the area. It's a reasonably cheap, no frills place.",
                "datePublished": "2016-07-25"
            },
            {
                "reviewId": "za7pDa9O5_QN5MSSCbvU7w",
                "author": "John S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good grief, or yoi kanashimi, since we're talking ramen. Some Yelpers comments are out of line IMO. That said, I'm giving them a 4 for London (If we were in Japan I'd give them a 3). London is an expensive place to run a shop (and yes!, more expensive than in Tokyo IMO) so £10 for a bowl of ramen is sadly reasonable around here.   \nUnderstand: Kanada-Ya makes Hakata ramen. This is a style that is pork based, has a milky white colour, and is full of delicious, yummy, lip-sticking collagen and fat. And remember, fat does not make you fat, carbs and sugar do. So if you're worried about your waistline why are you even thinking about going out for noodles?\n \nKnow: Kanada-Ya are specialists at what they do. So no, they don't have a gluten-free vegan ramen and they don't have a bar making green tea lychee 'tinis. If you want that go to Bone Daddies or some silly place like that. \nI should add that I'm really appreciative of a specialist and focused ramen place opening up in London that has the discipline and confidence in their cooking to just do one thing really well, instead of trying to offer 20-different mediocre dishes (ahem, Shoryu somewhat, or that London ramen atrocity known as Bento Ramen). Kudos to Kanada-Ya for focus. I hope this becomes more common here.\n/// So the Ramen...\nThe Overall Bowl and Broth: It's good. It's not my personal favourite style, but it's a decent bowl. Overall I think it lacks punch, but again, they have their style and they are working hard at it. I'm going to experiment with some topping combinations next time and see what I can do to fix this.\n \nNoodles: Mine were perfectly cooked to medium. Just like I asked.\nEgg: Again, perfectly done. Not as good as Shoryu, but the eggs there are sublime- as good or better than many I've had in Japan.\nCharshu: Was adequate. I prefer it saltier, but the texture and fat were very good.\nOverall: This place is a welcome addition to London and will force a lot of people to step up their Ramen game. They will also keep Ippudo - who is about to open across the street - on their toes. While the service was a bit spotty, I'm willing to overlook this for now and chalk it up to them being new.",
                "datePublished": "2014-09-23"
            },
            {
                "reviewId": "Vas4y3lTEKJgpkHEGhZMZg",
                "author": "Jasmine L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Kanada-Ya is definitely a ramen place worth the wait! There is always a line for it, since the venue is quite small, but the Chashu Men Ramen is amazing. I ordered it with a Hanjuku Egg that was very well prepared as well. The ramen broth is a perfect level of saltiness and savoriness. I usually feel like ramen broth leaves me very thirsty, but this broth was not overdone at all. Additionally, the Hanjuku Egg was very well made in the sense that the yolk was not too dry or too runny. I would definitely suggest this place to any ramen lover!\nADVICE: There will be a line! Bring a coat because the line is outdoors. There will be a coat rack inside where you can hang up your coat when you're eating. Additionally, be prepared to share a table with someone. The venue is very small so you will end up sharing a table with a stranger.",
                "datePublished": "2015-03-13"
            },
            {
                "reviewId": "UasdTMNOT9UO2VV8VdJ3Dw",
                "author": "Or B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good broth, exquisite chashu pork, decent toppings but the egg isn't a \"wow\" like Ippudo's (also the nori leaf has seen better days). Correct noodle hardness. The atmosphere is a bit hole-in-the-wall but it's okay for eat and go situations.",
                "datePublished": "2017-02-11"
            },
            {
                "reviewId": "etDeFqerP9jQu0wQd_iNGQ",
                "author": "Daniel N.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Unpretentious ramen, right across the street from the big 'I'. \nWent for lunch on a weekday and had to queue outside for about 10 minutes before I was able to sit down. There menu is extremely simple. Three choices: original, with bean sprouts, and with pork collar instead of pork belly. Really, they could have done with one menu selection and just had the bean sprouts and pork collar as add-ons. After you choose your ramen you can choose the firmness of the noodles. I ordered mine firm and added an onsen egg. I also ordered a plain onigiri.\nFirst, forget the onigiri. The rice is good, but the onigiri itself is forgettable. If you're still hungry after your ramen, just get kaedama and order more noodles.\nThe noodles and broth were both excellent. Noodles had a nice, firm bite and the broth was creamy and frothy, without being overly gelatinous. I really appreciated the 5 thick slices of chasiu. Some other London ramen eateries seem to give one or two paper thin slices of chasiu. \nThis is the type of ramen restaurant that you go to, eat your food, and get out. Very different experience from other London ramen eateries, but also a very nice change.",
                "datePublished": "2014-12-04"
            },
            {
                "reviewId": "E6xM_cxDnK5u5y_G59FAiQ",
                "author": "Jeff C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I ate at Ippudo and saw the que across the street.  After eating at Ippudo decided to check this place out.  \nWent in there with a full stomach and yet I finished my bowl of ramen.  The boil egg was perfect, not too runny or hard.  The broth was Awesome.  \nI loved the small cozy vibe.  And the food.  This is going to be my go to place whenever I am in town.",
                "datePublished": "2016-01-25"
            },
            {
                "reviewId": "-LjHJJiXtHVT6nfS9XEq8Q",
                "author": "Ally W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Always wondered about this place as there is forever a line outside of the door, waiting. Deterred by the line, I never even attempted to find out what type of restaurant that was. That was until one day my Japanese friend invited me to check out a great ramen place. When I research the restaurant online, I realized that we were going to that line outside the door restaurant. By then, I was really looking forward to checking it out, because Ippudo, another great ramen place, is right next door and this ramen shop can still maintain such strong following, they must be doing something right! \nI got to the restaurant around 1pm and, of course, there was a line outside. Luckily the line moved relatively fast, and within 15 minutes, we got our seat. This is a great place if you have just one or two people going, any size larger than that, you probably should forget about it. The inside of the restaurant is very tiny, and even with very efficient use of space, the whole restaurant can seat about 20 people. No wonder there is always a line outside. \nThe menu is extremely simple: ramen plus choices of toppings and rice balls. I kind of like it. I always have trouble ordering my food when I have too many choices. Here it is simple, order your ramen and how do you like it cooked and add any extra toppings. Go crazy and order a rice ball if you are hungry. I ordered original ramen with Hanjuku eggs. The food came very quickly and, man, that was a good bowl of ramen. The broth was rich and flavorful but not greasy and the ramen was cooked al dente. I swallowed the whole bowl in record time. I felt that I spent more time waiting for my seat than actually eating! However, it is definitely worth the wait.",
                "datePublished": "2015-03-08"
            },
            {
                "reviewId": "iC-6fq1orp4jP9RiXHZ5bQ",
                "author": "Ellina Y.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "As a huge ramen enthusiast and broth snob, it is with great honour that I bestow best ramen ever to Kanada-Ya not in Japan. The broth is very well balanced, not too salty, black sesame spice has a great kick. Their service is also very fast, a great quick lunch during the work week. I dream of you..",
                "datePublished": "2017-01-04"
            },
            {
                "reviewId": "BB2ARrQjhgBAXBkJQ5zizQ",
                "author": "Onson G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Yup. you can taste the 18 hours pork bone broth. I had the Chashu-Men I think it is better than the Original.",
                "datePublished": "2016-12-15"
            },
            {
                "reviewId": "w2RWymePafQgunvTCFx8Bw",
                "author": "Yi Z.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good ramen, though slightly fatty for me. Intimate environment and good service! Suitable for group of two. Next time I'll try different hardness for the ramen!",
                "datePublished": "2016-03-24"
            },
            {
                "reviewId": "0Pinq7ZMmMJysllyekhLFg",
                "author": "C L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "(7.26.15) I've never been to Japan. But I've had ramen in SoCal, NorCal, NYC, and the midwest. Enter London. Kanada-Ya has THE BEST ramen I've ever had. It's telling when Ippudo across the street is EMPTY (this wouldn't happen in NYC!) and there's a line out the door here. It was such a treat on the gloomy evenings in Bloomsbury. Can't wait to go back!",
                "datePublished": "2016-02-05"
            },
            {
                "reviewId": "W2RKLbcHp_sqE6ToC6bsPQ",
                "author": "Chloe L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Is a in between 3.5 and 4 start.\nI have been there three times now.  They are less busy now compare to newly opening time. The menu is quite simple because they only have a few option which make it simple.  I had tongkatsu once and cha Siew twice. \nWhen you order you get to order the noodle texture and i like mine regular. The best part of the noodle for me is their egg. Some noodle does not come with egg but you can add the egg with extra £1. Once you finish the noodle you can order extra noodle to add into your remaining soup to eat. I tried it twice now but I felt that it is not as nice. Once the soup get cold you will find that the soup is quite salty and oily.",
                "datePublished": "2016-08-11"
            },
            {
                "reviewId": "v7tG8JpWDM6CJt0_n74phA",
                "author": "Tom Y.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "As a ramen junkie, I've been searching for good bowls of ramen everywhere I go. I had heard amazing things about Kanada-Ya, and many claim that it's the best ramen in London, so naturally, I had to go! Also because I'm a huge fan of tonkotsu broths.\nWhen I got there (around 1 PM on a Monday), there was a short queue, but nowhere near the legends that I'd heard of. After a friendly conversation with my fellow line waiters, I was seated in the restaurant.\nTo start out, I orderd an ume nigiri. For my main, I ordered the chashu-men with the mayu (black garlic oil) and hanjuku egg. They let you choose the firmness of the noodles; I chose hard because I like my ramen a tad undercooked (al dente?). They use the traditional thin straight noodles, which pairs well with tonkotsu.\nThe ume nigiri was exactly what I expected, the sourness of the pickled plum perked up my palate and made me excited for the meal to come.\nThey had some pickled kimchi-esque cabbage and ginger for you to just add to your dishes, as well as a toasted sesame seed grinder (which I of course used, generously).\nThe ramen came out pretty quickly and looked great. The broth was very good; one of the best tonkotsu broths I've had anywhere, not just London. The mayu was exactly what the broth needed to elevate it to the next level. The egg was a beautiful golden orange, and the slight sweetness of the marinated egg white was great in the savory and rich pork broth. The chashu was tender and melted away, though I would have preferred a slightly thicker cut, with more of a sear.\nOverall, Kanada-Ya has one of the strongest tonkotsu broths outside of Hakata for sure, and I would highly recommend it to anyone who loves ramen who is in London. I hope they bring it to NYC soon!",
                "datePublished": "2015-06-30"
            }
        ]
    },
    "80": {
        "id": "D5MqfwQo7qOS4VOYrlhGFA",
        "name": "Kanada-Ya",
        "category": "japanese",
        "servesCuisine": "Ramen",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Bloomsbury",
            "streetAddress": "64 St Giles High Street\nLondon WC2H 8LE\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/BgA-fOCfoFBEqfzTsSrk4g/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7240 0232",
        "review": [
            {
                "reviewId": "j4U7Kkh0Fz8wg773QrwSAw",
                "author": "Muji L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Before I even write anything, I am not going back there again. I have read some good reviews on Ipoudo and I'm hoping that their ramen is just as nice, because the service at kanada ya is absolutely ridiculous.\nIt was a Wednesday night at around 8:30pm. We queued for over 30 minutes which was fine. However, just as we thought the next table available would be ours, suddenly came two people that was at the Back of the queue and just sat down. We asked what was going on and as I was expecting the Guy to tell those two to get back in the queue, he simply said \"sorry there will be a table soon anyway.\" \nfuming, I ordered my ramen just to find out that they literally have nothing left. No egg, no salmon o nigiri. could the two people that pushed in have taken my last egg?probably.",
                "datePublished": "2014-10-17"
            },
            {
                "reviewId": "lGs83vODoXGSwSj1bvjUQA",
                "author": "Chris K.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I love noodles and have been eating them at least twice a week, more so in Japan (at least 4-5 a week).  So I have been looking forward to Kanada-Ya's opening.  Sadly I was totally disappointed with their Ramen.  \nWe ordered one Moyashi and one Chashu Ramens.  Their Tonkotsu soup was simmered for 18 hours according to their menu and tasted justifiably so; however it simply lacked depth.  It just tasted congealing pork fat/bones with soya sauce and nothing else much.  Adding lots of black pepper did not help.  Good Tonkotsu soup should have different layers of flavours.  The thin noddle was cloggy/starchy; it should have been boiled in a much larger pot and shaken vigorously to remove as much starchy water as possible.  I didn't see the point of Kikurage (Woodear Fungus) as it only gave texture but was bland.  The only good bit was Chashu in Chashu Men; they (Collar) were leaner than those (Belly) used in other two types of Ramen and tasted as good as you get in Japan.\nThe menu was limited to three types of Tonkotsu Ramen and Rice Balls (Onigiri) and they were way too expensive.  Why the prices of Ramen are so high in London?  You can get very decent ones for around £4-5 in Japan and the quality you find in London does not justify the price tag.  Even in Paris, you can get nicer Ramen for around 7-8 Euros.\nVery disappointing.",
                "datePublished": "2014-08-31"
            },
            {
                "reviewId": "O0pF2gRU4mUNHPCqDMIsIQ",
                "author": "Ally H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I'm probably going to write exactly what everyone has already said but here goes...\nAmazing ramen! The broth is creamy, flavoursome and rich. The pork was tender and delicious. And the hanjuku egg - wow. Perfection! I ordered an extra egg because it was too good to just have one.\nI also ordered the salmon onigiri but would give them a miss next time and go straight for the ramen. They're not bad but it's about the ramen here. \nThis little ramen bar gets filled up very quickly and the line forms before it opens so prepare for a wait.",
                "datePublished": "2015-06-10"
            },
            {
                "reviewId": "2wgXz7LTl2y8LxJQ89U1NA",
                "author": "Belle L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Best ramen I've had in London!!! Seriously. Ramen lovers you must try out this place if you haven't. IT'S GOOD. Enough said just go for it.",
                "datePublished": "2015-10-12"
            },
            {
                "reviewId": "ivFHyvb71qgIwZACX7_eUQ",
                "author": "Jing Shyang Y.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Wowzas. Was this place worth the wait.\nEven on a bank holiday monday there was a wait. As one of the first to arrive at around 12.20 there was still a 40 min wait, but it was damn worth it. Even though staring through the window at all the delicious ramen was tough!\nThe place is tiny. I think I counted around 20-25 seats. Two staff and two cooks.\nWhich was nice as the place had a warm cosy feel to it that would be very nice during the winter months.\nI was going to order the standard ramen (there is not a lot of choice here) but my friend pointed out that they do a special which was detailed on the table. So I ordered the Gekikira Ramen, an \"18 hour pork bone broth, spicy tan tan style minced pork, charshu belly pork, beansprouts, kikurage, negi\" I have no idea what the last two were but it was damn delicious.\nService was quick. And the portions were Good. My previous favourite ramen place Shoryu was always excellent and had you full to bursting. However recently they've cut down on the portion sizes and a super stingy with the toppings.\nNot so here, despite being a little cheaper than Shoryu (minus miso egg which isn't included by default, but a topping) they are quite generous with the meat. I got as much charshu pork belly as I normally get in my Shoryu bowl (note that's pork collar however, a bit more expensive) but I also get here a massive portion of spicy minced pork. Additionally from the orders of the pork collar I saw drifting around whilst Shoryu normally gives you 2-3 really thin slices, here they decorate your whole bowl in the stuff, so you get around 5-6 decently sliced pieces. \nThe broth I haven't mentioned yet is excellent too. It tastes a lot cleaner and clearer than shoryu. Admittedly Shoryu is slightly more flavourful but oh well you can't have everything. Everything else, in terms of ingredients, quality and quantity are spot on.\nWhilst there we also tried the sour plum onigiri. I didn't really like this much but more personal preference than anything. It was presented very nicely and was a decently sized portion. \nThe only real improvement I can say is that they REALLY need another location as just thinking of the inevitable queue is making me sad.",
                "datePublished": "2015-05-18"
            },
            {
                "reviewId": "yMN3IANGTZiOOY1SGdujtg",
                "author": "Yinnie C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The broth is TO DIE FOR. Like I want to die by drowning in this rich milky broth please. As grim as that sounds- that's the most amazing way to go.\nHazel, Iz and I actually popped in here after drinks because we thought drinks and desserts first because ramen is always almost packed and we'd try out luck at ippudo. It didn't work. 9.30 and still an hour and half wait. So we popped over to kanada ya instead for a ten minute wait.\nLoved that they offer different textures of noodles! I go for hard and springy (LOL- im talking about bed shopping, take your mind out the gutter) and garlic. And it's so simple and kanada just do it so well. The service was great, especially for hazel's dietary requirements. They were so accommodating! \nTake me back here to bathe in broth,\nPlease!",
                "datePublished": "2015-03-02"
            },
            {
                "reviewId": "USfhiks4HarP5IdBTTfHtw",
                "author": "Yushi R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Easily my favourite ramen place in London . It's tha place I go to when I want a taste of home.\nThe ramen is great and the broth is marvellous.\nMy favourite ramen here is the gekikara-men, since I'm a lover of spice. Best part is they don't hold back and adjust the flavour because of its location in the UK.",
                "datePublished": "2016-01-16"
            },
            {
                "reviewId": "awyGlY2gsBSI7bXc4d8v0Q",
                "author": "Lisa C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A friend suggested Kanada-Ya for dinner after work on one of the hottest days of the year (23 degrees in London!)... not exactly ramen weather but perfect for waiting in a queue! I have always wanted to try it ever since it opened in the fall last year, when I got the invite to the 50% off soft opening but couldn't make it. I have however dined at its rival Ippudo across the street, which is a much more upscale, modern building with a bar area to wait and a cell phone texting service to let you know when your table is ready. By contrast, Kanada-Ya is a lot more like an authentic hole-in-the-wall.  We arrived around 7 PM and took our place in the queue, as the restaurant does not take reservations and it only seats about 25 people inside. There is a nice wooden bench to sit on, and the staff bring out menus for you to look at. The queue also moves fairly fast; there were 5-6 people in front of us to start, and we had our seats inside within 20 minutes.\nWe dined at two seats facing the far wall, near kitchen and the toilets, which wasn't particular scenic, but I don't think that is what they are going for. The menu is pretty straightforward - there are 3 main ramen options then a load of topping options. I went for the moyashi ramen, which is like the original ramen but with beansprouts, and then chose to add a hanjuku egg. For a drink I got the Hiver, a London honey beer. This come serves in a cool copper mug, and it tastes exactly like honey. I was sorely tempted by the onigiri rice balls, and meant to order one, but I forgot and it turned out to be a blessing since I couldn't even finish the ramen. My friend got the original ramen without any toppings, and she actually managed to finish her bowl. \nAs for the food, I thought the bowl was good, but nothing spectacular. The egg was good, runny in the middle and interestingly enough, served cold. I ate them first because I didn't want them to sink into the ramen and lose the deliciousness of the yolk. You have the option of choosing the firmness of your noodles; I went with regular, but they just didn't seem like ramen to me - they were very thin and of dry, lacking the usual plumpness. The meat was tasty... we tried for a while to figure out the difference between pork collar and pork belly, but in the end concluded that you can't go wrong with pork belly. Aside from a ton of vegetables, the only other thing to note was the broth - it was good and not too salty. We added some of the mysterious looking pickles on the table halfway through the meal, which turned it actually quite spicy. Overall, it was not a bad meal, but there was nothing screaming at me to declare that this is the best bowl of ramen in London.",
                "datePublished": "2015-04-17"
            },
            {
                "reviewId": "XJZA_HeAJyrebf4Ed03p7Q",
                "author": "Karen K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Amazing ramen. \nThe place is small but managed to squeeze myself in on the bar tables. \nI ordered the original ramen and it was beyond yummy!  The broth was perfection and you get to pick your choice of tenderness to the noodles. Soft was great.  The portion was large. You will be satisfied by the time you finish. \nService was nice. The ladies and gentlemen were attentive and super nice. \nWill definitely come back before I leave London in a few more days.",
                "datePublished": "2016-07-10"
            },
            {
                "reviewId": "MD5cKzVR7DhFBQFswFbnbQ",
                "author": "Minnie M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I arrived at 6:00 on a Monday evening and was surprised to see a line outside Kanada-Ya. \"Go across the street to Ippudo\" I mentally telepathed. No one budged.\nFortunately the wait wasn't long as I was one person. I was invited inside by the waitress, who locked the door behind me, I suppose to keep eager outsiders from barging in and bringing the draft with them.\nI ordered the Chasiu Men and added an Hanjuku Egg (soft boiled and chasiu cured, um yesss) and garlic sauce, which brought the £14.50 meal to an intense level. There options of noodle springiness, which I appreciate.\nOverall I liked it a lot, more so than Ippudo and Bone Daddies. So far it's holding up the #1 ramen spot in London on my list.",
                "datePublished": "2015-01-29"
            },
            {
                "reviewId": "3AQZ6Bf6e3X-JpuMnvfcPA",
                "author": "Will S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Reasonable flavor, but not amazing for the price. Had the spicy pork ramen and an onigiri.",
                "datePublished": "2016-06-23"
            },
            {
                "reviewId": "nQIPzCdU2RYgGPX5mUK9_g",
                "author": "Yee Gan O.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Now, I'm no economics expert but I've heard that one of the keys to success for any business is location, location, location. To that end, I was very surprised to see that new ramen restaurant Kanada-Ya have sited themselves right opposite the newly opened 2 storey behemoth international ramen restaurant chain Ippudo\nTo be fair, Kanada-Ya is also an international chain with Japanese founder Kanada Kazuhiro bringing his authentic tonkotsu ramen from Yukuhashi, Japan to the world. However, the dimunitive premises of Kanada-Ya does make it feel like a David v Goliath situation between the neighbouring restaurants\nHaving said that, there was a healthy queue outside Kanada-Ya 15 minutes before opening time on the Saturday lunchtime when I visited. In fact, when the restaurant opened, people at the back of the queue had to wait as all the seats were quickly filled up\nThe menu is short and sweet - 3 versions of tonkotsu ramen, the main difference between the bowls being the cut of pork to make the chashu and a few extra ingredients like beansprouts\nI went for the original ramen, which came with the 18 hour pork broth, chashu pork belly, wood ear fungus, nori and spring onion. None the options came with an egg, so I added a hanjuku egg for £1.80\nKanada-Ya's USP is that they wash the pork bones before using to make the broth. It perhaps made the broth taste a tiny bit more sanitised but being someone who feels that the broth is the most important element of ramen, I did enjoy it but perhaps not as much as Bone Daddies where I usually drink most of it whereas here, I left a lot of it behind\nMy noodles came 'normal' as requested, which were fine for me. The chashu pork belly was suitably moist if rather thin. The wood ear fungus added texture and I was glad there were no beansprouts (I'm looking at you, Shoryu!)\nThe bowl here is certainly worthy of entering my top 4 ramen restaurant rotation alongside Bone Daddies, Ippudo and Cocoro but my favourite still remains Bone Daddies, who also have the amazing Korean guinea fowl and sticky bones\nKanada-Ya only serve onigiri rice balls alongside their ramen but I didn't try any on this occasion",
                "datePublished": "2014-10-26"
            },
            {
                "reviewId": "JWvlzl1XiYbDaUh3ZR_Rsg",
                "author": "N00b D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "What a treat. This place is fantastic. Both the food and the service were top notch.\nThe food: We had the chashu-men ramen and the tonkatsu ramen and both were some of the best I've had. I don't pretend to be a ramen connoisseur but I've been to a half dozen ramen places in the United States and tasted bad ramen and good. The ramen here is as good as the best I've had yet.\nPrice: It's a little steep for what it is. The chashu ramen is 13 pounds and the tonkatsu is 10.5, and if you want an egg in it that's 2 pounds extra; though that egg is tasty and adds a hearty flavor to the dish so you might as well go for it. There is a 10% service charge added to the bill automatically.\nThe location: It's a corner shop so it's easy enough to find once you get close, though it's not exactly close to a metro station. The place is very small though and seating is limited. We had to wait outside for a few minutes but the person at the door will happily hand you a menu to look at while you wait.\nThe service: I save this category for last because it so blew me out of the water. I've been to many European countries over the years and eaten a lot of different places and I have never had a server offer to refill my non-tea/coffee drink for free. I assumed that refilled drinks were simply a custom in the United States alone. Heck, you are lucky if a waiter even drops by your table after the food is delivered to check that everything is alright. Today I was proven wrong as helpful staff (more than just one) came by our table not once, not twice, but three times in our roughly 30 minute meal to not only check that everything was to our pleasure but also refill our water: the free tap water we were drinking. \nI legitimately felt bad that I didn't have enough hard cash on me (we were paying by card) to pay for an exceedingly generous tip but I left them all I had (a little under a pound). If you are there and have as good an experience as I did leave a few extra pence for me.",
                "datePublished": "2016-09-15"
            },
            {
                "reviewId": "p7l4Z8BPiUI42ryuT4wKgQ",
                "author": "Jia Y.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Perhaps the best ramen I've ever had. I never eat pork, but here I eat all the pork in the bowl, and drink up the soup- amazingly rich.",
                "datePublished": "2016-05-25"
            },
            {
                "reviewId": "iXbm8dqo0ierO3L0VV5r_w",
                "author": "Ekalyne O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Amazing Ramen! I went for the original with two eggs. Definately recommend coming here!",
                "datePublished": "2015-07-26"
            },
            {
                "reviewId": "AEogilZcKhfKWN7bWnM_xA",
                "author": "James N.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This new ramen place is popular and rightly so.  The menu is smaller than most places, but this just means that they have concentrated on the best ramen and they are good at it.  These guys are the experts.\nWe both had the Chasiu men, which comes with slices of pork all around the top of the bowl and wood ear fungus.  This has an interesting texture.  I like how you can have the noodles cooked to your liking - I had mine cooked medium and my wife chose the hard noodles (cooked for less time, which gives a firmer bite).  This is the only place I have noticed this, on my ramen travels.\nI observed the guys at the table near us both going for extra noodles. We thought they must be hungry!  But, it was definitely the right call as we both had a lot of tasty broth left at the end.  It is like having a 2nd ramen which, of course, I am in favour of.\nThe restaurant is a short walk away from Tottenham Court Road tube station, but Holborn is another nearby option.  We got there late on Saturday night and there was a line outside.  It was a chilly night, but there were some heaters on full whack, so we were comfortable.  Almost too warm even.  I liked how a member of staff would let us know how long the likely wait was and whether we would make it in before closing time (10pm on Saturday).\nI expect that we will be back again, particularly as we are often in the Soho/Covent Garden area and it is a winter season treat.  Highly recommended.",
                "datePublished": "2014-11-29"
            },
            {
                "reviewId": "_Odtt5i1jKK-ZZedy94LGg",
                "author": "William E.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Thank you Yelpers! This is the best ramen I have had ever!! Never been to Tokyo but this took me to Japan.  18 hour pork broth with your choice of spicy or savory.  Let me just say if you are in London go here! It is absolutely worth it! A line or a what the British call a queue is enviable because this place is awesome. Have fun and keep an open mind you will not be disappointed.",
                "datePublished": "2016-06-20"
            },
            {
                "reviewId": "WAo1gRm8tFzrhBNkUEzXsA",
                "author": "Min N.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love this place! It offer the best ramen I have ever had. The soup was so delicious and the hardness of noodles was just right. Even though it is a very small shop, it is enough to enjoy a great ramen feast!",
                "datePublished": "2016-03-06"
            },
            {
                "reviewId": "TCaFJGPhugJPD_B0Hvj8Bg",
                "author": "Ayako Y.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Just had an original ramen - it is a much anticipated japanese tonkotsu ramen from japan. It is better than shorty or bone daddy... But not as good as I anticipated - soup is slightly off... It is rich and creamy but missing an exciting note leaving aftertaste quite rich... Pros are noodles and cha-shu. Especially cha-shu is the best in London... But of course, you would not be there for cha shu only.., without good soup, a bowl of ramen would never taste right... By the way, it's kikurage - tree grown mushroom, is supposedly specially cured from japan... It tasted not too special - too coarsely chopped and too big in my opinion...",
                "datePublished": "2014-09-01"
            },
            {
                "reviewId": "8QOHYNQ1nt53t-75T7T7zw",
                "author": "Alice S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Best Ramen in London... not a really a big restaurant so it might be better to get there before opening and wait for 5 min until it open so you can get a seat first. The ramen taste really good. You can",
                "datePublished": "2015-02-26"
            }
        ]
    },
    "100": {
        "id": "D5MqfwQo7qOS4VOYrlhGFA",
        "name": "Kanada-Ya",
        "category": "japanese",
        "servesCuisine": "Ramen",
        "priceRange": "£11-25",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Bloomsbury",
            "streetAddress": "64 St Giles High Street\nLondon WC2H 8LE\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/BgA-fOCfoFBEqfzTsSrk4g/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7240 0232",
        "review": [
            {
                "reviewId": "OTQr7P_1fNid2USDLtNmbw",
                "author": "Maxie A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "the best ramen place in london! the original ramen was awesome! add eggs and everything is perfect  definitely have to add eggs cause' its just too good it melts in your mouth. you can choose the noodles ( regular, soft/hard) depending on what you prefer, i asked for regular lol. it tasted very nice. the pork was  and the best part is the pork broth.. OMG.. i can drink the broth like theres no tomorrow haha. definitely should try this ramen when you come near holborn\nthe second time i came here i tried gekikara ramen (which is on their extra menu) i prefer the original one since i cant take spicy because they put a lot of chili ( i think) until the broth became red. but the good part is that they add shredded pork which is very sweet and tender i love it! overall i'll give 5/5",
                "datePublished": "2015-04-26"
            },
            {
                "reviewId": "VHQbpTc3VI2HcqjJa11NJg",
                "author": "Yui I.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "One of the best ramen in London, has lots of char siu topping and fills you up! Definitely add the half boiled egg too. But avoid peak time because you can't book and you have to queue outside",
                "datePublished": "2015-10-27"
            },
            {
                "reviewId": "xMxSyx_nMy4Dwv5CU31nOQ",
                "author": "London Food Babes ..",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "One of the best ramen we've had in London! Simple menu, super tasty. Great environment and really friendly staff!",
                "datePublished": "2016-02-24"
            },
            {
                "reviewId": "vkn0elMGf8mVFcvoytIN2Q",
                "author": "Ian Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I've eaten at bone daddies, shoryu, tonkatsu and ippudo. Bone daddies, meh too watery. Shoryu noodles are low quality. Ippudo is safe but not knock your socks off good. I also grew up on the stuff in Hawaii. This is the best there is in London. Not leaps and bounds better than Ippudo, but good enough that it's worth crossing the street. That being said, if it's a massive wait or you are not in the area, Ippudo is a good alternative!",
                "datePublished": "2016-04-18"
            },
            {
                "reviewId": "OdHtOvQ6diaUUu-kXkdi4w",
                "author": "Daniel F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Firstly I would like to say it's the best ramen I have had in London. It's still not as good as when I had in Tokyo. But what would be. This is as authentic and flavoursome as you are going to get. The Hanjuku egg is a must. I had the Pork Chashu with firm noodles. It's a very small place so be warned that you might have to queue but it's worth it on a cold day for sure.",
                "datePublished": "2015-09-08"
            },
            {
                "reviewId": "J5VNMGGFePLQliQHwCih_g",
                "author": "Mark E.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Simple, good, satisfying ramen. The broth is amazing. There might be a small queue, but you are seated, served and provided with a big bowel of ramen quickly.",
                "datePublished": "2014-10-09"
            },
            {
                "reviewId": "ATliJfbOjgEe7aXUQelU_g",
                "author": "Shaun D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place serves up by far the best ramen in London. It may be small and queues form as soon as it opens but it's worth a visit. The broth is packed with so much flavour and the noodles are cooked to preference. There may only be a few variations to pick off the menu, but all come with generous top quality ingredients. I ended up going for and would highly recommend the spicy ramen which didn't overpower the broth and topped it off with an extra egg which was still lovely and runny. (Visit - 18/05/2015 Lunch)",
                "datePublished": "2015-08-07"
            },
            {
                "reviewId": "hw141rInj2H6bQ86HAaGUg",
                "author": "Catherine M.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "People are talking about this restaurant and I can see a long queue waiting outside so I could not wait to try their Ramen. The menu is quite simple with only 3 items priced 10, 11 and 13. I order original tonkotsu ramen cost £10 without service charge which is a good price for a bowl of Ramen. However the bowl is so small and I literally can count 3 small pieces of pork. The soup is nice but I did not get it much as well as their noodle in such a small bowl. I complaint about this and the waiter said that's how everyone get it in here !!! \nTo compare with other Ramen restaurant in soho, i do not think I will come back here as I will have better choices not too far away. And there is a new big Ramen restaurant coming soon just opposite this restaurant so I am waiting to see how long the queue will last.",
                "datePublished": "2014-11-01"
            },
            {
                "reviewId": "bchBIEq56RwIK3a0ChfGNQ",
                "author": "Verity A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Delicious ramen. Very genuine and tasty and filling. Doesn't take reservations so allow time for that! Three types of pork ramen available. Would return.",
                "datePublished": "2015-05-03"
            },
            {
                "reviewId": "-TTltZR74wa_M-W5f3K10w",
                "author": "Rob H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "O Kanada [ya]!\nOur home of porky broth! \nTrue chashu nestled amidst thine porky froth. \nWith glowing hearts we savour thee, \nThe True noodles hard - or soft! \nFrom far and wide,\nO Kanada [ya], we stand in line for thee. \nGod,  thine ramen's garlicky glory!\nO Kanada [ya], we stand in line for thee.\nO Kanada [ya], we stand in line for thee.\nYeah.\nWhere to start...Kanada-Ya is one of the newest ramen additions to London.  It's awesome.  Even though I've had to wait an hour for my ramen on one occasion, it's still awesome (beware, there are queues at lunchtime too).\nKanada-Ya is the David to Ippudo's Goliath bearing down on it from across the street in the premises formerly containing Damson Cafe.  There's not a lot of seating (maybe room for 25-30 people at a time?) and is perpetually steamy, thanks to the small soup area (to call it an exposition kitchen would be generous, it's pretty dinky).\nAnyhow.  Kanada-Ya does very few things - tonkotsu ramen and onigiri (and ramune, for those of you into that sort of thing) - but it does them extremely well.  My standard order there is the chashu men (tonkotsu with the bowl rim lined with pork, fungus, and nori) with extra black garlic oil (highly recommended for all orders) and a hanjuku egg - it's a shame the egg doesn't come as standard, but never mind.  Also, you get to choose your noodle hardness (I go for extra hard just like my...abs) which is tripleplusgood: the noodles here are the thin Hakata-type - whilst I generally prefer thicker noodles, getting to choose noodle hardness really puts Kanada-ya up in my estimation.  The broth is delicious - I've been mulling it over, but I think the broth flavour just about pips Bone Daddies (there, I said it).  Simply put, one of the best bowls of ramen I've had - whilst I haven't been to Ippudo in London, I have been to a branch in Kuala Lumpur and Kanada-ya's is far superior.\nYes, the service is pretty haphazard.  But for me the ramen erases any bad feeling I may have about the place; besides, it's not like the staff are rude - it's more a case of inefficiency and hopefully will improve over time.\nWe're really spoiled for ramen in London.  Really spoiled.  It's an awesome time to be here.",
                "datePublished": "2014-12-22"
            },
            {
                "reviewId": "r2otNamHNh3YVcd2283cZA",
                "author": "Tiffany W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The first time I came here, there was a queue so I left. I came here for the second time and thank God there was no queue. But the place was still pretty packed and I was seated at the last available spot at a communal table. The service was very attentive and my food came fairly quickly. I ordered the Chashu Men and it was quite delicious. The broth is flavorful as expected, but I do find the frothiness a bit strange... I expected the chashu collar to be a bit more marbled and felt that it was bit too sweet for my taste. Maybe I should have opted for the pork belly instead. The noodles were good. And the sous vide eggs... ARE TO DIE FOR. It's perfection in that aspect compared to Bone Daddies and Shoryu in my opinion. Great place!",
                "datePublished": "2016-02-16"
            },
            {
                "reviewId": "72YPuYK-jhGLt03T8zHBmw",
                "author": "Ngan O.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "the best and authentic ramen in London, for 100% sure. \ntheir chashu, broth, marinated eggs, black galic sauce are BOMBS! I'm so sure cux I have been there for 4 times alrdy....!! You gotta try it!!",
                "datePublished": "2014-10-15"
            },
            {
                "reviewId": "XNHwZ3YRrWAndgRjVHD6DA",
                "author": "Tom T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "soup good taste.Plenty of wood ear fungus shreds and chopped spring onions (green onions)\nseating not very comfortable as they are stools only.\nwaitress asked us whether you want ramen soft hard or very hard.We chose hard which is just right(dente)\nHowever, no compulsory service charge applied unlike Ippudo across the road.",
                "datePublished": "2014-10-17"
            },
            {
                "reviewId": "UsSUZ0GQUNPLyglpkB7Yfg",
                "author": "Una G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great service. I waited for half and hour in a cold day. Ordered original hard noodle and Japanese fried chicken. It were nice. The restaurant is cozy, and comfortable as a ramen restaurant. Great eating experience!",
                "datePublished": "2016-03-12"
            },
            {
                "reviewId": "Kf3VMPO3zPo5-ZMVIjColw",
                "author": "Carwyn M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Beat Ramen I've had in London yet. Authentic flavours and a really cosy setting. It just feels right.",
                "datePublished": "2015-02-02"
            },
            {
                "reviewId": "IOoXRkhn4D6lzENnHNBGGQ",
                "author": "Jennifer J.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The line is about 1hour+ for a Friday night at 8:30PM. Place seats about 6 parties (2-4top) so be prepared to wait!",
                "datePublished": "2014-11-23"
            },
            {
                "reviewId": "BCmjqESFU2R3ZV7e1Pi25Q",
                "author": "Sara A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "5 Stars. Hands down the tastiest, most authentic ramen in London.",
                "datePublished": "2014-10-14"
            },
            {
                "reviewId": "SkQI2bBcUSPyRiglDGOzKA",
                "author": "Harry O.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Authentic Japanese ramen corroborated by someone who's lived in Japanese their entire life (me). Slow rotation is why I couldn't give it 4 stars. Definitely worth a visit.",
                "datePublished": "2014-10-27"
            },
            {
                "reviewId": "hkPogz0g97zzccEFTcq7gA",
                "author": "Kate B.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Moyasi Ramen with very rich broth (very fatty) was disappointing in this new restaurant.  There was very little meat -  three pieces of cold pork with lots of fat - and the stock was nothing special and bland. The Chashu Men's meat was better with soft hot pork.  This is a new restaurant so they have plenty of time to adjust the menu and flavour.  It is way too overpriced and not a good value for money.  I definitely had far better one in Japan.",
                "datePublished": "2014-08-31"
            },
            {
                "reviewId": "esTZt6sd8ywXDS0r00dMCw",
                "author": "Heather O.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "The ramen is still delicious but the wait staff is terrible! We were the second pair of customers seated right as the restaurant opened for lunch service. About 15 minutes later, we were asked to move seats to accommodate another group AFTER our food had been served. We had to stop our meal to move our bowls and plates while the waitress swept crumbs from the table on to my head as I was reaching to move my bags. No apologies. Unbelievable!!",
                "datePublished": "2015-08-13"
            }
        ]
    }
}