{
    "0": {
        "id": "ILyOYUjoKsLmPPlabPnTLQ",
        "name": "Hakkasan",
        "category": "chinese",
        "servesCuisine": "Cantonese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Fitzrovia",
            "streetAddress": "8 Hanway Place\nLondon W1T 1HD\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nyOKqfVgMGswPqwN1VrkBQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7927 7000",
        "review": [
            {
                "reviewId": "fr16HTRora3sLhZ7Su5YTw",
                "author": "Yuanting L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "the environment is nice, it needs a long time to enjoy the meal. Every plate is delicate and delicious, the dessert is so great, and the cocktail has a lot of flavors in it, it's beautiful.",
                "datePublished": "2018-10-14"
            },
            {
                "reviewId": "hzi1GcmWCT73pqLjYFczDA",
                "author": "Shari A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The original Hakkasan on Hanway Place gives sexy cool a whole new meaning. The entrance is a bit hidden in the corner but once you locate the bouncer at the door, the location is easily given away.  We arrived at 8:30 on a Sunday night and the place was hopping. You have to make your way down a dark staircase to the Uber cool cavernous space which opens up to a giant multi-room restaurant with super high ceilings and very minimalist and tasteful decor. The bathrooms are so well hidden the panel doors look like part of the wall. They're very beautiful inside once you find them! \nWe made our way to the bar for a cocktail after we requested a table with side by side seating (which they were happy to accommodate with a modest wait). The bartender has apparently been with the hakkasan family for 8 years starting in Abu Dhabi and now taking up residence at the original london location. He informed us that despite the crowd we were seeing that evening that this was a particular quiet night and that the place is usually so packed that the wait at the bar can be quite long. We opted for the London only cocktails specifically the Tusan Fizz  and Mountain Peak. Watching the bar tender make these cocktails was like watching an artist at work.. and they were just as tasty as they were beautiful. \nWe decided to try the three style mushrooms and the London only spicy okra for our vegetarian dishes. We also ordered the spicy prawns. But the two stars without question were the crispy duck salad and the sweet and sour pork....omg...heaven on a plate. \nThe desserts at our neighboring table looked elaborate and yummy but we were so full. The service here was so wonderful. We chatted with several servers during the course of our meal and they were attentive, friendly and doting without being overbearing. \nWe loved this place so much we vowed to try the NYC location as soon as we return stateside. And we will be making our way there with very high expectations in just a few weeks! \nFrom what I understand the newer Mayfair location in London has parking and is busier than this one, but there's something about this venue that just oozes \"trendy\" and the mystique is just hard to replicate.",
                "datePublished": "2018-10-02"
            },
            {
                "reviewId": "qQ--h88ZgHmD2B-MkLOlNg",
                "author": "Laura G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Try the pecking duck. The cocktails are delicious. Service is impecable and ambience is very cool. A bit pricey but worth the trip.",
                "datePublished": "2018-09-24"
            },
            {
                "reviewId": "r1_KvtNHuTAtMVymkNGd8w",
                "author": "Daniel R.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The place is always on high demand... food is ok, nothing spectacular. The duck which looks huge ends up been served in tiny portions and you are left wondering wheres the rest of the meat??? Anyways, fun to go with friends, more like a bar.",
                "datePublished": "2018-07-09"
            },
            {
                "reviewId": "hnPAhFDg2lgGTlZYaRpD1Q",
                "author": "Aaron R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Get ready for some surprising news: Hakkasan is awesome.  Does that just blow your mind?   Well, it just us.  The only surprising thing really, is that it only has 4 stars currently.   What more do you want from a Chinese restaurant?  I guess maybe it's the price that puts people off, which is admittedly eye watering.  However everything is near perfect: food, ambiance, service, drinks.  All from the top drawer.  \nHere is a top tip for you: go for lunch.   The tasting menu is £38 and you get dim sum, a main, sides, a drink.    What could go wrong?",
                "datePublished": "2017-12-19"
            },
            {
                "reviewId": "aZ5JBofHk1pyiPsmBnoCkw",
                "author": "Derek V.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "All of the food that we had was absolutely amazing. Was disappointed that the bartenders were unable to make a good dry, dirty martini. I mean, we are in London after all.  Unbelievable whiskey collection.  This easily would've been 5 stars but for the constant techno pulse music. I know I am not in my 20s more, but the constant...bump, bump, bump of the music was like a bad 90's venue.",
                "datePublished": "2018-10-06"
            },
            {
                "reviewId": "5O1FNuK0TMG1MTfM7XCVFg",
                "author": "Jahanbi R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I was a bit apprehensive throughout the evening to come to this place and try the food here. It was our wedding anniversary and didn't want any thing to go wrong.\nOh boy! This place is amazing. It is not like any other Michelin star restaurant - there is loud music, fabulous drinks, dim-lit and you have to talk out loud. \nAway from the hustle-bustle of the street noise, we were led by a lady staff to the bar since our we were before time. The bar has an amazing collection and cocktails are delicious. After a wait of 20 minutes, we were taken to our table.We ordered a festive menu including dimsums, and salad, plain rice, chicken, prawns and honey lamb, and finally, dessert. The food were delicious, we enjoyed our time together. The staff is extremely good and they know how to make it special for their customers. Highly recommended.",
                "datePublished": "2017-12-02"
            },
            {
                "reviewId": "ZAOnqANx1BIEm1-n1XZ_-A",
                "author": "Rachel D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Had dinner there on Sunday evening, the combination of good cuisine and a relaxed....rather intimate atmosphere, the hall was dark, but at the same time a lot  of people revive the atmosphere of romance... quite busy place in the evening....\nRoasted Silver cod was come with too sweet souce..as for me..\nA wonderful dessert \"The emperor garden\", I highly recommend....",
                "datePublished": "2017-09-25"
            },
            {
                "reviewId": "JPjqZ5keqcHLnSEhddgKSA",
                "author": "VickiE G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good dim sum place in London! I had it once in NYC and The consistency is there! I still not sure whether I can appreciate price tag that much! Don't get me wrong, it's a great presentation and service place! Just hard to beat home style dim sum!",
                "datePublished": "2018-01-02"
            },
            {
                "reviewId": "5aDY5iCP_Ba4RQaL2hU3NQ",
                "author": "Carlos T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Amazing place\nAmazing atmosphere\nAmazing service\nI'm a huge Hakkazan fan in every country they have their restaurant. but the Hanway Place give love to their concept for the Cantonese cuisine.\nThe Michelin star it's really deserved!\nTh dim sum is the best I ever had. Be sure to order for the supreme platter. It worth.\nThen we had the chili prawn. A bit too spicy but the prawns were outstanding\nAnd for the grand finale duck with tartufo sauce!\nIt's our last night in London but can't wait to be back.",
                "datePublished": "2016-12-27"
            },
            {
                "reviewId": "TJNMKZaJa7hnc1o0ivZ8ZQ",
                "author": "Mike U.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hakkasan is one of those places that just has \"IT.\"  It is kind of hidden down an alleyway off the main road.  A woman at the door checks your name and then sends you in and down the stairs.  There is a little bit of smoke and incense on the walk down and it just adds to the aura.  \nYou are met downstairs by a hostess who checks your coat, and if the table isn't ready, escorts you to the bar.  We only waited a few minutes before our table was ready and we were seated.  Our server took our drink orders and got us on our way.\nThe menu is huge.  Really huge.  We decided our best bet was to order several small items and get a broader taste of what Hakkasan has to offer.\nWe went with the Supreme Dim Sum Platter, Crispy Duck Roll, Morel Mushroom and Vegetable Spring Roll, and the Jasmine Tea Smoked Organic Pork Ribs.  \nThe Supreme Dim Sum Platter is amazing.  The presentation was outstanding.  The platter came with eight dumplings total.  It consisted of two each of the following: gold leaf lychee and lobster, abalone and chicken shumai with caviar, Royal King Crab jade, and black truffle and Dover sole.  I wish I could do the taste of the these dumplings justice with my words but I just don't possess the vocabulary.  It was flat out absolutely delicious.  \nThe duck roll, spring roll, and pork ribs were also extremely tasty.  You can't go wrong with any of these orders.\nThe place is a bit loud so be prepared to speak up and have an amazing experience at Hakkasan!",
                "datePublished": "2016-10-04"
            },
            {
                "reviewId": "q8Q61EOJW78DiqcqZHMK3A",
                "author": "Ali C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "So ok, this is probably the best dim sum you can get in London.  However, they are on the pricey side so be prepared to pay more than your normal cheaper dim sum place like Oriental or Royal China (best 2 cheap dim sums).  And their dim sum are served in odd number of 3 as oppossed to the normal 4.  Which also shows how pricey they are.  That's said, it is by far the best dim sum you can get in London.  Try not to go there for the normal Chinese food as they are just OK and they are cheaper elsewhere.  Just come for the dim sum on weekend and on Sunday, I believe they have the dim sum menu for brunch so only go for this if you want.  If you go on other weekday dinner, their dim sum is extremely limited and only for appetizer (unless they have changed this but I encourage you to check the time they will serve their extensive list of dim sum.  Cocktails here are great too as they have asian flavours in them.",
                "datePublished": "2017-09-21"
            },
            {
                "reviewId": "WBXHXAoDHXXWnZ587FuguQ",
                "author": "Lynn C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The only Michelin-starred restaurant we have been to in London has been Barrafina, but a year or two before they were actually rewarded a star (I know, so much foresight). So it seemed to me that not having eaten at one before we leave for good would be a mark on our soul, so I looked up...Yahuatcha...due to my own love for dimsum. But after perusing through their menu, I became unsure as to whether there would be a marked difference between the dimsum there vs the dimsum i might find at Jade Garden in Chinatown, aside from the prices and ambiance. \nAnd then I perused the menu at Hakkasan. And then I couldn't decide. And then I consulted my college roommate who's been Yahuatcha and didn't see a huge difference and i was still in indecision..until i found that Hakkasan has a tasting menu of  £38 which included a cocktail, an app, main, and dessert (per person). It also came with rice and stir-fried asparagus during the main, which i did not expect.\nThis cheap tasting menu is only available before 6pm Sundays to Thursdays or something (can't remember the details) and not advertised in the restaurant. Although we specifically made a booking for that menu, when they seated us, they did not provide us with it and we had to ask for it in the dim dim underground lighting. The servers when we asked, also told us that we likely will not be full from the menu but we were undeterred.\nThe cocktails were so good. And the food was even better. I was really surprised because my expectations were really low - believing that Chinese food is just Chinese food, but they made it better! Rather than explosion stir-fried wok heat flavours, the food is more delicate and nuanced. \nAfter the dimsum platter, wasabi fried shrimp, duck, cod, and asparagus, the server was right, we were still hungry so we added some ribs from the a la cart menu. Holy the rib was the BEST. And then dessert was so good too. We walked away about £100 lighter in our bank account, but it was actually worth it. \nI'm looking forward to coming back again.",
                "datePublished": "2016-08-08"
            },
            {
                "reviewId": "-i7WUbwTt7vIomN_zfBXZQ",
                "author": "Tanya H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "In short:\n4 stars for food\n2 stars for service\nWe came here for my husband's birthday as he loves asian/chinese food.\nI thought they had a michelin star but I think it's only the mayfair branch that does, which may explain the sub-par service.\nAnyway, we arrived and were escorted to the bar which is pretty cool. Took a while to get served for drinks but when we did they were very good.\nWe were then seated at our table. It's a busy, vibrant dining experience so don't come here for a quiet romantic dinner. It's cool though and I liked the vibe.\nTo start I had the veggie dim sum platter which was huge and very tasty. For my main I had the crispy fresh water prawn with dried chilli and cashew nut which was amazing. A mix of beautifully crispy prawns with whole dried chillis and nuts. Honestly loved it (as did my husband). \nHowever, our waitress was pretty terrible. She was rude and spoke limited english (I think she was eastern european) and not very accommodating. This may have just been bad luck but I was not impressed. I think partly this was because I was expecting michelin star service so maybe service is better at the mayfair branch.\nI would go back, despite the price, because the food is great.",
                "datePublished": "2016-07-25"
            },
            {
                "reviewId": "M9SManhNHGkV424ZtgcKcg",
                "author": "John D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "FABULOUS\nThis is a truly great restaurant. The style of food is called \"Modern Chinese,\" and as that implies they take liberties with the classic style and present avant-garde dishes. I went with my granddaughter for their Sunday brunch and we both enjoyed a wonderful meal. One of our favorite dishes was the Crispy Duck Salad, but we also liked the Steamed Dim Sum Platter and the Fried and Baked Platter. The Jasmine Tea Smoked Organic Pork Ribs and the Grilled Chilean Sea Bass were also excellent.\nWe left very happy and well satisfied with the meal and the value as well.\nAny complaints? Well, to be completely honest, the service for us was merely 4 stars. No one waitperson took responsibility for our table and the appearances by various individuals were impersonal with rote presentations. Although the servers were rather pleasant and no doubt knowledgeable, we had no Asian servers and they seemed to be mostly Eastern European with heavy accents that were a bit difficult to understand.",
                "datePublished": "2015-09-13"
            },
            {
                "reviewId": "ZFo82WXGWsRKqvfZjwoBqw",
                "author": "Sanj M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "'Value for money' are 3 words you probably weren't expecting to see in a Hakkasan review (unless preceded by 'good luck getting your') but if you can get there by 6.30pm for dinner then congrats you're in luck!\nThey serve a 'Taste of Hakkasan' menu of three courses and a cocktail for £35 per person - it's tasty, filling and a steal for the price. A friend and I had a catch-up there after work to treat ourselves, and were given a wonderfully polite welcome from the start with no sign that we were there for last orders from the cheapo menu.\nThe only choice you need to make is meat, fish or veg - my mate and I went fish and meat respectively and shared which was perfect. We both enjoyed our Ling Ling Collins and a trio of dim sum to start - har gau classic, scallop and something yummy with chives. Her aubergine and shiitake salad then arrived but I think we were both more excited by my jasmine tea smoked organic pork ribs. I couldn't taste the tea per se but they tasted delicious with a good amount of meat on them. I liked the nice touch of slicing up the rack at the table and the way they kept it classy by serving them with finger bowls. My main was a generously sized spicy prawn dish, though this time I liked my mate's grilled seabass and honey better. We finished with a delectable trio of macarons in espresso, matcha green tea and passionfruit flavours which (unusually) I could barely finish.\nThe restaurant had gradually filled up around us and it was only on the walk to the toilets that I realised quite how big the place is. The low lighting keeps it feeling intimate while you're seated though, and combined with plenty of dark sexy decor and how beautifully the food is presented I think this would be a good date place. Go between 5.30-6.30pm or after 10pm for the set menu and you can impress them with your savvy bargain-hunting skills too!",
                "datePublished": "2015-07-14"
            },
            {
                "reviewId": "uxqA7SLAGJ4Wx6qlGcet7w",
                "author": "Alexandra Ruyee T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Would go back here just for the atmosphere- heard that the HongKong mafia frequents this place and the vibe certainly attests to that lol. This is a great place to get drinks and their dimsum, whilst expensive, is exquisite and delicious.",
                "datePublished": "2018-01-08"
            },
            {
                "reviewId": "HKulEtMFcT80q2u95c6Tjw",
                "author": "Jihane L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The dumplings were good. The rest of the food okay I think Hakassan is for duck lovers and I am not. But Rihanna was Seating next to us and having diner. So you basically get a nice atmosphere and an okay good. I wouldn't go to hakassan if I am starving I would go to mr chow but I definitely would go there if I look hot and need to go out .",
                "datePublished": "2017-02-05"
            },
            {
                "reviewId": "ZXJM4r0MJX70xyL7CjDi7Q",
                "author": "Sammijo S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hakkasan is far from being the new kid on the block, making its bold debut back in 2001 it was full of Eastern promise. Fast forward 15 years and this kid has still got style. Hakkasan is a gorgeous space, the dark interior with well placed spot lights, delicate gold tapestry, plump noir pillows and pattern carved screens to section off the room and enhance the intimate feel.\nHakkasan is special. You should make an effort to go as its interior will certainly upstage you. Glam, classy and stylish is what you should go for as its a place to celebrate. Beautiful place, food, drink and people. With all this effort on the packaging, what does the content have in store? Well follow me on my birthday dinner journey and you will see. \nWe selected a \"Tast of Hakkasan\" menu for £38 per person. It included a three course meal and cocktail. Value money if i do say so myself and as we roll on, it will become clear why. My cocktail of choice was the Lychee Martini which was absolutely delicious. No scrimping on the Vodka, you could taste the Belvedere. Sam Vanilla, my birthday host, had the Hakka, a mix of vodka, sake, lychee, lime, coconut and passion fruit. Cocktail are a thing at Hakkasan. For years I have heard how amazing they are and they were not a disappointment. \nAs we started our michelin star dining experience, it was a dims sum platter and crispy squid with avocado mustard dressing and caramilised walnut to start. The dim sum selection was a medley of colours and gorgeous ingredients. I tasted king prawn, shitake mushrooms and much more. A delicate devil of a starter! Sam Vanilla loved her subtly coated squid with the right balance between crispy and tender.\nWe settled on a meat feast for our mains with black truffle roasted duck and tea plant mushroom. Wow, truffle is my favourite so the aroma was very tempting. Unfortunately this was not my main choice, so i had to do with a cheeky little fork full of meat and pat the truffle filled air into my direction. I tried something a little different with the wok-fried lamb in a spicy mint sauce. I hit the jack pot too as the lamb was amazing. To describe the food is near impossible as it really is a food journey of loveliness. The sides comprised of baby crunchy asparagus and sticky rice. Again, no taking the eye off the ball, even for the accompaniments. I was truly delighted with this place as a birthday treat! A big thank you to Sam Vanilla, but also a big thank you to Hakkasan for standing the test of time.\nNow it was time for the dessert. Not being one to have a sweet tooth, it was a stab in the dark for me. I was delighted when my milk chocolate, hazelnut praline and rice krispies Jivara bomb arrived. There it was, the wee birthday candle and a message on my plate. Lovely. The bomb was heavenly. Sam Vanilla had the lemon and sesame tart with candied lemon and meringue. A picture of perfection and zest filled dream.",
                "datePublished": "2017-01-04"
            },
            {
                "reviewId": "0nHB7kZKm-PLtt2jVH0l7w",
                "author": "Hope C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love this restaurant. I went there for my birthday about five years ago, and returned again recently for a special night out. Both times were exquisite experiences - and I use the word experiences, not meals, because this is exactly what separates a good from an outstanding restaurant: attention to detail and the crafting of a dining experience, rather than a focus solely on great food. It's rare that you find such an upscale, modern, sensual and trendy dining experience centered around traditional Cantonese food. Thank goodness they haven't taken the \"Asian fusion\" route (one that almost unfailingly results in quality reduction). \nThe restaurant is down a dark alleyway off Oxford Street. Think James Bond, sexy spy movies, understated luxury. You would assume you were gaining entry into a secret celebs-only club, not a Michelin-starred restaurant. Down the stairs you go, your interest piqued and your excitement growing. The entryway will not disappoint. The interior was designed by the set director of the film The Matrix, and it's stunning. The intricate woodwork, lighting, bustle, aromas, ambiance...all are intoxicating and immediately provide respite from the stressful streets of London. Beautiful people, beautiful food, beautiful bar. \nI remembered specifically the heavenly texture of the silver cod on the menu, so wanted to make sure we ordered it this time. Because of the tantalizing selections on the menu (lovely cocktail list too), we decided to go with a Signature Tasting Menu for 60 pounds per person. We got a dim sum sampler, some of the most flavorful smoked pork ribs I've ever had, and an array of entrees that lived up to my expectations (what a relief). The silver cod was just as perfectly cooked, tender, moist and slippery as I remembered it from the past. The Angus beef stir fry, vegetables and prawn dishes were also amazing. Service was flawless. My husband commented on how it was one of the best dinners he'd had in some time, and how surprising it was that this was Chinese food.....\nThe clientele here is a mixture of people celebrating special occasions and smartly dressed businessmen and women having work networking dinners. The dining room seems to maintain that perfect equilibrium of gregarious but intimate. It's alluring AND trendy. Not sure how the place manages to keep the balance going, but it works and it's a wonderful escape. \nIt's not cheap, but I highly recommend saving some money and time for an experience here if you can. Dress up, go balls to the wall, and have some fun.",
                "datePublished": "2015-01-18"
            }
        ]
    },
    "20": {
        "id": "ILyOYUjoKsLmPPlabPnTLQ",
        "name": "Hakkasan",
        "category": "chinese",
        "servesCuisine": "Cantonese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Fitzrovia",
            "streetAddress": "8 Hanway Place\nLondon W1T 1HD\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nyOKqfVgMGswPqwN1VrkBQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7927 7000",
        "review": [
            {
                "reviewId": "xzJjmn4cPu60Wdw5feu-eg",
                "author": "Zena M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is probably the best meal I ever had ! Worth every penny ! Not a cheap place but if u had to choose where to spend some cash ! Don't hesitate at all . Every single meal ordered was to die for ! Every dish tasted superb ... I can't explain enough how good the food tastes . One thing for sure ... it's the best food I ever had .although I travel a lot! So far it's my number 1 . Thank u London",
                "datePublished": "2017-10-11"
            },
            {
                "reviewId": "KPQjHNyvVouQiktE3weAnA",
                "author": "Jonathan W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Still good although from a high point of being excellent, it does feel like it is on the decline. \n \nThe food almost feels like an after-thought to the booze. A high-end version of pork-scratchings complementing the high-end spirits.\n \nThe décor looks aged but is well hidden due to the minimalist lighting. I feel it is on the slow road the mediocrity.",
                "datePublished": "2017-04-11"
            },
            {
                "reviewId": "PGCIxLQqeLj0H9WRY4kEzw",
                "author": "Daniel F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Really nice inside. Dark and moody and a little hidden away but I like that. Eventhough it's very close to the hustle of Oxford St.\nAll about the Dim Sum and some cocktails. Couldn't fault the taste and quality. Pricey but that is to be expected for the reputation you know you are getting.\nWill be back for one of their deals they often have running like Dim Sum Sundays.",
                "datePublished": "2015-12-10"
            },
            {
                "reviewId": "Gr8KbdElwq470OijnPzwdA",
                "author": "Dan P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "My friend and I dined here and ordered the tasting menu.  IIRC it was something like 119 GBP/person.  With a bottle of wine, our bill was around 300 GBP so this was definitely a splurge meal for us.\nThe food was great though.  There was so much food we couldn't finish all of it but I tried everything.  The duck was great.\nIf I can afford it, I'd like to come back again...\nI had a reservation at 7 and was told that we had the table until 9.  However, we didn't end up leaving until around 10 so I guess it was all good since we spent so much money here.\nThe location is a little tricky to find but google maps and such can lead the way.\nIt looks like it used to be a trendy bar/club type place but it's not quite as trendy anymore.  It was still pretty busy though.\nOur waiter was good and attentive but was a little annoying and over the top saying things like \"Oh, this is my favorite dish in the entire world!\" and \"Excellent choice, that's my favorite\", etc.",
                "datePublished": "2015-09-29"
            },
            {
                "reviewId": "JVRlNFSfOaHDhMAlpVKqWA",
                "author": "Mashael Z.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Hakkasan is one of those places that always makes top 10 lists, so this year for our anniversary, we thought we would try it. \nI tried the dim sum platter, and my favourite was the shimeji mushroom dim sum which was the best flavour of the night for me. The other dim sum were decent, but nothing really stood out and one amazing piece of dim sum doesn't qualify the entire platter.\nThe chicken corn soup was also not impressive, I have had better at Good Earth. It tasted mostly of chicken and not much else.\nThe pepper rib eye beef was really good though and had a lovely peppery aftertaste. I really enjoyed the tender pieces of beef and the yummy sauce they were in. The deep fried prawns were a bit too sweet for me, but my husband really liked them.  We also ordered Hakka noodles, which were thin noodles with great texture but very little flavour at all. They would be great to mix with a spicy sauce-y dish, but on their own they are pretty bland.\nI was excited about the Michelin starred food and although everything was good, nothing really blew me away. It was like going to a good concert but with only low volume music. Perhaps if I had ordered more in a big group I might have been more impressed. The restaurant itself was nice, stylishly dim, but nothing special.\nI have heard that the service is iffy, but our server was nice enough, although I was a bit worried that she was a robot sometimes. They even sent us a plate with happy anniversary written in chocolate and a scoop of lovely sorbet with graham cracker-y goodness, and we really appreciated the thoughtfulness.  I enjoyed the beef but I don't know if it's enough for me to go back, unless I was in a big group and could try a lot more.",
                "datePublished": "2014-07-14"
            },
            {
                "reviewId": "j-usE4fk5ENgz6YX_78quw",
                "author": "William M.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Overpriced, too focussed on who is there, not enough focus on what is on the plate.\nThe staff all think they should be in that dreadful Chelsea television programme",
                "datePublished": "2014-06-17"
            },
            {
                "reviewId": "Ndl3dtxp3yTJl0DR0U_wnw",
                "author": "Jonathan V.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I absolutely love Hakkasan!\nI only visit on Saturday afternoons as they have a EXTENSIVE and very TASTY dim-sum menu for lunch.  I personally believe it is the best I've ever tasted.  To top it of they have stunning cocktails to compliment every dish.\nThe venue is spectacular and the staff cannot be better.",
                "datePublished": "2015-08-04"
            },
            {
                "reviewId": "o14vSWaccWGVMUjICcmiVw",
                "author": "Hanna B.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Heard so much about this place. Heard it was best Chinese in London. Well. Ambience was great. Music was repetitive and loud. Food was salty. No way the best Chinese I have had. Average at best",
                "datePublished": "2017-04-29"
            },
            {
                "reviewId": "8JE71CwQmk1iHnyBV8gIjg",
                "author": "djamal a.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Everything we ordered were excellent! \nYou must not miss the Dim Sum. The corn soup was fantastic.",
                "datePublished": "2015-10-22"
            },
            {
                "reviewId": "UDaCUgT-P-EatBz3ccdrLw",
                "author": "Tally D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Came here for their Dim Sum Sundays as a way to celebrate turning in our dissertations and completing our Master's programmes. I'm super overdue in writing this as we came here last August and the menu has changed a bit. But it was the most perfect, delicious and relaxing lunch I've ever had. I can still remember it as if it was yesterday!\nBesides the food I think a major draw of this place is the atmosphere. The restaurant is hidden away on a tiny side street and when you descend the dark stairs into a wide black-walled yet well lit room it feels very exclusive. The staff are very friendly and polite though I imagine more so when you have a reservation and know exactly what you're doing than if you just happen to wander in. Nevertheless we were well taken care of. We got a nice corner seat with a great view of the whole restaurant. And even though it started to fill up by the end of our meal, we had a sense of privacy the whole time.\nI don't think my descriptions of our dim sum would do the food justice so I'll just say this; it was outstanding. Seriously one of the best meals of my whole life. I can't even decide which course was my favourite. Between the cocktails, the appetizers and main meal, to the desserts and the tea I was a huge fan of everything. And it was so beautiful! Nothing I enjoy more than food that is not only delicious but aesthetically pleasing as well. \nAs far as I know this is one of many Hakkasan restaurants around the world. Now that I'm back in LA I can't wait to try the one here. I admit this is not a restaurant you go to when you're not a budget. But it's nice to splurge every once in a while. Treat yourself to a wonderful dining experience at Hakkasan. You won't be disappointed.",
                "datePublished": "2015-07-15"
            },
            {
                "reviewId": "k32MZJKNlkuICXVbf0789w",
                "author": "Holly M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Took my daddy for his 50th while in London!!\nGreat atmosphere..a bit noisy! Welcoming service.. Had cocktails at the bar while waiting on our table..cocktails were good! Although I did think a bit pricey which would be typical of a Michelin star restaurant in London!!\nFood was amazing...we had two starters the squid & the duck!! Both lovely! Waiter was very attentive, pouring water & wine each time glass was low! Mains were both beef & both very very good..large portions & the rice was perfect!!\nThey even brought out a dessert for my daddy with happy birthday on it! Nice touch!\nWould deffo book to go back again or better still try the sister restaurants that are scattered around the world!!",
                "datePublished": "2015-05-18"
            },
            {
                "reviewId": "tzG9zBeY_BWmY5aTCE2Trg",
                "author": "Rachael H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "If you like Chinese, you will love this place... and even if you don't like Chinese, you will do by the time you have visited here!\nI must admit that I am not usually the biggest fan of Chinese, but I can honestly say that my meal at Hakkasan was one of the best meals that I have ever had. The food was absolutely out of this world. It's hard to put a finger on why it was just so good - but it really was! Tender, moist, flavorsome... just wow! I was really blown away.\nAside from the food, the service is good, the decor is Gothic nouveau and the pricing structure is certainly palatable. For those who have a little cash to spare, you can enjoy some delightful dishes that cost up to and over £300 a plate. For those that are on a tighter budget, you can go for the tasting menu at around £35 each. That is what we went for, and we certainly were not left feeling hungry at the end!\nAll in all, a superb restaurant. I wish I could give it 6 stars. I highly recommend it!",
                "datePublished": "2016-09-25"
            },
            {
                "reviewId": "j0MfB8nCUj1TZ5BW2314bw",
                "author": "Sam T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The food and service is very good. The atmosphere is a bit hectic -- very loud and and busy. Not an amazing experience, so it was a bit disappointing.",
                "datePublished": "2017-11-06"
            },
            {
                "reviewId": "d8D0m7iTqYZd6UmRyrQPRQ",
                "author": "Katie H.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "My friends and I decided to continue our girls dinners with an early dinner at Hakkasan mid week. We found a £35 Taste of Hakkasan menu, which includes 3 courses and a cocktail - not a bad offer! \nWhen arriving at the 'original' London Hakkasan off of Tottenham Court Road you go down a dark stairway, past the blue lit reception area, into a dark and moodily lit space with the bar at the back.\nAfter a first cocktail at the bar we were shown to our table, they kinda squashed us in, but it was a nice round table.\nWe had Dim Sum and Crispy Duck Rolls for starters, then a choice of either Roasted Silver Cod, Pipa Duck (more crispy duck - I can't get enough of it!) or Stir Fry Black Pepper Rib Eye.\nDesserts were selected from the full main menu - I can recommend the chocolate one!\nSo what's the verdict? \nThe food looked & tasted amazing too, I was only uncertain about the sauce with the Roast Silver Cod, but that wasn't my dish!. Unfortunately the dinner was let down by the service. With a Michellin starred restaurant I expect a certain level, certainly not what we received.\nNot only did we get told that the Taste menu wasn't for those that were hungry - a suggestion that we literally were not going to get enough food, but also the impression that we were being looked down on for choosing this option - staff repeatedly walked into me when serving or clearing the table (it's not that dark in there surely?!) and food didn't arrive at the table at the same time.\nI can't excuse any of these issues when I've been to similar caliber restaurants (Roux at the Landau and Maze) on similar deals and been treated superbly, so this is something that Hakkasan should work on for all levels of client - not just those dropping £700 for dinner for two (true story, but it wasn't me!).\nAnd the staff member was wrong - we had plenty of food and left feeling stuffed, especially after a pot of tea, post dessert.",
                "datePublished": "2015-06-16"
            },
            {
                "reviewId": "VTFSHBMd3al-R4tRjN_LbA",
                "author": "Jinny N.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I admit it was a selfish idea to bring my husband here for his birthday. We have both wanted to come here for ages but never seem to remember to, as its smack bang in the middle of Oxford Street/Tottenham Court Road. There is another Hakkasan in Mayfair but we wanted to try the original. We were staying at the Hoxton so we had a nice stroll to the restaurant for a pre dinner drink. Our table was ready for us so we had a couple of glasses of bubbles while we drooled over the menu.\nSo I'm incredibly greedy, especially so when it comes to eating Chinese. I pretty much wanted everything. My husband reassured me we would come again so that made making choices less fraught. \nSo to start the dim sum platter and fried soft shell crab. The dim sum were a picture! Best har gau dumplings I've eve had. The scallop shumai was pretty special too. The soft shell crab was cooked to perfection, juicy and crisp.\nFor mains we had the claypot poussin, the black pepper rib eye with merlot and chilli morning glory with rice. The beef was incredibly tender, super tasty and I was sceptical about the merlot. The poussin was covered in an amazing sauce.\nWe were now faced with dessert. Part of me wanted to order more starters after seeing other dishes passing us by, in particular the prawn toast which looked epic! I always get food envy. I had a word with myself and we shared the apple tatin with coffee and jasmine tea.\nIt was a lovely evening and I can't wait to come back again.",
                "datePublished": "2016-01-03"
            },
            {
                "reviewId": "SuxNtHsdvsOTQ4EMT9-mvQ",
                "author": "Remy Z.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Delicious food + good service = good experience \nI believe it is Chinese fusion, but the food was surprisingly good. It's very expensive, but good for some occasions.",
                "datePublished": "2016-02-08"
            },
            {
                "reviewId": "egQOYvHJWYKu8R_RoQct4Q",
                "author": "Hector B.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "This was a bitter disappointment. Had heard good things about the restaurant, however on arrival we found the place over booked. We were ushered into a cramped corridor of a bar, where aside from not being able to hear ourselves speak, we were unable to get to the bar as it was so crowded. The disappointing thing was that the bar was full of dissatisfied customers waiting overly long on their tables. Our 9 o clock table came at 9.40, after a huge amount of pestering of the overworked staff. \nThe table we were given was so near the DJ that we couldn't hear, and the table was so dark we couldn't see. Typically, a second after opening the menu, a waiter impatiently asked if we has chosen, and we told him that with our senses so deeply inhibited, it was fairly difficult to discern your a** from your elbow, let alone chose food. In the end we left the restaurant without eating, as the place had the all the charm and character of a reversing dump truck with no tires on. \nIt was a typical restaurant that was greedy- and overbooked hugely, and tried to be too cool. One doesn't go to one of the most expensive Chinese restaurants in the world to listen to repetitive and shoddy music from a low end DJ- in fact a DJ has little place in a restaurant at all. Put a candle on the table, and stop thinking your a hip place. You're not.",
                "datePublished": "2017-09-26"
            },
            {
                "reviewId": "cl46dpTegPb957WVJBccBA",
                "author": "Liz B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The restaurant is beautifully decorated. Our server was very attentive. The cocktails are strong yet still taste good. Everyone says this but they have amazing dim sum. The crispy duck roll is really tasty. The grilled Chilean sea bass in honey was the best fish I have ever had. The stir fry Australian lobster was good (but maybe not quite worth the hefty price tag). All in all great experience.",
                "datePublished": "2015-11-11"
            },
            {
                "reviewId": "k070BF31RD6MFPXNhXleFw",
                "author": "Yuen P L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Fancy a luxury night out? Well good for you, but Hakkasan is probably not the way to go unless you don't mind spending an extravagant amount of money on good (but not great) food and don't mind sitting in the dark or being restricted to a 2hrs stay. Having been awarded a Michelin star, Hakkasan does seem self-indulgent with bouncers at the door, service that opens the door for you, takes your coat and bags away from you and is there at your beck and call. All this and yet the entrance looks like it is the entrance to a seedy nightclub, the decor within is dark and simple as if to hide the fact that they couldn't be bothered to inject some vibrant colour into the place and the seating is not only not that comfortable but the tables a quite close together so it is easy to see the food the people next to you are eating.\nNevertheless, the food and drinks are inoffensive and packed with a good variety of ingredients that you may never have tried before, the staff are well trained, and when they cook a chilli dish they don't hold back.",
                "datePublished": "2014-11-01"
            },
            {
                "reviewId": "YCZnZlREYldNmxYCgBSzhA",
                "author": "Dave S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A special occasion treat of a meal tucked away in an otherwise nondescript off-shoot of Oxford St.  You enter amongst some incense burning and down some stairs, so they do a good job of making it feel like you're entering a new environment (rather than the back alley that it is).  The other aspect that we immediately noticed was the abundance of service staff; it felt more like a hotel check-in rather than a restaurant.  Suppose that's what you should expect form somewhere with a Michelin star!\nAmbiance was dark wood everywhere, but lighting helped with that and set a nice mood.  The star of the show for me was the black truffle roasted duck, which was bursting with rich flavor.  It's not going to hit the spot if you're looking for a sweet taste, but rather the savoury flavour hits you right away.  The sweet and sour pork was also prepared well and was a good price compared to most of the other dishes on the menu (though probably not going to beat your local takeaway).  It gave us pause like 'What's the catch...', but no ill effects to speak of to date.\nDefinitely an occasion restaurant as it's quite pricey, but the service and quality of food seemed worthy of a Michelin star.",
                "datePublished": "2016-01-31"
            }
        ]
    },
    "40": {
        "id": "ILyOYUjoKsLmPPlabPnTLQ",
        "name": "Hakkasan",
        "category": "chinese",
        "servesCuisine": "Cantonese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Fitzrovia",
            "streetAddress": "8 Hanway Place\nLondon W1T 1HD\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nyOKqfVgMGswPqwN1VrkBQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7927 7000",
        "review": [
            {
                "reviewId": "PONsJXDIPBYP4MoK0piX-g",
                "author": "Carlo Alberto C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is one of my favourite restaurants in London, every plate combines taste with aesthetics and the preparations are always so colourful and good-looking.\nHakkasan is a well known name as it can be found all over the world. In London there are two restaurants, one in Fitzrovia and the other one in Mayfair. The style is nearly identical, consisting in wooden surfaces, glass panes and coloured lights; a cocktail bar, a low-lighting and intimate ambient with some music playing in the background.\nThis is probably one of the most popular restaurants within its category. In fact, people need to book their table some days in advanced since there is always a lot of people and it is very unlikely to ind a table without having a reservation.\nSome of the dishes I suggest the most are the Crispy duck rolls and the Dim sum platter which are two of my favourite plates and I always get them when I go here.\nIf you like Chinese cuisine I strongly suggest you to check this out and maybe also let me know what you think about it. If you are more into Japanese food, there's also that! Always a part of the Hakkasan group, it is called Sake no Hana.\nThis is a review taken from my Travel blog which can be found here: \ngoo.gl/kvy5Oi",
                "datePublished": "2015-08-16"
            },
            {
                "reviewId": "JWJRikSssNCUzWbyJUT68A",
                "author": "Mital-Micheala P.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This is essentially overpriced Asian food off Tottenham Court Road. I've been to both branches of Hakkasan in London and this is pales in comparison to Hakksan Mayfair in terms of service, food quality and also general decor. Even walking to HHP feels a little eerie given it's at the end of a dark side street. Unfortunately, the inside also suffers from the same poor lighting.\nThis is based on two different experiences from around two years ago as well as one last year (for the sake of clarity) and there are some good dishes on the menu but I've always felt underwhelmed and hungry when leaving. The drinks are average and truthfully, the first time I visited the waitress pretty much turned up her nose at two of my friends who are strict Jains and do not drink. For a Michelin starred Chinese restaurant this is disappointing both in terms of food and service. I live in Hong Kong now and have been to many other dim sum restaurants in London and although some of the dim sum on the weekend menu at Hakkasan are creative they do not justify the price tag in my opinion. The ambience at the other branch is much nicer and I've had better experiences with staff as well as enjoyed the food a little more. A quick tip - don't bring your own birthday cake unless you plan on also ordering dessert here, you will be charged a cake cutting fee per person.",
                "datePublished": "2016-08-07"
            },
            {
                "reviewId": "5dQmEQeHuNXEjq76jvbNLQ",
                "author": "Andrew W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Fun find for dim sum located in an alley out of the way.  The dining area is subterranean, dark, and mysterious that feels like a scene out of The Matrix or Bladerunner.  Fun, fruity cocktails and mocktails accompany the courses.  A few modern twists on traditional dim sum that keeps your palette guessing.  All of the waitresses are dressed in the same boldly colored dresses and perform with the demeanor of automatons.",
                "datePublished": "2016-12-27"
            },
            {
                "reviewId": "EZ_Lp0TDCx0j9mJNnzYx7w",
                "author": "Ada G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This was an amazing experience. From walking down the two flights of stairs to sitting down in the dimly lit but chicly decorated restaurant, it was a very complete experience. \nI ordered the vegetarian dim sum, which was probably some of the best, most flavorful dim sum I've ever had. There were 4 different types of dim sum in the bamboo container, and 2 of each type. For 11 pounds, this was a great value! It came out steaming hot, with a great texture. I think it had fake meat, vegetables and sauces, and the dim sum came with both soy sauce and spicy chile sauce. I definitely recommend this dish! If you're not too hungry, you can definitely order it as the main dish and split a side of rice.\nThere were 4 of us, and we shared a bowl of fried rice. This was only 5 pounds, and each person got a full bowl. I also tried my friend's vegetarian spicy black bean chicken and beans. This was delicious as well, and super flavorful. \nWe finished with 1 dessert split between the 4 of us. We ordered the Javindra Dessert (or something like that), which is an ice cream chocolate mousse ball coated with a crispy layer and covered in dark chocolate, which they pour after setting it down on the table. It also has pop rocks on the side!\nAll in all, definitely coming back here!",
                "datePublished": "2014-07-25"
            },
            {
                "reviewId": "s4GEF7IspK4PCcLYM77o4g",
                "author": "Jeni F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "When I think of upmarket restaurants that fail to disappoint in London, this is (so far) pretty much the top of my list! \nBetween the two of us we went for the £60pp signature menu:\nSignature menu:\nDim sum platter\nscallop shumai, har gau, Chinese chive dumpling \nand shimeji dumpling\nJasmine tea smoked organic pork ribs\nRoast chicken in satay sauce\nPan-fried silver cod\nStir-fry black pepper rib eye beef with merlot\nSpicy prawn\nwith lily bulb and almond\nSeasonal vegetables\nSteamed jasmine rice\nWe finished the meal off with the chocolate ganache with raspberry sorbet and salted caramel.\n \nThe decor and lighting was perfect, the food was even better than I'd imagined, and being able to share the signature menu meant we both got a taster of varied Hakkasan specialities without spending £££s.",
                "datePublished": "2014-08-24"
            },
            {
                "reviewId": "_6guun9lkVHovaCeQ7ZNxw",
                "author": "Joy L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is my first try of a michelin-starred Cantonese dim-sum restaurant, and it did pass my approval because the dim-sum was as good as the best I've had in Hong Kong and China. \nThe quality of the shrimp dumpling especially, which for me is the best way to judge the quality of dim-sum ingredients, was incredible with its translucent skin and natural texture. The white bread of the barbecue pork bun was soft and light. \nEven though the prices are exorbitant because you can pay 1/4 of the price for the same quality in China, in London this will the best it gets for quality dim-sum along with a great atmosphere.",
                "datePublished": "2013-11-19"
            },
            {
                "reviewId": "DAR163HqEryzEfVHEht_5w",
                "author": "Priya K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "You know you're in good hands when a Modern Chinese restaurant is a 1 Michelin Star. Amazing cocktails, amazing food and impeccable service. When you don't know what to get, the top 5 dishes are recommended by your waiter, and they do not disappoint. I was highly impressed, and I don't mind paying a hefty bill for 5 star food. Definitely recommend to all. Modern twist on Chinese food!!",
                "datePublished": "2015-03-27"
            },
            {
                "reviewId": "1wiADhjml09WAP2Bbkr1uA",
                "author": "Schelly Y.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Excellent service and okay food. Service was as expected for a Michelin starred restaurant. We went on a Monday for lunch and it was dead but I would assume it gets quite packed at night. The restaurant interior is very trendy with a large bar.\nDuck salad was the stand-out dish with crispy duck pieces complemented by pomelo and grapefruit to lighten it up.The grilled Shanghai dumplings really just looked like run of the mill pot stickers or gyoza. The crispy duck rolls were loaded with duck but when eaten without the sauce they lacked flavor.\nCrispy duck salad, with pomelo, pine nut and shallot\nJasmine tea smoked organic pork ribs\nGrilled Shanghai dumplings\nCrispy duck rolls",
                "datePublished": "2013-10-30"
            },
            {
                "reviewId": "OHarZ8anVvH-jxMzQUt-LA",
                "author": "Karen P.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Food - 4.5 stars however all other ratings considerations drove my rating lower. So here's the scoop:\nFood: wow - excellent meal.  I started with the vegetarian hot and sour soup. It was probably the best I have had - lots of flavor and no flavorless dollops of tofu. I had the Three Style Mushroom Stir fry. Normally, I would not select a mushroom only dish although I am a huge fungus fan - largely because I usually find the dishes to be uninteresting but I was intrigued given other menu selections and the restaurant's reputation. It was a good decision - the mushrooms were amazingly flavorful with just the right sauce. My date selected the dim sun option as an appetizer and the stir fry peking duck. Both were very good. Ordering brown rice as an accompaniment must not be common as instead of a substitution for white rice, I got a huge bowl of it and it cost an additional 8 pounds. \nAnd here was the downside:\nService: ...was uneven, and not just a little uneven. We had good service at the bar where service was efficient. I was especially impressed with the well chilled glass in which my date's vodka martini was delivered - perfect!  However service went downhill once we were seated. We dined downstairs. It appeared that the waitstaff was assigned to a section and our waitress was challenged with keeping up with orchestrating the meal. She would disappear for a while and appear at times when we weren't ready. The addition of a second person to take our drink order was poorly coordinated and he did not seem to be very interested in his job nor in our requests. He wasn't interested in explaining the wine list; he plunked our drinks down as if he couldn't wait to leave. We waited an inordinate amount of time to get our bill as well. \nIn addition, the wine list was terrible! It wasn't organized by varietal nor region, nor even flavor profiles. Instead, it was a weird mix of selections under topics such as \"Classics: Fine Wines with History\" (most wines have history and nobody offered to provide the history nor was it explained in the list), \"Vielles Vignes: old vines\" (NOT all French and old vines is an undefined designation) and \"Purity: the expression of the fruit\" (huh?!). I love my wine and I love to peruse a good wine list.  The Hakkasan wine list was just painful and its organization made it impossible to make a selection.  It was so poorly organized that we gave up on finding something and ordered cocktails.\nPrices were really high. I could chalk this up to it being London and London prices but the prices were over the top.\nBefore leaving, I stopped at the bathroom and met another American while washing my hands.  We looked at each other and almost simultaneously said \"Weird\".",
                "datePublished": "2015-07-14"
            },
            {
                "reviewId": "LHWgUg0ra1BFMrJVcXU41w",
                "author": "Olivier C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Amazing restaurant, the athmosphere is great and the food phenomenal. It does not just taste great but it looks amazing.",
                "datePublished": "2016-10-19"
            },
            {
                "reviewId": "AEn8G_n_Ntv_xd_ccMh-HQ",
                "author": "Liam R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This review is for the sunday dim sum menu.\nStarted off with an excellent gin based cocktail. They sat us down and explained the menu to us. The first course was a crispy duck salad. This was amazing how the flavor of the duck and the crispness came together in your mouth. I wish they had brought more. \nThen came out 8 different dim sum dumplings in all. Generally typical (prawn Pork etc) but what stood out to me was the venison. However I wish I had used more pepper sauce on these. \nNext was our appetizer course- since we ha four people we ordered both the squid and the vegetable. Both were crispy. \nI should mentioned that during the meal we had champagne being poured for us the whole time. Not fancy bottles but still very tasty. Went well with meal. \nFinally the mains came and we were getting full. But alas we enjoyed the Seabass and the lamb. The Seabass was a bit fishy tasting (it is fish) but seared well. The lamb was tender but needed more flavor. The fried rice wasn't special but the Bol Chou was good. \nAfter this feast we thought we were finished. But alas after a brief period of rest came dessert. The rest of the table ordered the chocolate sphere thing which crackled in your mouth. Really good with the chocolate sauce poured over it. I however went or the macaroons. Always tasty. Did I mention we also got a dessert cocktail? I got a whiskey one which was quite a nice ending and I thought went well with the macaroons. \nAll in all a great value for Michelin star food. It took all afternoon an was a great opportunity to spend time with friends. Some of the flavor a could have been stronger. Lastly wish it wasn't in the basement but I think it's part of the desired atmosphere",
                "datePublished": "2015-04-26"
            },
            {
                "reviewId": "8Ot2ZwU4H0s4m3YxhzAWGA",
                "author": "Meena B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The dim sums were good, but the main course was just average. The ambiance and drinks were good. Have been at Hakkasen at other locations, but the food is always a hit or miss.",
                "datePublished": "2017-04-09"
            },
            {
                "reviewId": "UFamOYVwZnO_9vZ0MmjtJw",
                "author": "Lee K.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "A friend and I went here for the Sunday three course special. The service was impeccable, and all of the food was perfectly cooked. However, the dishes lacked imagination and complexity. The flavor profile was pretty flat. We're from Indiana and joked that their bland dishes would be perfect for the Midwest. Do not expect anything here like the creative dishes of, say, a Gymkhana or Buddakan.",
                "datePublished": "2017-03-14"
            },
            {
                "reviewId": "22GJcXcRvvY-J5spd78bDQ",
                "author": "Henry C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "As good as the Hakksan from SF and Vagas :)  It' s hidden in hard to find place tho :)",
                "datePublished": "2015-06-18"
            },
            {
                "reviewId": "0UUVDYZzHckOy8rY7vxeOA",
                "author": "Angela K.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I was really looking forward to this place, and the food was definitely good, but it was incredibly expensive for what we were served. My husband and two kids spent $300 on lunch (lunch!) and the food was good but didn't blow me away. I don't spend that kind of cash to have a decent lunch.",
                "datePublished": "2016-06-10"
            },
            {
                "reviewId": "3qtnKc2LRLf1oF3bNw7C-A",
                "author": "Corinna S.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I had reserved a table for two, mentioning a birthday as occasion. Seriously, we felt we received the worst table in the house, next to the cashiers desk. We refused to sit there and were seated to a very nice table right away. \nIt all went downhill from there. \nThe service was pestering us the whole time, pushing and pushing and pushing. We felt they wanted us out as soon as possible. This is what ruined it for me. Management should have a look at that. But why really, when all table are taken always. \nThe food: I ask myself how they received a Michelin star! \nI had the Dim Sum platter and Green tea smoked chicken. What comes, is the bare chicken. Rice and vegetables need to be ordered seperately. Which feels like a joke to me. \nThe food tasted good. That`s it! Seriously my lunch-chinese in Hamburg offers the same taste for 10 EUR. And I make the same morning glory at home. No special twist, no interesting aroma, no nothing.\nThe noise level is overwhelming. \nThis was so ridiculous.\nHow can all these people think that this is the best food they ever had? This is a mystery to me. \nI admit, the interior is spectacular. And that was worth seeing. But that was the only thing that I didnt fall into depression when leaving. \nIt was so not worth it. Sadly it was my birthday. We should have gone to Muriels Kitchen across from the Ampersand Hotel instead. And would have had a fab time.\nThink twice before you come here. There are far better options in London.",
                "datePublished": "2015-02-03"
            },
            {
                "reviewId": "CNGSulokJ1bS0NJCYTb3_w",
                "author": "Vaughan J.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A real dining experience with a subtle and contemporary take on Chinese food. The interior paves way for a relaxed atmosphere with clever use of lighting and partitioning to give you that private and exclusive dining experience.\nWe ordered a selection of dishes from throughout the menu, sharing and discussing amongst us in the traditional Chinese way of eating. The vegetarian and meat dim sum platters were generous enough with the prawn dim sum offering an amazing mix of texture and a fresh prawn flavour. In addition the stick tea ribs were amazing and again came in an ample portion. \nFor mains, we ploughed through a variety of dishes including vegetarian (of which there is a great selection) and unanimously came to a decision that the sea bream with champagne and honey sauce was utterly memorable. \nFor desert I would most definitely recommend the chocolate bomb and a nice selection of macaroons. \nOverall, I would highly recommend this place as an dining experience that can see you lost from the outside world for a number of hours whilst you enjoy the many wonderful flavours of Asian cuisine.",
                "datePublished": "2014-01-25"
            },
            {
                "reviewId": "wxmlltsQUitTibf9TUIjdA",
                "author": "Steve W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Based on the cheaper £35 taste of Hakkasan menu, this place isn't bad.  Considering a cocktail is over £10 and you get one, plus dim sum, a main and a dessert the deal is pretty good. \nIt's kind of classy in a 90s kind of way, it's dark and modern but at the same time it feels a bit bit dated for some reason.  Service was good and the atmosphere was good, food was ok. \nComparing it to the best Chinese, the dim sum was a nice modern twist in terms of flavour but the steamed dim sum's pastry was too thick and floury, and the balance of the filling in the duck spring roll wasn't quite right.  \nThe beef in Merlot sauce was very good with great aromatics, the pippa duck was probably sitting on the pass too long as the skin wasn't that crispy and the cod with champagne and honey sauce was awful.  The cod dish smacked of something to put on the menu to try and elevate the place, why ruin the delicate flavour of fish with such a sickly sauce?  In true Chinese cooking sugar and sweeteners are used as seasoning to bring out natural sweetness not make the dish sweet.  The cod aside it was a pleasant meal (though I wonder why we were offered garlic chilli paste as a chilli dipping sauce) and good value.  The ambience of the place suits a venue to impress because of the all round adequacies but there are better tasting Chinese plates around London.",
                "datePublished": "2015-04-16"
            },
            {
                "reviewId": "1n-Ft8VK3KNXFiA-UkPZVg",
                "author": "Susie N.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Fine food, excellent service!   Everything we ordered was tasty.  You cannot go wrong with anything on the menu!",
                "datePublished": "2016-06-18"
            },
            {
                "reviewId": "FrwMWbVlDuCqGxSAZx_Bpg",
                "author": "Geoff C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Hello London, good to see you it's been awhile.  Slip into Hakkasan for my first meal of the visit...HELLLLO London, I like your style.\nThere are two ways to look at Hakkasan.  The first could be your cynical side, observing Hakkasan is basic dim sum and chinese fare prepared exquisitely well.  Could I reconstruct the tastes at 1/5 of the price in LA via an afternoon crawl across the San Gabriel Valley?  Of course.\nBut, much like people, there is something to be said about a restaurant that knows what it wants to be, and has a personality to back it up.  Huge diversity, perfect drinks, and good service make it an easy recommend.\nI have learned very few lessons in life other than the most essential (Always bet on black, never fight a land war in Asia) but a 3rd Hakkasan has confirmed is 'When confronted by Ostrich on a menu...order every damn time\".  It never fails, their version is an amazing balance of heat, sweet, and saltiness over rice.",
                "datePublished": "2012-04-18"
            }
        ]
    },
    "60": {
        "id": "ILyOYUjoKsLmPPlabPnTLQ",
        "name": "Hakkasan",
        "category": "chinese",
        "servesCuisine": "Cantonese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Fitzrovia",
            "streetAddress": "8 Hanway Place\nLondon W1T 1HD\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nyOKqfVgMGswPqwN1VrkBQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7927 7000",
        "review": [
            {
                "reviewId": "_fbGGQ3I2VPGYKq6HOBChw",
                "author": "Prakruthi G.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Don't even bother going here if you are allergic to anything. They do not make any effort to accommodate any allergies.  Extremely disappointing experience. Terrible service. I wouldn't recommend this place to anyone.",
                "datePublished": "2016-02-28"
            },
            {
                "reviewId": "6VmGjRNwV9WqCvJ8isLZdQ",
                "author": "Manuel L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Expensive but it is worth it!\nNot your Restaurant for a casual dinner in the evening.\nBut if you have planned something special, this is the place to be. Beautiful interior design. Great Atmosphere. And the food is excellent.\nThe Dumplings as a stater are a must have!\nCocktails are awesome and dont let me start on the dessert. Exceptional!\nThe Service is very .. lets say frequent. It gets a bit annoying over time. But they are very friendly\nOf course its very expensive but its well worth thw money. We paid 120 pounds for 2 people with shared starter and shared dessert. Plus 2 cocktails and Water.\nBut if you want to have a special dinnrr with somebody. Hakkasan is a good spot.",
                "datePublished": "2014-12-01"
            },
            {
                "reviewId": "6P02ccDaXWeHtMw-0zlywg",
                "author": "Jo H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "There is a reason this place is always packed and that is great food and equally great ambiance.  Try one of the fresh juices with a shot of vodka if you drink.  The vegetable dumplings are divine and, lastly, the service is wonderful and elegant even under pressure.",
                "datePublished": "2016-01-01"
            },
            {
                "reviewId": "mzHhO1VItz5cGVDvQc_fow",
                "author": "Vincent L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I was taken here recently, specifically to be \"impressed,\" and Hakkasan is very much a place to see and be seen. It's tucked away in a subterranean space on a small side street, but once you get inside, it's overwhelming for the senses, with ultramodern décor and a loud, lively lounge atmosphere. \nI tried a number of plates, including the dim sum platter, the stir-fry black pepper beef, and the sweet and sour pork. All were of reasonably high quality and presented gorgeously, if a bit small in size. The drinks were exceptionally strong. Even though I spread out 2 cocktails over 6 shared plates, I still stumbled dizzily up the steps and onto the street as we left later that evening. \nI hate being a party pooper, but it wasn't necessarily the best Chinese I've had - and I'm of Chinese descent to begin with. It was simply very good. I guess stylish décor, attention to detail, and reasonable food quality is all it takes to dress up otherwise conventional Chinese food into a Michelin star and command a truly spectacular price premium.\nIn the end, I enjoyed the overall experience, although I must stress that I'm by no means a high-maintenance person when it comes to being \"impressed.\" ;) All in all, if you're ready to pay a pretty penny, then it's not a bad choice for a special night out or to celebrate with friends.",
                "datePublished": "2012-06-07"
            },
            {
                "reviewId": "ciLnEpouhZNUvQKAsfRfFw",
                "author": "Agneta N.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "We went to Hakkasan for a birthday brunch. The restaurant has lauched Dim Sum Sundays where you get to choose between two different menus. One with and one without champagne. Six courses, couple of drinks, champagne and dessert. For a very good price. \nThe first course, a crispy duck salad was simply amazing. I still dream about it! It was followed by dumplings, dim sum, rolls, a main course, a small snack, and it was all very very good.\nThe staff was very attentive, the food was excellent, we had some amazing drinks and a lot of champage. All included in the menu we went for. \nThere was a DJ playing, and the restaurant was packed, but even though it was packed, you got all the attention you could expect from the staff. We had a very good time, and I will defiitly go back!",
                "datePublished": "2013-10-23"
            },
            {
                "reviewId": "shIWTw-tlzO0x_DF926B6w",
                "author": "Lloyd M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A meal I truly enjoyed but it could of gotten anywhere from three to five stars.  First, the issue some other Yelpers complained about, \"bouncers\" outside has been resolved.  Rather than anyone intimidating, a very nice women met us outside and checked our reservation, as well as making sure the staff downstairs was prepared for us.\nIn terms of the meal itself, again I can see how it could anything from three to five stars.  The menu is fantastic.  Probably twenty, twenty-five dishes I wish I could of ordered.  The problem was there definitely was inconsistency.  Some food was wow, this is what I expect from a top London restaurants.  Others were weaker than what you would get at a local Chinese restaurant.  Started with the Dim Sum platter, which was interesting, but flavor and complexity did not stand up to the top Dim Sum around Leicester Square.  The appetizers that jumped out were duck rolls (spring rolls filled with duck) and the ribs, which had a great caramelized exterior.  Both of those clearly five stars.\nI was with four other people so we were able to sample multiple entrees.  I had Pipa Duck, effectively peking duck without the pancakes.  It was perfectly prepared and everyone who tried it loved it.  Also stand out was a black beef dish.  On the other hand sweet and sour berkshire pork had no more flavor or complexity than I would expect in an airport and was left half eaten).  Dessert was also good but not memorable.\nService was definitely five stars, friendly, attentive, but not overpowering.  Atmosphere is fantastic either for a business dinner or date.\nOverall a great experience but the food should have been more consistent.",
                "datePublished": "2011-11-18"
            },
            {
                "reviewId": "rt8nDANmxx4T3p5iBl8J1Q",
                "author": "Stephanie D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "So the whole entrance experience is pretty amazing - I felt like I was entering a James Bond villian's lair. Scary looking bouncer at the front checked the reservations list before letting us go down to the mysterious, dark-stoned lobby, where we were greeted by a clique of model-esque hostesses in hot pink dresses.\nThe restaurant is huge by London standards, very spacious with beautiful, modern Oriental style carved wood panels.\nWe had the Taste of Hakkasan set menu deal which was fantastic value. The miso cod was delicious as was the Rice Krispie dessert with pop rocks (!). The cocktails were also very tasty.\nThis place is just a shade away from being a bit too pretentious and overpriced - but I can thankfully report that the service, food and atmosphere were all great.",
                "datePublished": "2014-08-29"
            },
            {
                "reviewId": "QJSTbBW5lS8mErJs3x8kRw",
                "author": "Alex A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I can't fault this place. \nGreat Food - great service and a beautifully contradictory space. \nThe only down side is most people need to take out a loan to eat here.  If you can - experience it!",
                "datePublished": "2014-08-12"
            },
            {
                "reviewId": "nFLnPgWFU0FAc-kAHvrz1Q",
                "author": "M Ari M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "My birthday fell on the Chinese New Year this year (well, at least on London's celebration of the fact) and we decided to embrace the theme. Accordingly, we booked Hakkasan for lunch and its sibling, Yauatcha, for dinner.\nI didn't know much about Hakkasan, but man, were we pleasantly surprised.\nOk, first things first, this is definitely toned-down Chinese. But it's classy toned-down Chinese, and if you just embrace the fact that you're eating upscale fusion food, you'll be fine.\nThe décor is really pleasant: it's sort of a cheeky take on a traditional tea house, with cut wood dividers and little dabs of tat. It's dimly lit and just modern enough, without being so chic that you feel alienated. There's a DJ spinning pleasant background mood music right in the centre of the central wing (there are three, and I believe a few private rooms), and a full bar.\nDrinks: really good, balanced, and as described in the menu.\nFood: solid, and set at an appropriate price point for quality/quantity. But don't get the pumpkin tofu; it was a massive disappointment.\nService: spotty, but not for wont of trying. The place was packed, there were lion dancers weaving in and out, and you got the distinct impression that it wasn't normally this chaotic. There were two slips in the service (the wrong drink, and the aforementioned tofu arrived around the time we were ordering dessert) but the staff were trained to the calibre you'd expect for this level of establishment, polite, unobtrusive, smiley. Great overall.\nAs a bonus, the dessert here wasn't an afterthought, and the tea menu was delightful. I have a soft spot for places which actually brew my tea well and yes, Hakkasan, you did just that.\nI do wish that the flavour profiles stuck a bit closer to their roots, and that's the only reason Hakkasan misses out on its 5th star. Aside from one fried nibble with dried scallop inside, and some very very mild preserved duck egg in another, I found things just a bit lacking in the flavour department overall.",
                "datePublished": "2014-02-09"
            },
            {
                "reviewId": "gMxPlt8Db1Ac4pnhZ0JRAQ",
                "author": "John G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Expensive but definitely the real deal with great portion sizes! \nThe service is spot on, continually topped up and eager to keep our table tidy and presentable.\nDefinitely going back for the great atmosphere and selection of food.",
                "datePublished": "2014-12-19"
            },
            {
                "reviewId": "Kho-SWOb_tIrtnwJb873Ew",
                "author": "Dave S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is by far London's trendiest place for Chinese. Walk past the bouncers and down the stairs into a decadent dimly lit lounge. It's definitely a hot scene so be sure to dress the part!\nUsually places like Hakkasan are more about the vibe and B-list celebrity spotting than the food, however, that is so not the case here. I went to Hakkasan last month for a friend's birthday. We had an elaborate tasting menu, which annoyingly had to be vegetarian, but was still quite the feast. \nOne tip, if you do the vegetarian tasting menu---some fake meats are clearly better than others. The black pepper vegetarian chicken and surprisingly the fake pork (or what tasted like vegetarian pork) were divine. I never had such tasty vegetarian food, seriously and I've been to Saf! The fake shrimp on the other hand had a less desirable gelatin texture though the sauce was great for my rice.\nFor drinks, the cocktail and sake menu is extensive. There is a fantastic and slightly eclectic range of house martinis---get the cucumber saketini. \nThis isn't a proper review unless I also describe the toilets, and specifically the tiny woman who guards the door to the facilities. She is as diminutive as the door is massive. I'm still not sure how she can sense when you have left the toilets and how she musters the strength to open the insanely heavy door. Bizarre comment, I know, but check it out yourself! Everyone who went to the toilets commented about the WC attendant.\nIn summary, if you are in the mood for some tasty and very very scene-y Chinese look no further than Hakkasan.",
                "datePublished": "2011-06-21"
            },
            {
                "reviewId": "CeP_XEQuGM1_GCy-8W-hCw",
                "author": "Cailin M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Amazing dim sum and consistent quality between locations.\nCocktails are delicious -- recommend the mandarin mojito!",
                "datePublished": "2014-03-23"
            },
            {
                "reviewId": "ucUxC_uSTgOzNwrjuCIP2A",
                "author": "Sylvanna Y.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Came here for over-priced dimsum and mainly to see what's the fuss is about. The restaurant is located in a sort-of alleyway hidden somewhere behind Tottenham Court Road which was a little difficult to find at first. \nWhen we got there, there was the scent of joss-sticks which is nostalgic of the wrong sort. It reminded me of Chinese temples or the altar room I had back in my home. Having this scent permeate a Michelin-starred restaurant was quite odd and the dark and dim lighting reminded me of the time when I visited Abercrombie and Fitch sans the loud music.\nGood service was expected of a Michelin-starred restaurant, so at first impression they were doing OK, then I started finding flaws later on. Our coats were collected before we were seated but before we were even sat, my friend noted that one of the waiters gave her and us a once-over. How rude! I know we weren't dressed up posh but it's not like we came from the slums either. Nevertheless, his attitude was quite off-putting. \nChoices of dimsum were severely limited. Despite this, the food that we ordered were good and well made. We enjoyed the standard selection of har gau, siu mai, etc. but it was quite disappointing that we were made to share when the dishes came in either 3 or 4 pieces per dish. The waiter could've told us this when we ordered or made exceptions so all of us could happily have one each. Perhaps I am expecting too much but 13% for service (0.5% more than the standard 12.5%)??\nOverall, the food was good but the service was meh. I expected more out of a posh restaurant because that's one of the key points (besides the food) that sets it apart from the normal non-starred ones. \nHonestly, for the service, I can get better elsewhere. (even normal-posh Chinese restaurants overseas have way better service... with better lighting as well).",
                "datePublished": "2013-05-22"
            },
            {
                "reviewId": "cLExqrNmikSuMH8ZHBmAAQ",
                "author": "Olivia L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I always enjoy the food but it comes at a premium due to the name. It starts with white tea priced at £7.40 more than a cocktail in most places. The nice thing is that it's great for an extended lunch as you can order more dishes as you go and they are never in a hurry to get you out the door. The dim sum platter is great to share and leave room for the chocolate ganache desert.",
                "datePublished": "2015-02-21"
            },
            {
                "reviewId": "IToO7qp_xR2lFNkdeak2ng",
                "author": "Emily F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I came here with my parents while living in London and have been to several other locations since.  This was one of my favorite dining experiences ever.  The decor is very trendy, all with dark wood but due to lights over each table, there are no problems reading the menu to experiencing the food.  The duck salad is one of the best things that I have ever eaten, and the dim sum was pretty fantastic as well.\nOverall, this place blew my expectations away compared to what I thought an 'Asian Fusion' place would be like.  The food was amazing, drinks were good and strong, and desserts were unique and very good as well.  While a meal here does come with a hefty price tag, I felt like it was somewhat justified by the quality of our experience.",
                "datePublished": "2013-09-24"
            },
            {
                "reviewId": "EU69DwhJ_4DokQ6QY8llEQ",
                "author": "Agnes L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "It was difficult for me and my husband to justify paying as much as we did for Chinese food, when we are so used to getting the real deal in Chicago's Chinatown (and for free from our friends back in Detroit) for the past five or so years. However, the innovative cocktails menu, the high quality of the ingredients in the dishes and the posh vibe made up for some of this hesitation.\nWe were pleased to see not only the long list of options for drinks but also very unique combinations of flavors, so we ended up splurging by ordering two each and sipping on each other's.\nMy husband, fellow Yelper Eliter Michal, has an obsession for cocktails with egg white. The U.S. mostly shies away from using it except with the New Orleans Ramos Gin Fizz. However, at Hakkasan there were at least four or five options that had egg white. He got one with a \"jasmine egg white foam\" that had pomegranate. Afterward, he went with a whiskey drink for contrast - \"Smoky Negroni.\" \nI got a not-too sweet but very zippy martini called the Thea and was happy to see it was mixed with one of our fav Polish vodkas (Michal grew up in Poland!) - a hard-to-get bison grass variety. With a blend of sharp ginger, slighty sweet yet tart apple and lime juices, this drink was smooth yet strong. My second was a very refreshing Kumquat Mojito, a fruit I rarely see and never with mint and rum. I'm grateful for our server's suggestions!\nNow for a quick run-down on what we ate: We decided to forego the preset menu because all the dishes looked too familiar yet too expensive to us. Instead, we opted to do family-style sharing/tapas-style with all appetizers (in order of what we liked best to least).\n*Crispy duck salad- Props to our server for suggesting this, as it was our fav dish of the night. Duck has always been my fav protein and Chinese preparation (usually Peking BBQ) is my jam. I enjoyed these tiny fried morsels mixed with bright microgreens, which was just the perfect fresh complement to this decadent meat.\n*Soft shell crab - amazingly tasty with right amount of crispies and seasoning, devoured quickly with hit of spice from red chili flake and curry leaf\n*Turbot soup with mushroom (AKA wild fungus and goji berry) - flavorful broth with wild mushrooms not used to seeing.\n*Fried aubergine (eggplant) and mushroom - surprised at how crispy yet light these were! A bit larger of a portion than needed though.\n*Dim Sum Platter of shumai and dumplings (one with lobster, another with caviar/scallop/shrimp, another with crab and chives) - seems overpriced until you consider the filling but this one was not worth it to me because I'd rather just eat the filling if I'm paying that much.\nFor dessert, I was excited to see calamansi as that lime-like fruit reminds me of Filipino food, so we got the calamansi and chocolate ganache. It wasn't too sweet with the perfect balance of tart and rich, but it also was not too heavy or big to end the night.\nUltimately, go for drinks and a few apps to share for a special night out that won't break the bank (too much).",
                "datePublished": "2014-11-30"
            },
            {
                "reviewId": "0Qn15jsZLUBfAZxLPxzkbQ",
                "author": "Jean K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I was secretly hoping to go to Hakkasan for a meal, so I while we were shopping at MUJI nearby I dragged hubby in here for a light dinner.  This is one of my all time favorite restaurants in London and I recommend Hakkasan to anyone who asks.\nSuper classy sexy place.  I liked the idea of the \"list\" and bouncer upstairs at the entrance.  Gives a feeling of exclusivity.  Of course we didn't have reservations  :-(.  But they just called down and it was no problem.  And they didn't seem fazed by the fact that we weren't dressed up at all (jeans, boots) and were loaded down with shopping bags.  When we got down the stairs they were expecting us, and took our jackets and seated us right away.  I liked the service was snappy.  \nAlthough Hakkasan can be expensive, it doesn't have to be.  I might have mentioned this in my initial review but the dishes range from under £20 to over £30.  And there's plenty of choice throughout the entire price range.  Since we weren't that hungry we ordered the shanghai dumplings, dimsum platter and mapo tofu.  They also have an extensive cocktail menu.  Though not cheap at £10 each, they are incredibly good.  Real cocktails, not just cosmopolitans.\nThe shanghai dumplings were good but not as good as I've had living in SF.  I remember the dimsum platter being amazing, and while still good I think I've had more experience with high end dimsum.  I still think it's the best I've ever had but the comparison gap wasn't as large.  The map tofu was made with beef and it was amazing.  We were already full after the 2 starters but just couldn't stop eating the the tofu!  \nTotal meal was less than £50 for 2 starters, main, cocktail and tip.\nFunny story about their obsession (good) with appearances, when tipping for the coat check we noticed that the dish had 3 pound coins arranged in it.  We added one more and received our coats to put on.  When we turn around they've removed one of the coins so there are only 3 again.  Only someone obsessed with design and aesthetics would ask the staff to do it.",
                "datePublished": "2011-01-07"
            },
            {
                "reviewId": "GZa_9w-xbqpis2vjFcmnkw",
                "author": "Ninad S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Love this place. Cool Asian fusion. Upscale ambience. Get the multi-course option. You won't be disappointed.",
                "datePublished": "2015-03-20"
            },
            {
                "reviewId": "6msx2IklN4FiZ7pjFkpeiQ",
                "author": "Heleen B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Really love this place! The food is so tasty, just great. Recently I went here 2 times in one week. Both time we had the menu taste of Hakassan with a perfect cocktail. Expansive but worth it.",
                "datePublished": "2015-05-15"
            },
            {
                "reviewId": "6AuGsahaz7WKZyvMf4EnIw",
                "author": "Fred P.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Just returned from this restaurant.  This is a fun upscale place with mostly quite good Chinese food.  Close to 200 pounds for a rather light meal for 3.  We ordered drinks and food.  Was slightly taken aback when soup and appetizers arrived before our cocktails--but didn't think much of till our mains arrived before the rest of the appetizers and grew cold before we got to them. The dim sum plate was above average and very pretty to look at. The taste was good, but no where near as good as you'd find at a place catering to a primarily Chinese clientele.  The reviewer who said the har gau were the best ever has probably not eaten many. The cocktails were quite sweet even tho the waitress had told us they weren't.  The duck salad was very good;  the sweet and sour Berkshire pork was so-so: the pork not crispy an the accompaniment heavy on the onions with a few bell peppers.\nWhen we finished they offered us dessert.  We chose some tea and while we were drinking it, we were asked to vacate the table-another party was waiting for it and there was a 2 hour limit!  So that was the reason for the slapdash service--they wanted to turn our table.  When I complained to the manager he said this was a policy of the restaurant, that we had been informed of when making the reservation (I didn't make so perhaps) and that we'd been called to remind us of that (an absolute lie).  The crucial point is that at no point when in premises were we informed of this and we were offered tea and dessert when we didn't have time to drink it.  Also,  I couldn't help but notice that many of the people seated near us had been there when we arrived and didn't seem to be under a curfew.  The manager did English Officiousness very well; giving a sh-t, not well at all.  As much as I enjoyed the classy, fun atmosphere and some of the food,  I would never go back.  Food 3.5.  Atmosphere 5.  Management 0.",
                "datePublished": "2016-05-13"
            }
        ]
    },
    "80": {
        "id": "ILyOYUjoKsLmPPlabPnTLQ",
        "name": "Hakkasan",
        "category": "chinese",
        "servesCuisine": "Cantonese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Fitzrovia",
            "streetAddress": "8 Hanway Place\nLondon W1T 1HD\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nyOKqfVgMGswPqwN1VrkBQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7927 7000",
        "review": [
            {
                "reviewId": "EEv6G355rz0PY8a6mxvr3g",
                "author": "Alexander H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Been several times over the last 10 years and the quality of food has not gone down despite the global expansion. It is a bit over - priced but with a good bar and innovative food great to impress a date or if someone else is paying.",
                "datePublished": "2015-03-19"
            },
            {
                "reviewId": "uBD0JnodmaFoUUnbKiPAkw",
                "author": "Taylor B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Excellent food. Excellent atmosphere. Excellent service.\nThe tasting menus are very good, with a great variety of foods all with high quality. The dim sum is great, the ribs and peppered steak is juicy and has great flavor, and the prawns are outstanding. The desserts are good, but not exceptional. The very cool atmosphere is the icing on the cake. Highly recommended.",
                "datePublished": "2015-02-08"
            },
            {
                "reviewId": "s0itz2bFBY9470W8s5QrUA",
                "author": "Steffi O.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place is beyond amazing. I've been many times over the last few years and still love it. Try the crispy duck salad. They have a dinner special now - 35 pounds for three courses, which is a good deal as it's quite a pricey restaurant.",
                "datePublished": "2015-03-27"
            },
            {
                "reviewId": "A4D0kjrm4PzQ0nZclSUTqg",
                "author": "Matt E.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I'll be brief: The best customer service I've received in a long time, and probably in my top 5 dining experiences ever. I was never left wanting for anything, the staff was incredibly knowledgeable about every menu item, and plates were brought in and taken away in a completely unobtrusive manner. These people are professionals of the upmost degree, and hats off to them.\nThe food was excellent. We shared some 4 small plates and entrees, plus a noodle dish and some excellent vegetables. I'd say the highlights for me were the small plates, particularly the salt and pepper squid and the dim sum platter (i'm looking at you little scallop and prawn wrap of tastiness) Unfortunately, it was still Chinese, and despite spending some $400 American on a meal, we were still hungry a few hours later and ended up at a Burger King. \nI can't say i'd come back unless I was once again invited as a guest,  as this place is definitely WAY out of my price range. Still, I feel incredibly fortunate to have had a chance to experience this meal.",
                "datePublished": "2010-07-24"
            },
            {
                "reviewId": "IG6a2oT3pUn1OS_WQiQqgw",
                "author": "Dan G.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "In a word, awkward. There is no other way to describe it. Was it that I was checked in for a near empty restaurant in the alley entrance? Was it that someone's job was to just open the bathroom door? Or that people seemed to be lingering around you at all times, just odd. \nI had no idea what I was doing with this menu and the waitress was little help. If you offer your help with the menu, I'd expect that you, well help. We began with salt and pepper squid and the dim sum sampler. The dim sum was the better of the two. My wife had the sea bass for her main and I had the Mongolian stir fry venison. I liked the venison a lot, but wish it had more veggies. They also do not have brown rice and they don't even include rice with your mains, which seems really nickel and dime. Good thing the food was great. Call that a 4 and the service a 2. On the plus side there is an impressive bourbon selection that included options you can't find in the states, Maker's black label anyone?",
                "datePublished": "2010-03-11"
            },
            {
                "reviewId": "hgrFUbImFweumVS1lnVNsg",
                "author": "Miles L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Simply superb. Portions are not pretentious, food is exquisite and service is impeccable.",
                "datePublished": "2015-03-24"
            },
            {
                "reviewId": "LVD_HX6hu0Z77ZoCHBzAyQ",
                "author": "Jen Z.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This review is for the dim sum.\nBest kept Dim Sum secret.  Cost?  Pretty much the same range as any other dim sum place in London...a small premium.  Quality?  10x better than any other dim sum place in London.  What's that you say?  You thought Hakkasan was for the filthy rich?  Not authentic enough?  Wrong \nI admit that I had my doubts.  A look at their dinner menu posted outside made me scream a little in my head.... tricked into another overpriced Chinese restaurant in London.  Puh.  Well, that may be the case for the dinner menu, but the dim sum menu is very reasonably priced.  For two people, the cost came out to be the same as Royal China except everything about the Hakkasan dim sum experience outshone any other dim sum place I've been to in London (and we were stuffed for the rest of the day).  So let's talk about the food.\nThe menu is a combination of traditional dim sum plates and a few plates with a unique spin.  We had a go with both types, and were pleasantly surprised with all.  Generally speaking, every dish was good and very well executed both in taste and texture.  However, four things really stood out to me:\n1.  Chang Fen with Beef Flank - I can't recommend this dish enough.  My boyfriend nearly devoured the whole thing, and I was trying to fight him for it.  Hakkasan have taken a little spin on the original Chang Fen idea, and topped off the Chang Fen with...well, basically a version of Cantonese Beef Stew.  Who would have thought to put the two together?  The Chang Fen itself is phenomenal.  PERFECT texture----slippery and soft, but firm enough to not break apart when you pick it up with chopsticks (No other dim sum place around London has seemed to master the texture of Chang Fen.... most of the time, it's overly soft).\n2.  Shanghai dumplings - do not get this.  It is basically just pot stickers.  I thought it would be real Shanghai dumplings, which is one of my favourite dim sum plates.  Remember that Shanghai dumplings should always be steamed, filled only with meat (NO VEGGIES), and so juicy that when you first bite into it, you get burnt by the hot juice splattering across your chin.  If a Shanghai dumpling does meet these requirements, then it is not a true Shanghai dumpling.\n3.  The dessert menu had White fungus & pear soup.  Surprise!!  Don't be put off by the white fungus description!  This soup brings back home for me as my mother used to make it in the summer time.  You can drink it cold (the way I like it) or hot, and it's just a really smooth, not overly sweet, dessert to have at the end of a meal.\n4.  Tea.  I probably drink more than a litre of tea a day if I'm at home.  And all Chinese teas I stock up on from trips to China.  Hakkasan actually have a fairly good tea menu with some pretty traditional teas that you don't normally find in other Chinese restaurants.  Pu-er cha for instance and Tie Guan Yin (which we had, and was very good!!!).  \nI am definitely coming back here.  I am not even sure I would give any other dim sum place in London a chance again.  It's worth the tiny 5 pound premium.  The quality of the food is just amazing, and really under-priced in London terms.",
                "datePublished": "2011-12-15"
            },
            {
                "reviewId": "Jb4bp436jbRyqN7r23KmCQ",
                "author": "Kristy D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Dim Sum Sampler was amazing and so was the sea bass.  I will definitely be going to one of their other locations once I return to the US.  The desserts were especially amazing.  Food is like art here.",
                "datePublished": "2014-04-02"
            },
            {
                "reviewId": "3XHor99Sxuhbzzi4zBPkFw",
                "author": "Kathleen C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great service. Order the lamb salad. Truly memorable, although I'm not sure why they call it a salad. The Pipa Duck is also marvelous.",
                "datePublished": "2014-12-15"
            },
            {
                "reviewId": "BJGLoIEuePGwnslD0OimjA",
                "author": "Steph C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Dim sum is one thing that can be done very well for reasonably cheap, so I entered Hakkasan's luxurious space afraid we would be shelling out for the chic flower arrangements, the lush seating, and the seductive ambience.  My fears found themselves unfounded - yes, Hakkasan presented its food with impressive, elegant trappings, but these were just a gorgeous frame worthy of presenting the attractive and phenomenally delicious dim sum.\nI'm going to get two brief complaints out of the way first.  1.  No pictures allowed, and that's company policy.  2.  Our waitress seemed a bit impatient at first, as we were first-timers who didn't necessarily know how much to order or how this new-fangled cartless dim sum worked.  She answered our questions, but seemed a little surly about it.  She did warm up to us quickly, though, and service was generally unproblematic and even friendly at times.\nNow, the food.  We were presented with a la carte and dim sum menus, and went all dim sum, with one order of vegetarian dim sum from the a la carte menu.  We started with this vegetarian dim sum platter, which came with two pieces each of crystal dumpling, vegetable shumai, yam bean and shiitake dumpling, and vegetable beancurd roll.  We proceeded with the steamed king crab noodle wrap, the chinese chive dumpling with prawn and crabmeat, the seafood dumpling consomme, the scallop shumai with tobiko caviar, the char sui bun, and an order of the Singapore vermicelli with prawn and squid.\nEach dim sum order came in its own little bamboo container or ceramic bowl, and everything looked beautiful - dumpling skins in deep honeydew green, glistening scallop topped with jewel-like tobiko, burgundy pork peeking out of white clouds bursting quietly at the seams...the presentation was a cut above any dim sum I'd ever seen before.\nIncredibly, it tasted even better.  Every last bit of dim sum was cooked gently to unveil bold flavors and toothsome textures.  The dumpling skins were impossibly good, the consomme soothing and deeply aromatic, the Singapore noodles fluffy and wonderful laced with firm bits of seafood.  Not one bite fell short of eye-opening, and Hakkasan unlocked a new level of dim sum in my culinary universe.\n \nWe should have stopped there, but curiosity got the better of us and we tried the tapioca pearl pudding, which came with little snatches of vanilla panna cotta, poached banana, passion fruit sorbet, and caramel popcorn.  I prefer the humbler version of this dessert offered at lower-end dim sum places.  This one tried too hard and the result was a messy hodge-podge of clashing and cluttering flavors.  The rest of the meal was so delightful that I'm going to forget this final bit ever happened.\nHakkasan was a revelation.  In one meal - and a lunch, at that - I obtained a new lens by which to judge dim sum.  My experience wasn't perfect, but the core of it was, and it is upsetting that I can't go back and repeat it any time soon.\nAlso, the bathrooms are REALLY COOL.",
                "datePublished": "2009-08-28"
            },
            {
                "reviewId": "05gKTkHBzjvNde6T985TNw",
                "author": "Nicolai K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The food is awesome and it has a great ambiance. The drink menu works as well with the food as vine. No matter which way you go you need to try the Hakkan. Best drink I had all year!",
                "datePublished": "2013-10-29"
            },
            {
                "reviewId": "aaqXwULuLloY7XUJz4lmTg",
                "author": "Eduardo M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Tried dim sum for forst time in my life here. I am not much of a person who likes to experiment, but was dragged in here by a group of friends.\nLiked the place very much, liked the dim sum very much also.",
                "datePublished": "2013-02-07"
            },
            {
                "reviewId": "SWMsBJ1NbNPUZ8VT0psi9g",
                "author": "Jeff M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Hakkasan has an atmosphere and decor that any celebrity would love to be caught in. I thought I may have accidentally wondered into Buddakhan. The woodwork in the dining room is unbelievable. If you have read any of my other reviews you could guess that this is not my type of restaurant. \nDim Sum starter was ok but took about five minutes to cool down enough to put in my mouth. Crispy duck rolls somehow managed to not be greasy without being dry. However they were bland and needed the sauce served with them. Sha cha seafood toban was bit uninspired. \nI'd never come back here.",
                "datePublished": "2011-03-05"
            },
            {
                "reviewId": "sXgBssME394e2vGAjf6piA",
                "author": "Ying L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I was positively surprised to find the setting, the food quality and variety are better than what I expected.  Of course, there is a price tag for this.  Avg nearly $80 person after currency conversion, without any alcohol.  \nThree downsides:\n-no high chair for kid, so not suitable for toddlers\n-no designated servant, it feels like everyone serves every table.  So some request may be lost \n-no leftover take-out: we first under ordered and then over-ordered.  At the time we get the check, we were told that there is no left-over takeout.  So be careful when you order",
                "datePublished": "2013-05-27"
            },
            {
                "reviewId": "G7e8Edkr8zKCpBGXgMT-Vg",
                "author": "cynthia w.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "We really didn't like Hakkasan.  It definitely has an interesting ambiance, but the food and cocktails weren't up to par. This is a see and be seen kind \nof place so don't expect great things from the food like we did based off all the glowing reviews.  We left after the starters.",
                "datePublished": "2011-07-05"
            },
            {
                "reviewId": "XpwcuNVsco5bcsJd3DcP0Q",
                "author": "Patrik D.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "What about this place? I have been at alot of fusion asian places espacially in N.Y like Buddhakan, Tao etc, i love asian fusion restaurants and food.\nStrange bouncers at the entrance(more night club style)-not good feeling\nCloset-very proffesionel\nToilet-boring, nothing special, why dont put some effort to decor?\nNow i had looked forward to this place and food, heard alot of great reviws. The food was total out of flavour, it was so bad everything from starter to main courses, dessert was ok. \nDrinks was also bad.\nPrices where ok, but comparing whit the bad food it was very high\nSorry to say but a big misstake go to Hakkasan",
                "datePublished": "2011-09-15"
            },
            {
                "reviewId": "eW4uuEY9ocigijkN42hEaA",
                "author": "Fred G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Last summer, I reviewed the Hakkasan restaurant located at the Fontainebleau Hotel in Miami. I absolutely loved their food so it only seemed logical during my recent my week-end in London to have dinner at one of their London locations which, in my case, happened to be the Hanway Place one.\nUpon arrival, I was pleasantly surprised with the fact that the restaurant was almost identical to its sister location in Miami for the setting there is absolutely stunning. I had their Dim-Sum platter which were tender and perfect.\nThe Dim-Sum platter tenderness was matched by their Wagyu beef which was a delicacy that I really enjoyed.\nAll in all, I had a very good dinner although I hated the fact that I felt we were being rushed out after the main course as our waiter told us that our table had to be cleared for their next customers and that since we had gotten there ten minutes late, they could not allow us to have dessert. I, then, argued that hadn't they had directed us to the bar and left us there for a good 25 minutes after our arrival, we wouldn't have had to order dessert so late. Finally, the restaurant manager \"agreed\" to let us order dessert which we did.\nAll in all, I had a great experience food wise but the aforementioned \"dessert incident\" is the kind of things that can absolutely spoil an otherwise perfect dinner. I understand that this restaurant seems to be always full but how can anyone in their right mind tell their customers they can't order dessert?\nOne last detail: as this restaurant is located beneath ground level, there is no cellular signal whatsoever anywhere inside.\nOne last detail: as this restaurant is located beneath ground level, there is no cellular signal whatsoever anywhere inside.",
                "datePublished": "2011-11-15"
            },
            {
                "reviewId": "So4HqN9ame99U85L1gRuuQ",
                "author": "Qype User\n davidr…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I was there several times with friends of mine.We enjoy our meals every time.They are very good at cooking one of the tastiest dishes ever.You should try the duck meat,for sure:)\nIf you are going there for the first time-be prepared that the atmosphere is kind of unusual.For me,personally,the atmosphere when I step inside was like I am entering a night club.May be this was an effect of the dramatic dark wooden decor. But when you get used to it..you will enjoy it :)",
                "datePublished": "2012-10-14"
            },
            {
                "reviewId": "A42ixMJ1HYQXdhHX_1F-pw",
                "author": "Paul M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Delicious food, great atmosphere and very professional staff.  The dim sum is ridiculously good...  Highly recommended.",
                "datePublished": "2015-08-29"
            },
            {
                "reviewId": "CgjFSaSiGg1PDCaLG3l1aw",
                "author": "Jesse K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I went there for New Year's Eve with 5 other friends. Everyone was truly satisfied with the food. I had the Pipa duck... Brilliant. The service and the atmosphere are also two things that bring this restaurant close to perfection.",
                "datePublished": "2014-06-29"
            }
        ]
    },
    "100": {
        "id": "ILyOYUjoKsLmPPlabPnTLQ",
        "name": "Hakkasan",
        "category": "chinese",
        "servesCuisine": "Cantonese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Fitzrovia",
            "streetAddress": "8 Hanway Place\nLondon W1T 1HD\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nyOKqfVgMGswPqwN1VrkBQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7927 7000",
        "review": [
            {
                "reviewId": "PyjTm6x1EOqLdrEiGaGabA",
                "author": "Charles H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This was my first time at this restaurant. Overall, the decor was fabulous - one of the coolest spaces I've seen in a long town. \nI don't live in London - I live in San Francisco. But overall, I thought the food was very good. I had the corn and crab soup and the roasted chicken satay. Overall, I thought all of the other dishes we had (lamb salad, tofu, double cooked pork) were all very strong as well.\nThis place is fairly pricey, so I'd give it a 4 out of 5 stars. Great ambiance, very good (but not outstanding) food. Great for out-of-towners like me.",
                "datePublished": "2010-11-09"
            },
            {
                "reviewId": "gYWkUti4_tmxWWKP4ubmww",
                "author": "Stephen W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A special dinner place - the food is upscale Chinese, and very tasty. I tried the salt and pepper squid, Fresh Water prawns (spicy and great) as well as some pork and chicken dishes. The real star here is the bar. I have never seen so much elaborate care taken to make a martini - careful attention to ingredients - misting the vermouth, entertaining just to watch. Good whisky selection as well.\nVery hard to find without a cab driver's knowledge!",
                "datePublished": "2011-01-17"
            },
            {
                "reviewId": "TxjnyLpiCqvbKx98Q1Ebog",
                "author": "Kristin C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I was on a business trip to London in late March/early April that coincided with my 30th birthday.  My ex-pat cousins invited a couple friends and fashioned a nice, little, away from home, celebratory gathering for me at Hakkasan.\nI'm not quite sure how my cousin found Hakkasan (She'd been once before, I think).  It's nestled in a corner down a handful of streets to tiny that in NYC (where I'm from), we'd call them alleys.  From the outside, you can tell it's perilously hip.  The clues are the lighting (yes, even from outside) and the bouncer-type folks at the door.\nWe were greeted once inside and invited to the bar for a drink while waiting for our reservation/table that was almost ready.  There's a coat check right there (always appreciated in the London weather).  The interior is darkly lit (but menus and such are still clearly visible), larger than one would ever expect (and very well populated), and still quite hip.\nThe bar service was quick and efficient and my prosecco was quite tasty.  Only a few minutes later, our table was ready and we moved with our drinks to sit.\nThe menu is quite extensive.  And with our party of six, we used it as an excuse to try a LOT.  We had 5-6 appetizers, 5-6 entrees, a couple of bottles of sake, and 6 desserts shared around the table (OK, the desserts were a little less shared because certain people had become territorial over their sugar by that point).  It's now July so I won't attempt adequate descriptions on so many dishes months later.  However, I remember some truly succulent duck (I LOVE properly cooked duck) as well as a host of other dishes that were creative and all nicely balanced-spice-wise.\nOur waiter was attentive and had plenty of answers and suggestions when we asked for his thoughts on the menu (always a good thing).  He was present without being overbearing and a delight.  And one of our party members accidentally dropped a glass, breaking it.  The staff acted as if it was no trouble at all and it was cleaned up and replaced faster than one could blink.\nMy dessert was presented with a \"Happy Birthday\" beautifully written in cursive in chocolate on my place.\nMy only real qualm with Hakkasan is that they asked us to put our camera away.  I hadn't planned on snapping over and over throughout the meal (Those people annoy me too), but I did want a few shots since it was such a monumental birthday.  I guess that would disturb the hip vibe.\nHakkasan seems expensive, but I am American and everything in London does.  Was the price of the same number in USD as opposed to GBP, I wouldn't bat an eye.  However, I was treated...and even if I wasn't, I am happy to pay for good food on nice occasions.  Perhaps I will have another on a future London trip.",
                "datePublished": "2010-07-24"
            },
            {
                "reviewId": "mfMIyffCNRPvS9X7CoA41w",
                "author": "Qype User\n mattni…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Chinese cuisine at its best, amazing decor, quite unique! contributes to the special feeling , the anticipation that this restaurant creates.\nThe tastes, the smells, all wonderful and lingering long after you leave.\nFantastic and delicious!",
                "datePublished": "2012-02-02"
            },
            {
                "reviewId": "cURvoUyHLjdNIYCbZzZcQA",
                "author": "Herry L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Taking a sophisticated Chinese friend from Hong Kong for lunch in London is always tricky as the standard of the home city is so unbelievably high, and so it proved on this occasion when she expressed herself impressed with the decor, but found the food not as good as in Hong Hong and the whole place a bit pretentious. In truth, it's not a place for lunch, though they do a pretty good dim sum, as it's decorated and lit like a nightclub and the menu prices make no concession to the time of day, unlike other Michelin-starred restaurants such as L'Atelier Joel Robuchon where you can have a prix fixe at lunchtime for £19.\n The staff too are somewhat snooty - as has been noted elsewhere, and our waiter was both a touch surly and distinctly unhelpful when we wanted to make more room on the rather too small (for a Chinese meal) table for two. The pretentiousness came out again when he saw me taking a photo of the dim sum and was positively 'British Airways steward' in trying to suggest that I was in the wrong. I quite understand restaurants don't want people flashing their cameras at other diners, but discreet no-flash photos of your own food is fine and I refuse to be brow-beaten. As a consequence, I took more than usual of the decor.(also apparently banned).\n The crispy squid was good and well seasoned and the seafood soup delicious - it tasted almost as good as the fabled sharks-fin rice that one is sometimes given in private company restaurants in Beijing and which costs an Emperor's ransom, and the roast chicken and stir-fried lotus root was excellent too. Though not quite good enough for seasoned Hong Kong tastebuds.\n We only drank tea (of which there was a fine selection) so we avoided the mark-ups on the wines which have made others wince, but we emerged in to the light with a pretty big hole in our wallet for a lunchtime meal and some tiresome service\n A final point; I am now unimpressed with restaurants and pubs which don't provide free wi-fi - and extremely unimpressed it's not available in a basement like Hakkasan, as one can't pick up 3G either.",
                "datePublished": "2009-03-10"
            },
            {
                "reviewId": "H_o3-NTdwd9gFecsn289Gg",
                "author": "Qype User\n Kudg…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hakkasan still has not been ousted as my top restaurant in London. I recently went to its sister restaurant in Miami (yes very random) and it wasn't quite as delectable as the London version.\n I'll admit to being ridiculously biased but I still have not found anything that quite compares to their peppery veggie chicken, morning glory, medley of exotic cocktails and did I mention hot (male) bartenders? Obviously that doesn't impact the taste of the cocktails..\n It better be on your list for top London restaurants to visit. Avid movie goers will remember that Hugh Grant took his 'crush' there on a first date in 'About a Boy'. So if its good enough for Hugh...",
                "datePublished": "2011-04-23"
            },
            {
                "reviewId": "tgr5p0CUWCLQLwu1Oc4oTw",
                "author": "Oscar O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Very impressive-first time I had visited a Michelin Star  restaurant and did so with work in a big group of about 30 of us. They deal very well with us and the service is always spot on. Amazing fragrances in the lobby, dark atmosphere and exciting place",
                "datePublished": "2013-09-11"
            },
            {
                "reviewId": "zvE3JEhiMDq1XxvpNNB-Yg",
                "author": "James K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The atmosphere was a bit pretentious, and I was not a fan of the whole \"designer-y\" look. The drinks and food were delicious though, and the seafood clay pot is one of the best dishes I have ever had.",
                "datePublished": "2010-06-04"
            },
            {
                "reviewId": "tA1NsbjOELkQjdoLfelZWA",
                "author": "Qype User\n streng…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Had lunch here on Friday. Overall really good, had dim sum to start which was pretty standard. As for mains, spicy beef was great, the prawns were really good, lobster with black beans was excellent and the pork dish also good.\n We also had the crab, which looked good as it came in the shell with all the claws, but it was actually annoying and time consuming to get the crab out of the shell, and not really worth the effort, particularly as we were with clients so had to try to not make too much of a mess (although the sauce ended up all over my shirt anyway).\n Dessert was good, its nice to be able to have something other than lychees or banana fritters in a Chinese restaurant",
                "datePublished": "2010-10-17"
            },
            {
                "reviewId": "Rf2wtSNuBUzFeQBSRV1SsQ",
                "author": "James K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Big, loud, gorgeous, delicious. A bit pricey, but I wasn't paying.  And they let us stay late.",
                "datePublished": "2012-03-27"
            },
            {
                "reviewId": "KmXs_Q9BflsxYAYwQ0UiNg",
                "author": "Bob Q.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Went here on the last night of my trip in Europe because my dad (who lives in London) said its his favorite restaurant. Now.. obviously I'm from California, so going to a high end \"asian\" restaurant in England made me skeptical from the get-go.\nThe first thing that ticked me off about this place is the fact that we had to have our reservation checked not only once but TWICE by the stuck up snobs that worked there (once at the door and once again when we got inside). Yeah, I know a family does not fit the profile of young and wannabe rich, but that shouldn't warrant attitude from restaurant staff of what's supposedly high end (this is not a damn club). We're going here for the supposed good food, not to act like douches and stare at everyone else in the restaurant. This ain't Hollywood.. so the B.S. shouldn't even be a factor here.\nSecondly, they sat us all the way in furthest corner of the restaurant in the furthest place from other guests as humanly possible. I thought I had escaped the L.A. pretentiousness by going across the pond but I guess its even worse here even when they don't have any celebrities to cater to. \nLastly, nothing we ordered was bad.. but NOTHING was what I would consider good - AT ALL. All the deserts were mediocre too. The only thing that lived up to my expectations was the service; but it should be a given in a place like this. \nThe only points I'm giving are for the service and for the decor/ambiance because both were very nice. Looks wise this restaurant does rival nice spots in Los Angeles so its a good place to 'impress' someone I guess. \nGiven the ridiculously bad attitude from the staff and the fact that the food did not impress me at all, I would definitely have to say there's no way I would ever go back. But I can see the appeal for most people.",
                "datePublished": "2009-09-24"
            },
            {
                "reviewId": "nUKk00pWrlu_iMsPJGicHQ",
                "author": "J E.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "We came to this place on a friends recommendation. We did not have a reservation but were seated immediately. They brought us menus and then disappeared. Finally i waved a guy down who admitted to being our waiter. He didn't say much just nodded a lot.  We ordered a £150 bottle of sake. That and the appetizers were wonderful. The entrees arrived and they were delicious. I gave four stars only because i felt the staff was stuffy and stand offish. The waiter broke a glass on our table and never said a word. To his credit he shook my hand when we left but i am sure that was for the 13% service charge he tacked on.",
                "datePublished": "2013-03-14"
            },
            {
                "reviewId": "UWts-pFA0cQs6b3Hj9y07A",
                "author": "Erik J.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Needless to say, there's a lot of \"fuss\" going around about Hakkasan, mostly being all positive. I think it's really important to undertsand that this is not your regular Michelin star restaurant. No silver service, pretentious service....far from it. You're even seated on time limit which for me personally means no Michelin star but I don't make the rules. The decor and interior is fantastic, nice traditional asian touch with modern brasserie style buzz. However, the food is a slight let-down. Let's remind ourselves again that this is supposed to be Michelin star class. Salt and pepper squid was the highlight but the rest was above average, but ceratinly below what you would expect at such an establishment. Hakkasan is absolutely an overall good experience for all the senses but the tastebuds are left the least entertained.",
                "datePublished": "2013-03-06"
            },
            {
                "reviewId": "Q4_9D2I-5vmjB9Ic6A3yow",
                "author": "Stacy W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Excellent...Extraordinary food, great service..They also make great Manhattans.",
                "datePublished": "2012-06-01"
            },
            {
                "reviewId": "qENj4BeGfU2k2nmguJD0mg",
                "author": "Christophe B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I was not entirely blown away, and it was not the best chinese food I have EVER had... But it was pretty good and I still do recommend it. Maybe I was expecting too much. It is also not as pricey as you may expect. With cocktails, appetizers and main dish each, it was about 50 pounds.",
                "datePublished": "2011-10-25"
            },
            {
                "reviewId": "TZdtwOPB_H_6VouaaTroHw",
                "author": "Amy W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Think sexiness, think pleasure, think a dining experience that makes you ooooooooooze sex ... think Hakkasan! \nI have wanted to go here to eat for a long time .. only ever managed to make it for cocktails before. \nLast we went for some food to celebrate life. It was delicious. The ambiance and attnetion to detail of this place is wonderful. \nI had Duck rolls for starters and Roast Duck for main ... just devine. The side veggies were cooked to perfection. \nWe had a beautiful seasoned Rjoca to top it off ..perfect.\nIt is pricey but I think totally worth it! \nWould recomend for romance , would recommend for cheering up, would recommend for drinks ! \nLoved it !",
                "datePublished": "2009-05-06"
            },
            {
                "reviewId": "vOlkB3JupfPm8FYWUuMkCA",
                "author": "Susie S.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Beautiful ambience, but i've had a better meal for £5 in Chinatown. We tried a dozen different dishes, and not a single one was memorable.\nThe pricey cocktails were also a disappointment - for £10 and 10 ingredients, you'd think you'd get something other than a gin and juice.\nShame all this sexy atmosphere is wasted, but silly me, this is clearly a feast for the eyes, and not the tongue.",
                "datePublished": "2009-05-12"
            },
            {
                "reviewId": "o6KdpjypF5Lk0l2NVSidcw",
                "author": "T E.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I was recommended Hakkasan by around a billion people (which is coincidentally about the population of China), but it was my old flatmate's words that got me here in the end.\n\"Just came back from Hakkasan... guess who we saw there? Jordan. And The King of Jordan\"\nHaha, what a perfect double-celebrity sighting! I had to go.\nBut sadly for me there was no celebrity sighting just boring nobodies around me, I wonder if the people sitting on the tables near me thought the same of me. Pah. Of course not... they'd be honoured to be sitting near Tom E off of Yelp.\nSo with no celeb sightings what else would Hakkasan offer? Well, the dark chocolate feel of the comfortable deep tones and wood made it certainly feel chic, modern but also perfectly functional inside. Kudos to Alan Yau once more for his skill in design. The service was impeccable as expected and the salt and pepper fried squid was beyond superb. I can still taste it in my dreams.\nBut for the price (high as a Hong Kong block of flats), other dishes were just not on par. Specifically I'm thinking of...\n1. The dumplings... good but not orgasmic, and\n2. Mapo Tofu - a limp excuse for 4 times the normal price of my all-time fave chinese dish.\n[sad face with tear coming out of one eye]\nStill, it was a great experience I'd love to try again but not until I've been to little sister Yauatcha about a million more times. That's where my loyalty lies.",
                "datePublished": "2009-05-07"
            },
            {
                "reviewId": "JgJ43Az-YPrv49CVJBNSjw",
                "author": "Laura H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is a very trendy restaurant to go and be seen. I didn't see any celebrities (though my British celebrity knowledge isn't that great) but this is definitely somewhere you can expect to see a sighting. A guest list lady is at the door, don't even think of walking up without a reservation (unless by chance you are a celebrity reading this awesome Yelp review) and I hear that tables often need to be booked quite well in advance. The ambiance and decor is trendy and reminds me of the upmarket restaurants that are adjoined to Las Vegas nightclubs. The food was good but tbh not as spectacular as you'd think given the high price - I think you are very much paying for the wealthy and fashionable vibe rather than the quality of the food. If you want to impress your significant other with a trendy night on the town this is a good place to start or if you're a tourist consider this as a good example of a fashionable London restaurant.",
                "datePublished": "2014-05-16"
            },
            {
                "reviewId": "0LECsiSOsSZ5I2r7XODCqQ",
                "author": "Amy S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I went here with a (former) boyfriend and his co-workers for Chinese New Year celebration.  It was delicious!  It is a bit difficult to find as it is hidden in what you might think is just a back alleyway, but the interior is beautiful and sleek.\nThe service was great.  We kept ordering more and more to share and our waitress was patient with us but prompt with bringing our food to the table and also offered her suggestions on what we should have.\nOne warning.  The toilets are a bit tricky.  I wasn't able to tell which one was the ladies' and which one the mens' because of how they are marked!  Once I figured it out though, it was fine!",
                "datePublished": "2010-01-06"
            }
        ]
    },
    "120": {
        "id": "ILyOYUjoKsLmPPlabPnTLQ",
        "name": "Hakkasan",
        "category": "chinese",
        "servesCuisine": "Cantonese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Fitzrovia",
            "streetAddress": "8 Hanway Place\nLondon W1T 1HD\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nyOKqfVgMGswPqwN1VrkBQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7927 7000",
        "review": [
            {
                "reviewId": "Xs6omSB5l7oshOe-dBiAUg",
                "author": "Al A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Update: We enjoyed our meal on our second visit, but this time at their Mayfair, Berkeley Square location. Much nicer people, and good service and not rude door bouncers. Perhaps the Hanway Place staff should take note.",
                "datePublished": "2012-03-18"
            },
            {
                "reviewId": "w3iH12i06HxV__MT34ZWew",
                "author": "Qype User\n thelon…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Hakkasan - Pics at The London Foodie\n(\nthelondonfoodie.co.uk\n )\n I have a love-hate relationship with Hakkasan  there are so many things to admire about this place but also so much I dislike. Over the years, I have returned many times to Hakkasan, and on every visit I found that what I loved most about this place - the food - had been consistently good. My last visit was no exception.\n Much has been said about French designer Christian Liaigre's multi million pound interior, Hakkasan's Michelin Star rating in 2003, and its listing in S. Pellegrino World's 50 Best Restaurants in 2008, so I will not go over old ground.\n Despite the occasional snooty service, and the extortionate prices for their teas I keep going back. I love the décor, and unlike many, I do not feel that the restaurant lighting is excessively dark - I find it soothing and feel that it adds to the overall experience at Hakkasan.\n I was pleasantly surprised to find I was able to book a table at 12:30pm for dim sum when I called on that same Saturday morning. Dr G and I headed to the familiar spot on Hanway Place, and were soon seated. We ordered a pot of Orchid Pao Chung tea @ £4.30 and a selection of eight dim sum dishes. These were:\n Scallop shumai with tobiko caviar @ £5.20  the scallops tasted fresh, and were within the finest skin I have encountered. The tobiko caviar added a sophisticated look and a pleasant saltiness/crunchiness to the delicate scallops.\n Braised beef brisket with cheung fun @ £4.80  this was also delicious although I was expecting to have beef brisket cheung fun not with cheung fun (my mistake!). The meat was braised to perfection in a deliciously sweet broth with hints of cinnamon and star anise. It was lovely to be able to finish off this delicious sauce with the added cheung fun.\n Crispy smoked duck and pumpkin puff @ £4.80  I loved both the presentation and flavours of this dish. The combination of pumpkin and duck was perfect and made for a good alternative to the more usual prawn & pork combo.\n Sticky rice in lotus leaf with wind dried pork and salted duck egg yolk @ £4.50 this was also a delicious dish with plenty of salted duck egg and pork filling in a thin case of sticky rice.\n Pan fried turnip cake with garlic and Chinese chive @ 5.50  the cake had a lovely texture, was crispy on the outside with a delicious flavor of fried chives and garlic. This was one of the highlights.\n Steamed corn-fed chicken bun with abalone and crabmeat @ £4.50  the combination of the different meats was surprisingly good within a light and delicious pastry.\n Steamed crabmeat siew long bun @ £6.00  Hakkasan's take on xiao long bao or Shanghai dumplings was as expected excellent, with plenty of soup and a thin, delicate skin.\n Sweet black sesame ball @ £3.30  stunning presentation and a light, fragile outer casing containing a generous amount of rich, sweet and nutty black sesame paste. This was a fantastic dessert and one I will make sure to order on my next visit.\n I apologize for the poor quality of the pictures. Hakkasan is renowned for not allowing any photography, and I was politely asked by management to stop taking pictures.\n Cost: £52 for two, or £26 per person including 13% (!) service charge. This is nearly twice as much as I would normally pay in most dim sum eateries in London.\n Likes: Excellent quality dishes beautifully presented, ultra fresh ingredients, stunningly designed restaurant.\n Dislikes: Efficient but impersonal service, no refilling of tea pot, and no photography allowed.\n Verdict: Hakkasan is one of those restaurants many would love to hate. I love it. I am still surprised by the amount of hostility this place attracts but in my opinion, despite the ridiculously high prices and the impersonal service, the food is fantastic and I will certainly be going back for more.",
                "datePublished": "2010-03-30"
            },
            {
                "reviewId": "MoPKgXmo7SfIt99sN_oXiA",
                "author": "Benedict E.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The food is good, if perhaps a little over-priced. But this is all about the scene. The guys in black suits on the door, the squadrons of pretty waitresses, the ambience inside, and the people-watching. Get a seat facing the room or you're missing the point. \nFor really authentic dim sum, go to Royal China or Top of the Town. But those won't be full of media bunnies in tight suits and short dresses, and you'll go home alone...\nIf you can't get a table, try Yauatcha, which is equally sceney and has arguably better food.",
                "datePublished": "2009-02-28"
            },
            {
                "reviewId": "rtbhXfLx6FSbs14lX6s8DA",
                "author": "Kim M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This place is amazing and you pay for every bit of it. If you feel like splurging on a stylish night out, then this is a great choice. \nYou have someone greeting you at the door of this sleek hideaway. You have someone take your coat and yet another person check your reservation and guide you in. I'm surprised they didn't have someone forking the food into your mouth. \nI've found it tough to find a quality, creative cocktail in London - Hakkasan is clearly trying to make up for this and they do a good job. They also have a stellar wine list. \nThe menu can be overwhelming. It's also shocking to see main entrees for £150 or more. I'm not kidding. It's nuts. \nMy friend and I decided to split a bunch of starters including the dim sum platter (yummy), ribs (amazing), lamb salad (meat was too dry, I wouldn't pick this again), mushroom and water chesnut with lettuce (mediocre), soft shell crab (big yum). \nThe waiter was average and didn't do a good job of advising us on how much to order and what makes a good combo, nor did she have any wine suggestions. For a place of this calibre, you'd expect the waiters to be pros. \nBut in the end, it was all about the experience. It felt like being in a sleek spa, with scrumptious cocktails, original and memorable food and  WAY too expensive. I guess you're paying for them to have fifty people waiting around to show you to the bathroom and to keep up the gorgeous space...",
                "datePublished": "2009-02-22"
            },
            {
                "reviewId": "rQ43lw09y8vFtWkGXbQDMQ",
                "author": "Tatiana O.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Best dim sum in London hands down. Everything is good and it has a great bar with lots of cocktail options. Trendy vibe for sure as well. A must.",
                "datePublished": "2014-08-08"
            },
            {
                "reviewId": "793i_A1kt68QDUW5dbdrrg",
                "author": "Qype User\n FlatFo…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Amazing food and gorgeous champagne. Definitely too many people serving you but they're all incredibly polite and helpful. Decor perhaps a bit too dark... \nGenrally a fantastic experience but way too expensive!",
                "datePublished": "2010-10-28"
            },
            {
                "reviewId": "bjpZ8cvrwAlgb8ENwnbZ5g",
                "author": "Hiro S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The food is not bad, but their focus is more ambiance and atmosphere which is nothing wrong.  :)\nIf I want to get good/authentic dim sum/yum cha, then I would rather go to Royal China.  But if I want to enjoy some cocktails with friends and maybe some dim sum munches, then I would come here.",
                "datePublished": "2009-01-09"
            },
            {
                "reviewId": "Gpa4DmoZQkKu0x9i7a5V1g",
                "author": "Qype User\n contes…",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "It took me a long old time to get around to visiting Hakkasan and frankly had heard nothing but great things about it so was all set to enjoy a leisurely 'Thank God it's Friday' lunch with my oldest and thank goodness richest friend....the idea was to eat, drink and make very very merry indeed whilst catching up and generally having a rip roaring old time.\n Oh Dear! Despite many many glowing reports about firstly the amazing ambience, secondly the amazing cocktails and thirdly the amazing food, it was a disaster....the cocktails were really average, the food was so ludicrously overpriced for tiny portions that it was laughable and we were one of only 4 tables occupied in the whole restaurant, given the above I'm really not surprised...maybe it's passed it's sell by date...maybe we were just unlucky....but it was really disappointing and so stupidly expensive that even 'The Millionaire' baulked at the bill....this from a man who thinks nothing of paying £500 lunch for two....if he enjoys it. My advice? Go to China Tang instead.",
                "datePublished": "2009-11-05"
            },
            {
                "reviewId": "I180hx54arFQqxvFffZCPw",
                "author": "Susan T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Very Sexy place! I would go for a special occasion.\nEnjoyable dinning experience. Fun drinks to enjoy at the bar with friends or a date.\nFood is great, but kinda pricy. If you just want to enjoy some delicious, quality Chinese/Taiwanese food, go to Taiwan Village!!!",
                "datePublished": "2009-07-27"
            },
            {
                "reviewId": "KEMDqo3Spvo1saNmIT-tVw",
                "author": "Olivia C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This place has been very good for years.  Not cheap, but fun and young, stylish atmosphere.",
                "datePublished": "2011-04-17"
            },
            {
                "reviewId": "gsBTo_cqZcGVVOkftXgZFA",
                "author": "Qype User\n mseaso…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Amazing space - very nice withour being too pretentious. I really just loved looking around. (Be prepared for the camouflaged toilets though!)\n The food was good, but my verdict at the end of the night was 'Michelin star Chinese food is still just Chinese food'\n We had a couple starters, calamari and duck with mango, which were both lovely.\n For mains we had pork belly and some sort of chicken. Both were just ok. Definitely not worth the price, but better than your average takeaway place.\n (But for as much as you pay here, it better be a hell of a lot better than just your average takeaway place!)",
                "datePublished": "2009-04-20"
            },
            {
                "reviewId": "QBQVrftpOZ7Wgk5Q3FZtsg",
                "author": "Angelica C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I always make a reservation at Hakkasan when in London. The food is excellent, the wine list is phenomenal, and the crowd is sexy. It's a Michelin-star winner and deserves all the hype it gets.  My favorites include the sesame prawn toast, salt and pepper squid, and stir-fry black pepper rib-eye. Remember your veggies! You won't go wrong with the pak choi and gai lan.",
                "datePublished": "2010-07-21"
            },
            {
                "reviewId": "FvcR0CCgXuDAejmikShe4Q",
                "author": "Katie G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Very sexy restaurant. Service was great - told the server to pick about 6 dishes on the menu for me and my date to share. His choices were great: crispy duck salad was my favorite, along with a spicy prawn dish. The lychee martinis were fantastic so I had a bunch of those.  Main downfall for me was our seat. We had to both sit on the same side of the table and there was a couple right next to us doing the same thing. It was a little close for comfort.\nA lot of business dinners but also a lot of dates and party groups. Versatile restaurant with good food and service.",
                "datePublished": "2010-08-23"
            },
            {
                "reviewId": "yEINrCk-9GnG6_q469ewng",
                "author": "Samuel M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is my type of restaurant, if i don't go to eat great food. It is so forgettable, but the place is a masterpiece visually. The Dim Sum starter was extremely hot and the Ginger Rice was a disaster. This is one of my favorite restaurants in London. Cosmopolitan, chic, cool,sophisticated,  a hot spot. The music is loud , something i like in this kind of places. It was jazz and house, nothing out of this world, but good.   A memorable experience",
                "datePublished": "2011-04-11"
            },
            {
                "reviewId": "DczGvk73sBNAtVYkoNQeAg",
                "author": "Miss B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Outstanding! drinks are awesome, try the black forest martini or the white buffalo for something sweet like dessert. for vegetarians, this place rocks! bok choi with garlic, vegetarian dim sum, veggie lettuce wraps are to die for, veggie black pepper chicken will scare you it looks so real. chilean sea bass was yumalicious as were the red pepper chili prawns. music via live DJ and ambience was awesome, dress nice for fun, don't expect much of a convo, quite loud. great service....reservations a must way ahead of time, hot spot. don't go late for dinner (10 or later) if you need to cab or subway back, you will get stranded.",
                "datePublished": "2011-04-08"
            },
            {
                "reviewId": "d9X0740b0kbgZh4WRofo6Q",
                "author": "Natasha A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I really loved this upscale Chinese joint. Posh and classy deep underground near Tottenham Court Road. Lovely food and drinks. I had a lovely cocktail peppered around the rim and all the dishes we ordered were flavourful and spiced carefully. Ambiance is perfect and overall a very nice expreience! Must go to if you're in need of a posh fun place with good food and booze!",
                "datePublished": "2011-06-06"
            },
            {
                "reviewId": "VvU9TB2QEeTbGpdAWBwreQ",
                "author": "Sinan O.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hakkasan is the parent of Yauatcha, another favourite restaurant of mine.\nThis is an exclusive and tranquil restaurant, which means eating here can be expensive and that also means I dine here only on the occasion.\nIt has a trendy ambience to it. It is located on a quiet road, and on entering you walk down some stairs into a basement, its dark and romantic, with the decor mixed with modern and oriental influence.\n \nMenu is Chinese cuisine but more gourmets with some interesting flavours fused together which comes up with interesting tastes. \nI love my deserts, but dont tend to go for them in the Oriental restaurants, but on my recent trip here, I had a a pineapple cannelloni, which I never heard of, it was brilliant, but on the small side, I just wish there was more of it.\nThis is somewhere I would recommend you take your partner for a romantic meal, it's got a lovely, romantic setting and it's a great way if you want to impress somebody. However it comes with a price tag, drinks are relatively highly priced, and so is the food, expect to spend roughly £150 for starters mains and drinks for two, i have never spent less than that in here!! \nHowever, its definitely worth it for a nice treat. The whole experience is tops!\nThe service is of high quality as expected and the music is really funky, lounge with latest DJ's mixing their music. There is a small bar where you can have a few drinks before you dine, they have thought of everything at Hakkasan. I love it, and wish it was a little cheaper!",
                "datePublished": "2008-12-24"
            },
            {
                "reviewId": "29R9mVcQ7MGKIMF3xjFGSA",
                "author": "Tracy T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "If I wasn't such a style slut I wouldn't rate Hakkasan as highly as I do. The interior is dark and decadent. It's been rated no. 19 by the San Pellegrino top 50 restaurants in the world. Amidst the almost black browns and dim lighting, snooty staff glide through the restaurant. \nIt's not a place you can linger in as you have set times to eat and get out. Yes I am rather cynical about it all. \nThe vegetarian dim sum is delicious. One day I'd like to have the luxury of experiencing the menu with no concern for budget but for now I will stick to lunch time starter menu.",
                "datePublished": "2008-11-18"
            },
            {
                "reviewId": "eWKsrJE_4KRbwv9JvGYfwQ",
                "author": "Joseph P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ling Ling @ Hakkasan is the bar of the famous Chinese restaurant Hakkasan. The bar is really good with a mix drinks including cocktails and special chinese drinks, they are prepared in front of you which is cool and the atmosphere is great in there. This place is perfect to have a drink before the supper in the Hakkasan or just to have a chilling out session in.",
                "datePublished": "2008-11-17"
            },
            {
                "reviewId": "DHM-lR-IJnURotdNRyTvdA",
                "author": "Aline D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I used to come here a great deal a few years ago. I have eaten here a few times, but I much prefer the experiences I've had just propped at the bar enjoying their delectable cocktails. Yes, the cocktails. I only ever come here specially to drink them. The bartenders are very professional, where making the drinks is almost a form of art. And the ingredients used are only ever fresh ones. I also always order their prawn crackers, which are the proper sort, tinged in a dark orange colour, served generously in a large bowl.\nHowever, the prices for the food are much too expensive, almost too much for Chinese food to be honest. But despite this, it is delicious. In all, it is worth a visit just to bask in its amazing interior and to gorge on as many cocktails as possible!",
                "datePublished": "2008-11-09"
            }
        ]
    },
    "140": {
        "id": "ILyOYUjoKsLmPPlabPnTLQ",
        "name": "Hakkasan",
        "category": "chinese",
        "servesCuisine": "Cantonese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Fitzrovia",
            "streetAddress": "8 Hanway Place\nLondon W1T 1HD\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nyOKqfVgMGswPqwN1VrkBQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7927 7000",
        "review": [
            {
                "reviewId": "YEhQorpNsz0UOUoEqXov5A",
                "author": "Qype User\n Mckay6…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Still the best restaurant in London, for my money. Yes, not just the best Chinese but the best restaurant of any cuisine. Truly stands up to the best in New York.\nThe team have really thought about every ingredient and they have created a nouvelle Chinoise cuisine that is not pretentious or the ramshackle fusion you find in some modern Chinese restaurants.\nI would recommend all their duck dishes, the lobster in garlic and black bean and the surprising turnip cake which is a creamy maked purée topped with shredded bacon. Tremendous.",
                "datePublished": "2011-11-30"
            },
            {
                "reviewId": "QKE0Cbw2WFVFlqdMIqN9Uw",
                "author": "Kierstan G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I should get two points for this place, because i went to both locations on consecutive nights.  Yes it is that good.  Yes i am that addicted, committed to the dumpling.  This place is chic, modern and dark and swanky.  It is crowded at night on a weekend.  The cocktail menu is extensive and after having quite a few all were amazing.  I tried to compare the lichee martini to nobus and it may have won.  It is such a weird dichotomy...ancient london street, quintessentially narrow and cobble-stoned...then you walk into this modern chinese food mecca and are accosted, though pleasantly by the smell of incense.   The dumplings, short ribs and crispy duck rolls are all amazing.  The shrimp dumplings a favorite.  And at the end when you go to leave...there are three people holding an umbrella over your head while they hail you a cab...please...its midnight, my curls came out ages ago but I'm flattered...and i will be back...",
                "datePublished": "2012-06-23"
            },
            {
                "reviewId": "MEOYIQP2uh0_TaTrEVABag",
                "author": "Liz S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Fantastic interior, food very good to fantastic, wine list very good. The bar and selection of spirits and cocktails is particularly fine. Good number of front-of-house staff, so service is superior too. Can I say the exotic fruit platter dessert is worth the trip all by itself.",
                "datePublished": "2010-02-14"
            },
            {
                "reviewId": "ZbcQDdqgEKTnyWBzxVtzdg",
                "author": "Qype User\n CAMILA…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The entrance of the restaurant (in a basement) said it all and much about what you are about to find. Down there, is like you are no longer in London, the waiters have a strong unknown funny accent, the food is not just pretty and no flavour but rather strangely mixed on the plate and scrumptiously flavoured. \nThis restaurant is a lovely way of meeting with asian country, without wasting as much money on travel.......\nThe whole experience was lovely",
                "datePublished": "2009-10-23"
            },
            {
                "reviewId": "JmBuuov9Bd2wSpKnRPQvfw",
                "author": "G K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "At the entrance of Hakkasan you are met with two bouncer-esque characters who check your name on the reservation list. I'm not sure what their purpose is because there is a bar down stairs where you can wait for a table to become free when you don't have a reservation and also, when you reach the bottom of the stairs, you are once again asked for your reservation details anyway.\n The impact of Hakkasan is immediate - it is dark, yet shiny, with spot lighting on each of the tables and otherwise night-club lighting. The otherwise cavernous room is split into more intimate areas by large wooden poles which may or may not have been bamboo poles painted black. Its supposed to be a very modern take on the Chinese motiff. Unfortunately no photos allowed!\n The Hakkasan drinks menu was very impressive and contained a good balance of non-alcoholic and alcoholic cocktails not to mention a staggering wine list. When you check out some of the offerings its no wonder that people can easily spend hundreds, or even thousands, on one dinner here!\n The food menu was also fairly impressive, with diverse and sometimes unique offerings, but surprisingly nothing shouted EAT ME which is terribly unusual for me not to mention the fact that the prices were outrageous if not unexpected.\n To my surprise there was nothing on the dessert menu that we were interested in, even if we could fit more food into our very full bellies. Instead we opted for a second round of non-alcholic cocktails - very yummy.\n Overall Hakkasan is definitely a place to be experienced at least once but my recommendation would be to save it for a special occasion though if you're minted, well, I guess you could make it an everyday experience!",
                "datePublished": "2009-01-18"
            },
            {
                "reviewId": "VTWBaiFTCLM2QJPCYUl52Q",
                "author": "Qype User\n theku…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I respect the quality that Hakkasan consistently provides to all of its diners. The last time that I ate here, it was a bit of a random event with a friend, and they fortunately had enough tables to seat us although they did warn us they needed the table back after a couple of hours.\n My friend was also wearing trainers and although the bouncer had to check with the manager, he let us go through anyway though told us about their normal dress code.\n Even now that the ownership has been transferred away from Yau, the last experience was just as good as previous ones. Service was prompt without being too in your face. We ordered both a starter and main with some vegetables and all of it was totally delicious. I'd highly recommend the ribs where the meat had been cooked to a point where it literally fell off the bone.\n It's cool inside and a nice dining experience overall.",
                "datePublished": "2009-01-17"
            },
            {
                "reviewId": "z6Tfc_k9WxoKTGsRBEVugQ",
                "author": "Qype User\n greenm…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is a top place, at a price. The food is excellent and portions are bigger than you might expect, so order small and add if you need it.\nArguably a little dark and claustrophobic, but you could say that's the atmoshere. They like to serve you quickly, to keep the tables turning over.",
                "datePublished": "2008-04-09"
            },
            {
                "reviewId": "MlMSi_5f5q0lHodw6smdbw",
                "author": "Qype User\n scotti…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The poshest Chinese in London? I think sonot sure it does take away though, which is a shame as the food is really excellent.\n There is a great variety on the menu for both food and drink and both are really very good and its worth going along just to try out the cocktails. You certainly used to be able to go and just bar fly which was a (relatively) cheap way to check out the venue and have a very nice drink. Not sure if you still can as I haven't been in a few months.\n Great atmosphere in the darkened basement with some very subtle lighting and some great understated but cool decor, and although it's big the lighting and set up means it holds onto a feeling of intimacy for either a date or a business meeting where you don't want the information to be available to all and sundry. The low lighting gives it a bit of a feeling of a new york restaurant for me.\n Anyway it's well worth a visit and its open late as well for all those night owls amongst us. Be warned though - I've only been phoned about possibly fraudulent spending on my credit card twiceonce was in Tokyo after buying two things in 5 minutes in a shop.and the other was after going out for dinner here. Cheap it is not.",
                "datePublished": "2008-08-17"
            },
            {
                "reviewId": "Vnlm1ZN2HKjTAhhLGzYjug",
                "author": "Agi K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Awesome. I hate the word but credit where credit is due. V Good food. V Good atmosphere.....and the cocktails....Take the Hakka cocktail - a fine  beverage- I dare you to drink 5 hakkas and make it out the door without wanting to be amorous with the bouncer on the door (mate in case you read this please note that I am straight), the door, the lamp-post outside. It's not an aphrodisiac but it sure puts you in a good state of being... all that without the Yoga exercises. The price for the dining experience.... mmmm...bite my head but I did nor find it that bad. Less classy joints have cost me more even with vast amounts of alcohol I ordered. This place is my current favourite in London.",
                "datePublished": "2010-02-15"
            },
            {
                "reviewId": "jbHBSoKuZmpsydHs72Q39g",
                "author": "Qype User\n buloo…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I went to Hakkasan once with my friend and her boss together with their clients. It is overall a great place with tasteful (but just a little too commercial for my liking) interior. Lighting was particularly bad on the table; we could not even read our menu properly.\n The food is great but not superb considering the amount that we paid. The roast duck with caviar was £150! The total bill came to about £1000 for eight of us. The service was fantastic but I can't help but wonder if it was because we were spending so much. I heard from friends that they were really stringent with the 2 hour slot that you get when you book the tables. However, we booked the table for 8.30pm and we stayed for the entire evening till about 12 midnight!\n On the whole, I would say that this is a restaurant with good food and designer interior. However, it is not a place that warrants all the talking and all the hype.",
                "datePublished": "2008-04-15"
            },
            {
                "reviewId": "Zz6GQcRNEYK3k9PBkFVNIQ",
                "author": "Qype User\n ZMAn…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "You're not going to find many Michelin starred Chinese food restaurant, and Hakkasan is one of them (in fact, I think Alan Yau's other creation, Yautcha is the only other Michelin starred Chinese restaurant). And it doesn't disappoint: A trendy, dark lit setting, with comfortable seating, plus good food and service.\n Starting off, we ordered dim sum (prawn har gau anyone?), which was good, but not spectacular. For mains, among the dishes we ordered included the roast chicken in satay sauce (which was good) and the sauteed roast duck (which was brilliant).\n The friends I took were non-alcoholic, so we abstained from the strong selection of wines and cocktails (though there were non-alcoholic cocktails). The only obvious downside is the price.",
                "datePublished": "2009-01-30"
            },
            {
                "reviewId": "pXrugS8o5M8_O2lCcW-nnA",
                "author": "Qype User\n john…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I really like Hakkasan, but you have to take it with a pinch of salt. Ultra-trendy, its the place to be seen enjoying contemporary Asian food. So don't get hung up on the posers, cos you're going to miss enjoying some of the best asian food in london.\n I love the setting - a subterranean dining space, accessed from a dingy alley off Tottenham Court Road. Hardly a salubrious neighbourhood, but it heightens the effect of entering such a trendy space. Dark, moodily lit, black ash furniture is all counterpointed with the occasional spot & neon blue lamp. The bar area boasts some comfortable sofas & an impressive drinks menu.\n Once you're seated service is attentive, especially as you start to realise that the restaurant holds a lot of covers. To be honest the food is well executed but there are no signature dishes. Unsurprisingly its expensive, but not overly so.",
                "datePublished": "2007-08-06"
            },
            {
                "reviewId": "A3gb3yVNUh7T85oSYKCNfw",
                "author": "Qype User\n buster…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Very cool setting & amazing interior - submerged lounge with dark woods and charcoal greys everywhere. The food is fantastic, and the cocktails are lovely (I recommend the bisongrass vodka with cucumber).\n The dim sum starter is amazing, as is the venison main meal, and any of the sea bass dishes.\n The menu has not changed in 5+ years, so it gets a bit tired if you have been many times, but still the vibe for dinner or even a drink is worth the price.",
                "datePublished": "2007-09-11"
            },
            {
                "reviewId": "xkQIPW_b2GJnggLWhc0bPQ",
                "author": "Tirthankar D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "When my boss heard that i had actually called up Hakkasan this morning and had got a reservation for tonight, he became all gloomy ... effect of the recession maybe, he says, gazing in the distance beyond me ... otherwise in the good old days you had to wait for days at least.\nReminder : Will tell him on monday not to worry too much. The place was packed with people. The fact that i was alone must have helped (why don't i have a friend in London who likes chinese food ? boo hoo).\nI start with a crab meat starter. Tastes good ... a bit like calamari ... but nothing too special. But the main course was very good (i am proud of my choice). Mongolian venison ... soft, and very well cooked meat. It was lovely. Had it with the egg fried rice, which was rich and tasty. Is it my imagination, or was the light (rather, the lack of it) playing tricks on my eyes ? It seemed to me that they cook the fried rice only with egg yolks ... it was all yellow ... and did i mention that it was rich and tasty ?\nThe bowl contained a lot of rice, as the sweet lady serving me had warned. When she came to clear the table, she said \"wow !!! you ate all the rice !!!\". I spent exactly 6.2832 seconds trying to decide whether to feel proud or embarrassed. But i was too full to do much thinking.\nI would have finished there and then. But those evil people going on around serving food and clearing the plates ... one of them sweet talked me into asking for the dessert menu. Can't give Hakkasan credit for the glorious sweet red sparkling wine that i ordered (didn't even know these things existed) ... but full credit to them for the sweet talk though :)\nOne star less because the place was too loud. I doubt if one can have a decent conversation here.\nP.S: There were a group of arabs in a table nearby. Their glasses were being continuously refilled with wine without them even asking. If this can happen in a michelin starred restaurant, my boss has nothing to worry :)",
                "datePublished": "2009-07-24"
            },
            {
                "reviewId": "pruYOtkdzHYqcWKPa8H_yw",
                "author": "Sue B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This isn't usually the kind of place I go to as it's waaay out of my price range, but I was fortunate enough to win a meal for two here. When I won the prize it said meal to the value of £200 so I thought I'd have trouble spending that amount, but the reality was that it was all too easy! A reasonable meal for two plus a bottle of wine took us over the £200 in the blink of an eye so this is somewhere to come if you have more money than you know what to do with, or if someone else is paying.\n Hakassan is in a maze of alleys behind Tottenham Court Road tube station and screams trendy from the Mitchell-brother-like bouncers on the door to the slate walls on the way down the stairs to the underground restaurant.\n The food was absolutely wonderful - the dish I enjoyed most was Mongolian stir-fried beef which was truly melt in the mouth. You also get the entertainment of watching the beautiful people - it's like a different world to the one I usually inhabit.\n Only downside was that the restaurant seems to limit diners to 2-hour sittings. The couple on the table next to me ordered more drinks after their meal and were cross-examined by the waitress about how long they were likely to take to drink them!\n Definitely worth a visit if you're feeling flush, but only if you can eat quickly!",
                "datePublished": "2008-11-20"
            },
            {
                "reviewId": "8HEOgGwgYd702RDMFR4HfA",
                "author": "rhonda s.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Hell's Kitchen or simply Hell?  Gordon Ramsay's head would have exploded. My friend and I decided to use our hotel $$ savings from the Hoxton's £1 Sale to splash out at London's first Michelin starred Chinese restaurant. Huge mistake and we knew it the minute we walked in to face a row of sullen Robert Palmer 'Addicted To Love' zomboids. \nThe people of Hakkasan appear to be the most irritated species on the planet. Not only do they begrudgingly take coats and hold open loo doors, they also forcefully remind you (for the tenth time since making the reservation two months ago) that you absolutely must be finished with your table after 90 minutes, no exceptions. (And a hearty hello to you, too, oh irritated ones!) But it doesn't stop there. If you can open the menus without assaulting your closely situated neighbors, you are then tasked with divining the ingredients in the title sans descriptions dishes. We saw three duck dishes and made the mistake of asking our ill-humored waiter how each was prepared. Instead of waxing rhapsodic on the virtues of each, he snapped, \"They're all duck, that's all you need to know.\" Hmmmph! It went further south from there, but at least it was consistent -- consistently awful to the point of hilarity. \nSpare yourself the scorn and scolding, unless of course, you're into that kind of thing.",
                "datePublished": "2009-10-02"
            },
            {
                "reviewId": "WPpOXuI6q1uKflR86KHEiw",
                "author": "Qype User\n goldie…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love this restaurant but it does warrant a special occasion - as other reviews has stated, you can easily get carried away (as the menu is so delicious) and will need to dig deep in your wallet to pay the bill.\n First off, it's difficult to find. Just off Tottenham Court Road, down a back alley, tucked away in the corner, set in an old underground carpark. Keep going towards the end of the street and you'll eventually find the exclusive entrance.\n Plunge into the bowels, down a set of sleek and very dark stairs and suddenly a wonderland will open up to you. This would be the perfect place to bring a first date you're keen to impress. The tables are discrete, the lighting moody and beautiful people waft around looking cool - although you will find the odd rowdy group of Chinese businessmen.\n Incense hangs in the air and you can just about take a sneaky peak into the buzzy kitchen.\n The menu is huge and pretty overwhelming. The tea-smoked ribs are a favourite, the jasmine rice served in a dainty bamboo basket. The pepper beef is also delicious.\n Service can be a little hit or miss for a restaurant of this caliber. But the food makes up for it.",
                "datePublished": "2008-11-20"
            },
            {
                "reviewId": "dIkqTzYNSiF4mjjeOsR1lA",
                "author": "Qype User\n laskor…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Went to Hakkasan for my brother's birthday! The price for our meal was on the high side but it was well worth the money!",
                "datePublished": "2010-09-17"
            },
            {
                "reviewId": "wIK6yxhFDLWlIiELBiX9SQ",
                "author": "Ryan L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Turn the lights down low enough and everyone in the restaurant looks beautiful and mysterious.  The lighting here is dark, but to be honest, the strategically-placed spotlights work well.  And it all adds to the atmosphere, which is most of what this cool restaurant is about.  The food was a bit pricey for what it was, but it was also unique and memorable, as well.",
                "datePublished": "2009-06-22"
            },
            {
                "reviewId": "nj_eA2vXHfh_3TJ4xIbo8Q",
                "author": "Qype User\n Louise…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Having been told that we were only allowed a 2 hour sitting my initial impression was not the great however after being ticked off the guest list by the bouncers at the door we entered the sleek bar/restaurant designed by Christian Liaigre. Trying the cocktails is a must while you wait for your table (particularly the lychee one!) and sitting at the bar in the buzzy yet chilled atmosphere is a great experience. Although the design of the restaurant is quite closely packed in the screens, darkness and low lights give the restaurant an intimate feel, perfect for any romantic dinner.\n Already knowing that the owner Alan Yau owns Wagamamas and another michelin star restaurant Yauatcha I was expecting the standard of food to be very high and I was not disappointed. The waitresses are constantly there for any need you might have but are not intrusive and at no point in the meal did we feel rushed.\n The menu contents is quite overwhelming and the dishes that have to be ordered 24 hours in advance (such as sharks fin and beluga caviar) make an interesting read. My starter and dessert (soft shell crab and chocolate and passionfruit ice-cream) was delicious, however my beef main unfortuantely tasted like standard chinese fare saying that though the rest of my party all had fantastic dishes.\n Hakkasans was a very enjoyable experience however it comes at a very steep price but it is to be recommended.",
                "datePublished": "2008-01-07"
            }
        ]
    },
    "160": {
        "id": "ILyOYUjoKsLmPPlabPnTLQ",
        "name": "Hakkasan",
        "category": "chinese",
        "servesCuisine": "Cantonese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Fitzrovia",
            "streetAddress": "8 Hanway Place\nLondon W1T 1HD\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nyOKqfVgMGswPqwN1VrkBQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7927 7000",
        "review": [
            {
                "reviewId": "AQgCOPhiywiVeYhlJiLWmg",
                "author": "Brooke C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Best meal of my recent visit to London. Like some of the other yelpers , being from the west coast and living in NY, I was skeptical of an Asian fusion spot in London. I was pleasantly surprised from the moment we pulled up into the small back lane entrance and walked downstairs into a fabulous underground lair. The decor was beautiful asian-style and contemporary plus the place was packed with a great, upbeat ambiance. The food surpassed my expectations - it was adventurous chinese mixing a nice balance of authentic flavours with new flair. Served family style, it made for a great group meal and I kept eating long after I should have put the chopsticks down. Not to mention the delish lychee cocktails which were more creative than the usual lychee martinis you'll find at so many asian fusion spots. Only downshot, cocktails were a bit slow to be offered and then delivered to the table and after our allotted dining timeslot,  we were politely but firmly asked to leave rather than enjoy another drink. Understand this is a reality for hot tables in London, NY etc but I prefer a subtle request versus the pointed ushering towards the door. \nAll said, I would absolutely return!",
                "datePublished": "2009-10-16"
            },
            {
                "reviewId": "Y7UwFknven-sCcpkggLedQ",
                "author": "Matthew M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "One of the most intense dim sum experiences I have ever lived.  The setting here is truly amazing and a special place to eat a dim sum like you have never experienced.",
                "datePublished": "2009-01-11"
            },
            {
                "reviewId": "al_CCpaV-jNs7wQS-OGBkA",
                "author": "Mariangela S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This is all about the scene. Can't remember a single thing about the food. Cocktails are good and wine is on the more expensive side. Dark, red interior, lots of glass, quite noisy, but great for people watching.",
                "datePublished": "2009-01-11"
            },
            {
                "reviewId": "Zs4f3_zf2ucFQ1LrtBBmgA",
                "author": "Paul F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Went here a few years ago with family while we were in town.  Amazing food, and even made a dish without soy sauce for someone in our group who was allergic.  I think I had the mango duck and it was great.",
                "datePublished": "2009-01-08"
            },
            {
                "reviewId": "UZw1s2Do_DCY8KlspmoGjg",
                "author": "Qype User\n Lelesu…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Well Maintained, has a very long bar... was the longest in london for a while... however for a chinese person there is f***g good food. highly recommended. :)",
                "datePublished": "2010-01-04"
            },
            {
                "reviewId": "zMI-4BSpCP4ksiABf_o7mQ",
                "author": "Qype User\n gunsh…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Possibly the darkest restaurant I've ever had the pleasure of eating in. The staff are intimidatingly polite, well dressed and numerous. No less than four members of staff showed us to our table in relay. A maze of passages guide you through corridors of latticework walls through which you can glimpse the faces of other diners and see the winking glint of spotlights and reflections as you walk along. Take a trip to the loo and you'll encounter a member of staff whose sole responsibility to guide gents into the mens ladies into the womens.\n At the table the service was efficient and the food arrived quickly. The starters are on the large side and more appropriate for sharing. I had the soft shell crab which was delicious. For the main I went the whole hog and ordered the grilled Wagyu beef. This was my first Wagyu experience; the meat was tender and succulent, easily the finest steak I've ever had. The steak was served sliced and arranged on two banana leaves that were formed into the shape of a boat. Bamboo shoots stood in as oars; the oar blades were slices of fresh chilli. My two friends ordered scallops and lobster and I sampled them both. Although the scallop and lobster meat itself was excellent, the sauces were a little bland which made the dishes seemed a little lackluster.\n It's a pity that the menu seems a little hit and miss as the surroundings are magical and the service was excellent. I'd come here again but would be careful about what I ordered.",
                "datePublished": "2009-07-16"
            },
            {
                "reviewId": "6u058lLRyew9fNCG9--mBg",
                "author": "Ayman K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "In the centre of London the theory is: the better the quality of the food, the more recession occuring in your bank account. And Hakkasan most definitely keeps that theory alive!\nThe food is Incredible [kindly note the use of the capital 'I' for emphasis!] The restaurant itself is beautiful - with the lighting transforming the joint into an almost intimate, high-end night cub by the evening. \nPerfect for dinner with the person you wholeheartedly adore and would rightfully spend a fortune over. Though I suggest large group of friends or students go for the cheaper alternative and head down to Cape Town Fish Market - equally delicious but a little more affordable and a little less high-maintenance [I mean that in the best way possible....I do - hence the fifth star! hehe]",
                "datePublished": "2008-11-15"
            },
            {
                "reviewId": "Qn7Bmtk1qk88IIOCgTEzng",
                "author": "Monica R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Named one of the 50 best restaurants in the world by a respectable survey,  this place is another of Alan Yaus burgeoning and incredibly popular outposts of Asain gourmet cuisine, Hakkasan must rate as one of the best eating experiences in London. The style is opium-den decadent and the food, although expensive, is mouth-wateringly good and worth every penny. A fun extrovert crowd adds to the allure. The cocktails are out of this world, get any that has lychee, as are the extraordinary desserts. Hard to find, tucked away down a back alley, but once you're there you won't regret it.",
                "datePublished": "2008-11-06"
            },
            {
                "reviewId": "h7xZ4oCgBuUDwP6dzhdpkw",
                "author": "Qype User\n hedgie…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The restaurant is tucked away in an alley just off the Tottenham Court Road/Oxford Street junction. One's name is checked off on a list by a doorman; a back slate-lined stairway leads down to an incensed-perfumed reception hall and the restaurant. The decor is mostly black with backlit blue walls. Laser-beam spots punctuate the gloom, and geometric Chinese screens divide the tables. It manages to reference an art-deco Shanghai opium den while being very modern, luxurious and comfortable.\n Waiting for Liz at the bar, I had something called a Purple Emperor: a wonderfully smooth, but actually yellow mix (a base of rum and sake). The purple was supplied by a massive orchid the bartender popped on top for decoration\n My preconception was that a Michelin-starred trendy restaurant would offer small portions: however the opposite was very much the case, with every dish seemingly sized for two hungry eaters. A starter of Sechuan chili crab was enormous and completely fabulous; my dimsum selection was pretty good too and contained 8 large dimsum. My main of jasmine tea smoked chicken was amazing (but must have contained at least half a chicken). Liz had another massive pile  of ribs this time. Side orders were a very generous plate of pak choi and and a canister of steamed rice. Neither of us actually fancied the rice but our waiter insisted.\n He was a funny one  all the staff were charming and friendly except our waiter, who was quite aloof and dismissive and really couldn't be bothered to answer questions (all the staff are very beautiful  the restaurant could double as a modeling agency).\nWe got complete fireworks when we asked for a doggy bag for the large quantities of leftovers. We don't do takeaway! We don't do takeaway! our waiter insisted emotionally, as if the very suggestion was mortally insulting. OK, this is a very smart restaurant and obviously they want to distance themselves from fast-food joints: point taken (and obviously, Hakkasan is a world away from a takeaway). But there were HUGE amounts of leftovers of very delicious food I was loath to leave behind. However, I am completely averse to making a fuss in restaurants. Not so Liz, who made them very aware that on this occasion they would be doing a doggy bag! So, eventually, I climbed the stairs out clutching my precious hamper of leftovers (much admired by an American tourist). Even our waiter seemed to find the funny side at last.",
                "datePublished": "2009-01-01"
            },
            {
                "reviewId": "IYyInql8ncOcX96h7SVM1Q",
                "author": "Rahul G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great for groups. Modern, underground space. Long bar. Sexy feel with a very Asian sense. A bit like Spice Market in New York, but less kitsch. Food was tasty. Not the best / most authentic Chinese, but everything was full of flavor and nothing dissapointed. Will go back.",
                "datePublished": "2011-10-13"
            },
            {
                "reviewId": "uY42tPkDew6V5wyjXkX2uA",
                "author": "Qype User\n berlin…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "When I called to make reservations, I was a bit baffled: the lady wasn't really that friendly and we could only have a table for 2 hours in total (in our case from 7 till 9 pm). What are they going to do? Tell us to spit out the last bit of food in our mouth and show us the bill? Made the reservations anyway, because one of my friends told me that the Hakkasan is a must. And he was right! To begin with the tight schedule: I don't know how, but we never had the feeling that we had to rush. It was very crowded, but we still enjoyed our privacy. The Asian food was very high-level. We were a party of 5 and the waiter recommended us to all choose something different for starters and main course and share. That worked out fine. It gives the whole evening (oh no, 2 hours) a very communicative and cosy touch. The service was very good anyway: very accurate, not at all obtrusive and very friendly. And somehow they really know how to get you out after 2 hours, without being pushed.\n Prices are fairly high, but for us tourists in London it was a one-time experience that I would not want to have missed out on. The combination of the perfect food, the one-time atmosphere with floral arrangements, without daylight (the restaurant is in a basement) and a very nice combination of hip and stylish elements without forgetting the need for cosiness, makes it to this one-time experience. Although, not that one-time I hope: I will definitely visit this restaurant again! And to be honest: you might want to leave after 2 hours anyway, because otherwise you might be broke by the end of the evening ;-).",
                "datePublished": "2007-10-22"
            },
            {
                "reviewId": "rXW8g38nxQDfducwNIixZg",
                "author": "Qype User\n Gourme…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hakkasan makes Chinese food fashionable. With its sexy black decor and amazing food and cocktails this is a place to take people to impress or be impressed. The food is genuinely very good, I would go so far to say the best Chinese in London. The atmosphere is buzzy and lots of fun as well for a group night out. It doesn't come cheaply, but hey you are in London",
                "datePublished": "2008-09-30"
            },
            {
                "reviewId": "cvj7GgnivbpuDQ9y3pig6w",
                "author": "Qype User\n goochi…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "It's a tricky one, upsides, the food was wonderful, the service good but for me, the downsides were : the bar was very busy and full of trendy media types who like the sound of their own voices, lots of beautiful people wanting to be seen and jostling their way past. Not really my kind of place but can't fault the food. Expensive (but I didn't pay)!",
                "datePublished": "2009-01-16"
            },
            {
                "reviewId": "iuWn90CPJPIGN6vtH7wyHA",
                "author": "Qype User\n cocoal…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This is a very fashon restaurant, is a meeting place for celebrities and it boasts of a superb design, inviting cocktails and a very sophisticated Chinese food. The dishes are well decorated and food is exquisited. The restaurant has soffused lights that create a night atmosphere, I find it very romantic! Maybe the atmosphere is too formal and staff are great! I go there once a month and always experiance a good service!",
                "datePublished": "2008-04-19"
            },
            {
                "reviewId": "x_ymgX-R5Qc2KpGUvQ0T-g",
                "author": "Nicholas F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The food really is top quality - bursting with flavour and creativity. Service is really on the ball. I've been twice in 2009 and all dishes were good. There's a big 'but' unfortunately - the price. With the cheapest wine over £30 and a really nice Duck dish also more than £30, this place is really taking the p*. Fantastic food, ridiculous price - poor value.",
                "datePublished": "2009-02-21"
            },
            {
                "reviewId": "iT5MK3HC554M0RyNzbOaEQ",
                "author": "Anita S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Modern Chinese restaurant (think Mr. Chow).\n*not allowed to take pictures here* oops!\nDirections:\nYou can't get dropped off right at the entrance of this restaurant because its a very skinny alleyway that leads to it. If you get dropped off of Oxford St., walk down Hanway Place and when it forks stay to the left. Go all the way down and the restaurant will be on the left at the end. Go down the flight of stairs and be greeted by a bouncer. \nThe inside of the restaurant is all trendy asianed up. It is actually huge downstairs. I came here for dim sum.  All the items were a modern version of the traditional dim sum (no chicken feet here :( . The best dishes to order are xiao loan bao (I don't know the english name, but if the server doesn't understand you they are steamed pork dumplings that come with the ginger and vinegar sauce on the side). *Also when eating these dumplings, you need to let the soup inside drain out before you put it in your mouth or you will burn your tongue.* I'm not really sure what I ordered, I just asked the waiter for the most popular dishes. Here is what I didn't like: chicken soup and duck egg rolls. The pan fried chicken and shrimp dumplings were okay. I had this sea bass something dish that was interesting and would have been better if there was more sauce. If I go back I would probably skip the dim sum and go straight to their main dishes.\nOkay, again with the desserts in London. Amazing! I don't know what my friends dessert was called, but it was soooo good. It was shapped like flan, but was more like ice cream and came with something similar to peanut brittle on the side. It seems like every place I try, the desserts get better and better. I decided to go the healthy route and ordered an exotic fruit platter (warning its huge!) If you come here, please save room for dessert, its the best part.\nanitaeat.com",
                "datePublished": "2010-12-05"
            },
            {
                "reviewId": "7pxaFnW_fHb57nBUdpw3_Q",
                "author": "Qype User\n greedy…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "For photos see Greedy Diva @ \ngreedydiva.blogspot.com/…\n For his birthday this year, The Peanut Gallery chose to be taken to Hakkasan. I can only guess it is no coincidence that the papers announced the next day that it is the most expensive restaurant, per minute of dining, in London. Uncanny. Hakkasan seems to be one of those places  you'll either love it or you'll hate it. I'm firmly in the love camp. Soaring ceIlings, dim lighting and dramatic, dark wooden decor reminded me of Buddakan in New York. Unlike in New York, where great grub and a spectacular setting often go hand in hand, it's so rare in London for such a fabulous fit out not to mean the food is complete rubbish. I have heard rumours of too cool for school service and door bouncers  there's NOTHING I hate more. Although they're glamorous with some gorgeous kit for uniforms (I'd wear those blue dresses on a night out) we found service at all times to be efficient, but quite friendly and helpful. I suppose the area when you first walk and face the line up in could be a tad intimidating. It feels like entering a night club and you have your name ticked off a list before you even step inside. But we quickly warmed up to it with a few martinis at the bar (lychee for me, classic for the birthday boy). It's fun place for some great cocktails, even if you don't stop for dinner. Once seated (for our strictly 2 hour time slot of feeding  we arrived early to linger at the bar for a while first), we started with prawn toast and a duck salad. The large, bulbous sesame prawn toasts are in a different league to anything I've had in a long while. They're fleshy and sweet, topped with sesame and served with a side of fried seaweed and enoki mushrooms. (£13.50) The crispy duck salad mixes moist strips of duck with crispy fresh greens, pomelo, pine nut and shallots. Very nice, if a tad forgettable. (£19.50) Our main serving of roast duck with Chinese herbs is soon pronounced by TPG, serious duck addict, to be the best he's ever eaten. It's full juicy, fatty flavour is spiced up by some generous seasoning, and the texture of crispy skin against moist juicy meat is spot on. (£21.00) Moist chunks of peppery, stir fried, rib-eye beef with merlot come spilling from a delicate, spindly nest. Again, big flavours and execution is just right. (£18.80)Desserts are artistic creations. Naturally, TPG has the warm coconut rice pudding with mango caviar and black sesame crunch. I have the gorgeous buttermilk bavarois with blood orange jelly and fresh blood orange. (£8.00 each). Both are stunning, with interesting, indulgent flavours  a party in your mouth. Hakkasan, under chef Tong Chee Hwee, has held a Michelin star since 2003. The food is excellent and the atmosphere is buzzing. Yes, Hakkasan is expensive  expect to upwards of £50 per head for food, and prices can of course soar if you get stuck into the cocktails or the wagyu (there's pair of £58 wagyu dishes). However, you can experience the glamour and some great Chinese food for a fraction of the price if you go for dim sum. It's fresh, interesting and the flavours pack some serious punch. I'll be back.",
                "datePublished": "2010-11-08"
            },
            {
                "reviewId": "l3HxobFl59VgYLkgsd-66w",
                "author": "Qype User\n whoop…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Expensive but food it great. However i like to see the food i buy as presentation is really important so gear up the lights a little or we could end up eating something not so pleasant.",
                "datePublished": "2010-11-03"
            },
            {
                "reviewId": "mXjpOcsJ12IGmsF72FKidQ",
                "author": "Qype User\n JujWal…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I went here with some people for work, and was really looking forward to it because of all the hypeand it certainly lived up to it! The food is so delicious and there i such a varied choice on offer. The interior is a bit strange, and slightly claustrophic, but all in all it was a great experience.",
                "datePublished": "2008-06-29"
            },
            {
                "reviewId": "gYmYQ05iMx6JuCzNaEK5yg",
                "author": "Qype User\n Mikael…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Trendy Chinese restaurant. Situated in the basement-level but in a setting worthy of a Jet Li film. The food is great here despite the large size and number of tables in the venue. Especially after matches this is better than pasta!",
                "datePublished": "2008-08-07"
            }
        ]
    },
    "180": {
        "id": "ILyOYUjoKsLmPPlabPnTLQ",
        "name": "Hakkasan",
        "category": "chinese",
        "servesCuisine": "Cantonese",
        "priceRange": "Above £46",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Fitzrovia",
            "streetAddress": "8 Hanway Place\nLondon W1T 1HD\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/nyOKqfVgMGswPqwN1VrkBQ/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7927 7000",
        "review": [
            {
                "reviewId": "XDqBPtmbgcupSk0W84oxbg",
                "author": "Joey M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love this place.  I hadn't been here in 3 years but it was just as enjoyable.  The design/atmosphere really can't be beat.  The cocktail list is exotic and everything I tried was good.  I loved the vegetarian dim sum platter, you get to try a little of everything.  I highly recommend the roasted silver cod with the champagne/honey sauce.  Yum!  Also got the tofu claypot which had a really good sauce.  Ok so things are overpriced but you're paying for the experience, which for me was worth it.",
                "datePublished": "2009-10-09"
            },
            {
                "reviewId": "Ui2-dDy-2hsxMMk5LxqOeg",
                "author": "Qype User\n parcoo…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hakkasan, an Alan Yau's creation. I love it! I love it! I love it! Thats all I can say. The whole experience matches the food and drinks so well. Hoever, one down side is thta it is really expensives and the dishes are quite small portion. Try the duck with caviar and the stir fry venison. They are all great dishes, very tasty indeed. I will try to go more often if I can afford it. I recommend it to everyone. The interior is cool and designer like!",
                "datePublished": "2008-11-28"
            },
            {
                "reviewId": "0SetIuv5fAqjKn7RwuQQVQ",
                "author": "Qype User\n bobste…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is a fabulous place to eat. Gorgeous and atmospheric interior and delicious food. There are definitely lots of people there who are there to be seen but it doesn't take away from the enjoyment of food beautifully prepared. Only thing is that it can be a tad on the expensive side, so it's a great place to go as a treat/for something special.",
                "datePublished": "2008-11-20"
            },
            {
                "reviewId": "tVuzdt1LFBUCukgzepPYeg",
                "author": "Qype User\n prunie…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ignore Michelin - not cos they're wrong about this place but becasue Hakkasan isnt that type of place. It merits a Michelin star but that's not the thing you should focus on. It's actually fairly unpretentious and certainly not stuffy. the best thing to go for is the Dim Sum at lunch. There's a way to do it where you can only pay around £15 a head - just steer clear of the mineral water it's massively expensive. the best dishes to try are the Venison pork puff and all the cheung fun are pretty good. The service is always utterly charming without being OTT. I find the desserts a bit disappointing but overall I would say this is better than Hakkasan.",
                "datePublished": "2008-11-18"
            },
            {
                "reviewId": "TrmTSvsHj1K8xG2CVOHyew",
                "author": "Qype User\n Pand…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is apparently the only Chinese restaurant to be awarded with a michelin star. It is often rated as the best Chinese restaurant in London and maybe deservedly so. This is not your average Chinese eaterie. This is Chinese fine dining style. The food was good, though I can't really remember what we ate which is usually a sign that it wasn't that memorable. The decor is dark and fancy (apparently you can't take pictures here as the owner doesn't want unauthorised pictures of his restaurant circulating around - didn't test this rumour). Our party of four was sat on one of the tables around the sides. Apparently the main tables in the middle were fully booked, but actually it didn't look to me like it would be that nice sat at the tables in the middle. To sum up - good food, dark fancy decor, high prices. Would recommend it just for the experience.",
                "datePublished": "2008-11-18"
            },
            {
                "reviewId": "kMxeb2hK98EUV7tNqbOs0A",
                "author": "Qype User\n yokozu…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Been to Hakkasan only twice in my life. The first time (mid-2004) was shocking, mediocre food, poor servicereally did not intend to go back. Having revisited the restaurant during late August 2008, I'm in a totally different space. What a place! I've eaten in a host on Michelin* places in Europe and the USand this meal was excellent. Sesame prawn toasts, crispy duck salad, hot & sour soup, duck spring rolls, topped off with a couple of bottles of Cloudy Bay Pinot Noir. Excellent. We'll be back.",
                "datePublished": "2008-11-15"
            },
            {
                "reviewId": "fMDPDH-N-SG1voB8LK63BA",
                "author": "Qype User\n Rease…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Love this restaurant, one of my favourites, and not even for the food! The atmosphere grows as the night does so what starts out as lounge type music, builds the vibe as it gets later. It is expensive, but the place is classy and sophisticated. Its obscure entrance, makes it even more exclusive from a ladies point of view, the toilets are extremely grand Drinks selection goes on for days. Always had great service when we come here too.",
                "datePublished": "2008-04-02"
            },
            {
                "reviewId": "0VYKhZGia991dDS5Kp1JHg",
                "author": "furtivos h.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "great drinks, great food, great service\nwith the onset of non-smoking rules, this place has no flaws from my point of view,  it is well worth the money\nwhen it was a smoking ok place, it was pretty hard to tolerate, being underground with no air circulation",
                "datePublished": "2011-02-20"
            },
            {
                "reviewId": "uaj-lpqXgWH5WOtu8evF_g",
                "author": "Foodie N.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This place is chic to be sure. But I had doubts about the food as we walked in. The dimly lit, sexy feel of the place echoed Mr. Chow's or some gimicky Chinese fusion place. And in a way, it IS gimicky, but it's still damn good. You won't come here just for the food - you'll come here for the \"scene\" as well. But we were surprised that this place had the authenticity and deliciousness to back up the scenester vibe. Every dish on the menu is almost as good as the real thing served in Chinatown or Paddington or Bayswater, or even Vancouver, NYC, or LA. The dishes are well presented and tasty, and they should be, because you're paying an arm and a leg for courses that should cost half the amount.  The steamed dim sum was pretty good, as was the stir fried morning glory vegetables, but our favorite was a dish of chicken braised in a clay pot with dark soy, ginger, and vegetables. The flavor of the dish was deep and hearty and very, very satisfying.",
                "datePublished": "2010-05-18"
            },
            {
                "reviewId": "IM6PxDA1mtG5vNEhg_MDMA",
                "author": "Qype User\n foodie…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I am a regular at this restaurant and I must say it is for a good reason. The food is absolutely delicious. Although, it can be a little pricey. The service is excellent and the interior decoration is very good. I simply love the setting.",
                "datePublished": "2008-11-20"
            },
            {
                "reviewId": "WbRyHsxAiJ18Wk7oX_vaBA",
                "author": "Qype User\n lydia…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is a very impressive restaurant. Begin your evening at the cocktail bar, which is an experience in itself, with a host of unusual martinis.\n The food I had was excellent, with probably the best cod I have ever eaten. However, do try to make sure that you don't get carried away with the ordering - which is very easy to do, as you will end up with too much food and a very hefy bill.\n We did have one problem with the wine - once opened and poured, the bottle was taken away from our table and placed in a bucket with several other bottles. Unfortunately, we did not get our bottle back and had to complain.\n Overall, this restaurant is a treat with great cocktails and fabulous food.",
                "datePublished": "2008-11-18"
            },
            {
                "reviewId": "hd9epvlo3aNibHO3hSDzcQ",
                "author": "Qype User\n sincla…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Hakkasan remains one of my favourite venues. Yes it is expensive and yes you need to book but despite the location, the bar/restaurant is exquisite. Both the food and drinks are varied and delicious. I would however add that it is recently under new management and my last visit was disappointing on all fronts - but i am hoping that was a one off.",
                "datePublished": "2008-01-30"
            },
            {
                "reviewId": "fOAl-ILo4DwURq4XRa6aSw",
                "author": "Fazan K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "uber cool place very dark lighting which gives it its coolness great place to impress and just forget wat time it is.",
                "datePublished": "2009-04-24"
            },
            {
                "reviewId": "c1kKy4vENdH14eiT6_JBbQ",
                "author": "Qype User\n razia_…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great asian restaurant\n £36 - five persons, multiple dim sum dishes",
                "datePublished": "2007-09-24"
            },
            {
                "reviewId": "Ib7QCttGwWjHmkAtyLuAJw",
                "author": "Qype User\n London…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "No hype this is the one. Consistant quality. Impecable staff and terrific Ambience. Some say it's too dark but my take is the dim light gives you more chance to savour the flavour of the cuisine. This is what I think they are trying to acheve and I believe they succced. Bar staff are terrific and seem to get it just right even when you take clients and try to impress ( I admit my Vodka knowledge is lacking..OK Jake its crap.) Top Dishes : Silver Cod, Vggie Chicken (love regular but this is terrific. No1 's Dish Tofu and Beef. Loved the Miami branch but it's just not London!",
                "datePublished": "2010-06-30"
            },
            {
                "reviewId": "lg9cpZGLAAxOoFa0BhGxQQ",
                "author": "Melissa W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Hakkasan is a Michelin star rated Chinese fusion restaurant located down a back alley in Central London. You  would not know it was there unless you were specifically looking for it. Hakkasan is not reliant on pedestrian traffic and yet it can be difficult to get a reservation. There is actually a dress code and formal shoes are required. If you are going to spend this kind of money on a meal you should dress up and make an effort anyway. Do make sure to bring the credit card with you because this is an extremely ridiculously expensive restaurant. The food is amazing and the atmosphere is romantic. If you work it right you will be too drunk at the end of the meal to care about the price.  It is rated number 19 out of the 50 best restaurants in the WORLD not just London. I think going to restaurants you can't really afford makes for a memorable and more appreciated night reserved for birthdays and anniversaries. When was the last memorable meal you had at Nandos?",
                "datePublished": "2008-12-04"
            },
            {
                "reviewId": "Ak_52Qr-v1fsjtcUBf7L4Q",
                "author": "Suzie V.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Please get the Duck Salad when if you get a chance to come here.  I still dream about it....",
                "datePublished": "2009-03-30"
            },
            {
                "reviewId": "ZnMst0eH_N3-KAWctdz3rw",
                "author": "Qype User\n boxerg…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "trendy chinese restaurant, great food, great decor, great cocktails at the bar, quite pricey though, 200 pounds for dinner for tow must be the norm, the food is beautifully presented on the plate and melts into your mouth",
                "datePublished": "2008-11-16"
            },
            {
                "reviewId": "x1j8il9nYuD7Vm-3FlpDnw",
                "author": "Qype User\n sianpi…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "delectable dining, hidden away from the hustle and bustle of w1. dark, delicious interior with fantastic lighting, professional service, sleek design and, most importantly, divine dishes that will raise the bar when it comes to 21st century chinese cuisine.",
                "datePublished": "2009-03-27"
            },
            {
                "reviewId": "ZMoNerz6SY6t1pa5jIPzIg",
                "author": "Qype User\n Rumina…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I tried this out on a Friday night. We had pre-booked a table but still had to wait 20mins at the bar until one was ready which was a bit annoying. The food (asian) is fantastic. The duck, which I am not normally a fan of generally, was really tender and tasty and I would definitely recommend it. Best to get dishes to share on the table with your friends so you get to try lots of things. Had heard previously it was riduculously expensive so was surprised when it came to about £40 a head (I thought it would be double). The items on the menu really vary in price - you have some mains for £15 and some for £60 so I guess it depends on what you order.",
                "datePublished": "2009-01-25"
            }
        ]
    }
}