{
    "0": {
        "id": "0K0ExQLHdU6RsxGLP0YA6Q",
        "name": "Wong Kei Restaurant",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "41-43 Wardour Street\nLondon W1D 6PY\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/FRS766QUY4JPHIC8Hpi44A/o.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7437 8408",
        "review": [
            {
                "reviewId": "TJzOqttn2EVsFqb7VHTang",
                "author": "Adrian Permata S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "In my younger days when lunch choices consisted of Soho's wide range of eateries as opposed to today's regimented packed lunches, there was one spot that was a consistent favourite. Wong Kei. This evening after a long day at work followed by a lengthy meeting and beer, I decided to revisit my favourite old haunt. It's as good as ever. I ordered my standard:\n- Ho fun with beef and scrambled egg\nIt is a dish that sums up my love for the restaurant; hearty, authentic, homestyle cooking that will fill you up on a budget with the finest of ingredients - simplicity. There is nothing fancy about a plate of wet noodles with a generous helping of tender beef and eggs. Its taste is mildly salty with a slight spring onion sweetness and there isn't much else to it. What you get however is a sense of warmth and comfort with every bite that few other places can offer at its price point. Wong Kei has long been infamous for its abrasive staff and unassuming environment (both things I have no problems with personally) but in dishes such as this, it provides care in the way it feeds you. It in some ways encapsulates the very Chinese way of expressing love without words and not many people appreciate that, or open themselves up to notice such things at places like this.\nI will forever love this place and hope it stays forever. As a little pro tip, this has to be consumed eating in to make use of the plentiful chilli oil crucial to this dish and for that rarest of perks by today's standards: free tea.\nWong Kei, please don't change.",
                "datePublished": "2018-09-25"
            },
            {
                "reviewId": "O5snVyfiwspiPnK8A2nTmg",
                "author": "Margaret L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "After going through yelp and tripadvisor, I wanted to try a Chinese restaurant in London. This place was definitely very popular on tripadvisor and people describe this as good food but bad service. So that's what I think of authentic Chinese food - good food but lack of service is normal! \nSo I decided to check out this place since we were in this area and I heard lots about it. The menu has lots of different choices and variety. We ordered the fu-king fried rice, malaysian noodles. The food came out and I wasn't amazed by it. It was your typical Chinese food. I am not really sure if I like it enough to come back though. Everyone seemed to really love this place and the food but the food doesn't live up to the hype.\nSo bleh. Just Chinese food.\nAlso, I was surprised we had shared tables. So if you have a small party, they might sit you with a shared table, I don't know how common it is in London? I see shared tables as a norm in Asia/China though but not usually that common in America.",
                "datePublished": "2018-06-10"
            },
            {
                "reviewId": "_lUmJI1XQjDyW-xX5Gcl7g",
                "author": "Ed C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Ordered Sichuan Prawns and Singapore Rice Noodles. Both were amazing.  Cash Only establishment.",
                "datePublished": "2018-10-17"
            },
            {
                "reviewId": "6FfjrkxhR3AJdvkuWxYN4w",
                "author": "Shirley B.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Wong Kei is one of the many options you'll find in the heart of London's Chinatown. There are several floors, and someone will direct you to a table. \nFood: It's simple and straightforward. The roasts hanging in their window are done well - duck, BBQ pork, roast pork. I had the pork and century egg congee, with a side of roast park. Congee was full of meat and egg, and had the right amount of ginger. The roast pork was fresh, with a crispy skin, and the meat was tender and not dry. \nService: Food comes out quickly, and you'll be left alone to enjoy it. Reasonably attentive if you need something. \nCost: The two items with tea cost me £17.50. \nOverall: It isn't fancy, but it does offer some decent food at decent prices.",
                "datePublished": "2017-06-17"
            },
            {
                "reviewId": "UaRoB1n7aH0VMa6EPVKESQ",
                "author": "佳穎",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "One of the worst experience in a restaurant in my life. Both the food and the service, we have one friend who just had an injury on her leg so we asked if we can eat at the ground floor to avoid climbing the stairs. The waiter rudely checked my friend's leg to see if I am lying, we almost left because of it. \nIn the end my friend didn't want to ruin the mood so we still stay. Fortunately we sat at the ground floor as we asked but one of the guy in the counter gave us a disgust look. ( there were plenty of sits in the restaurant at the time we were really unsure why they make it so difficult) \nThe food was as terrible as the service, the rice was cooked with just too much water, the rice stick together like a rice ball, we didn't finish the rice. The grilled duck I had was ok but not crispy at all if you are looking for authentic Cantonese cuisine. The waiter who helped us to order was nice though, but the food and the main service is horrible. Skip this place if you can.",
                "datePublished": "2018-06-18"
            },
            {
                "reviewId": "Qzl2z4HnZkTBx_Ho7r8Ekg",
                "author": "Tom T.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Worse restaurant I have been to. No service.Roast duck rice was full of fat.",
                "datePublished": "2018-01-11"
            },
            {
                "reviewId": "3tECRENKhPlUjYXQrFNanA",
                "author": "Long C.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "The worst food experience while I was traveling in London. I would skip and look elsewhere if possible. \nHere are a few things to expect while you eat here:\n1. The staff do not care about you. \n2. Everybody is expected to order one item even though you're not hungry or they just charge you at a random amount to make it up. \n3. Food is just alright.\n4. I saw the staff legit yelled at customers for asking questions about the menu. \n5. The staff also swore at some nice elderly people. Wtf? What is wrong with them?\nHowever if you're into a bowl of lukewarm wonton soup for roughly £6, this is your place. \nI made a bad decision for coming here. The staff should be fired.",
                "datePublished": "2017-12-22"
            },
            {
                "reviewId": "AVL2rcN0IIrop-BFAW2_IQ",
                "author": "Jess P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I stupidly ordered wrong but the nice guy on the phone gave me the noodles i wanted AND let me keep the wrong order. 8/10 will come again but very expensive in  comparison to other local Chinese takeaways",
                "datePublished": "2018-06-01"
            },
            {
                "reviewId": "rGnOfxZ17zFO3GfmuCVhTw",
                "author": "Yuen P L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Wong Kei is notorious amongst local Chinese for serving cheap traditional Chinese food fast with rash (i.e. rude service) in very simple (i.e. old and down-trodden) surroundings. The colours on dishes and tea sets may be worn, I have found lipstick on a cup before, hair on the plate of food, etc. \nHaving grown up in London and been a frequent visitor of Chinatown I have known what to come to expect of Wong Kei, and that is not to expect much in terms of quality but you can be fed with speed and at low prices compared to all its competitors in Chinatown. \nMany locals can feel at ease eating here even on their own (unless you feel embarrassed to have anyone you know spot you eating here). It is basically cheap (and not so cheerful) but it does its job and has served a useful purpose in London's Chinatown for many decades.",
                "datePublished": "2016-05-06"
            },
            {
                "reviewId": "16gU5X-Y_M6Q861w9iWIiA",
                "author": "Wayne H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Pretty standard chinese food. Was a little confusing being told where to go and where to get seated at first. I ordered a rice plate with barbecue meats (pork belly, pork), which should have been the fastest dish at my table, since the bbq meats are cold and just placed on top of the rice, but for some reason my plate was the last to reach the table by far. A good amount of meat and a good amount of sauce over rice for a standard dinner. Prices are pretty decent too, I think around 6 pounds for my plate. Cash only.",
                "datePublished": "2017-02-03"
            },
            {
                "reviewId": "RC3vP4HWD7raZshVpxWHjg",
                "author": "Sun L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "--- American tourist ----\nWong Kei is A very  typical old fashion Chinatown restaurant. Very old furniture, very working class, not trendy, not cool, \"you get the best value here\" attitude of service. BUT I highly recommend it!\n1. Price is damn good for most chow fun, fried noodles and soup noodles. Cheaper than the United States Chinatown in NY and SF. For other dishes, prices are average NOT cheap.\n2. Roast duck is very good but NOT as good as Four Seasons around the corner which still has the BEST duck in London!  Half duck with NO bone is 11.5 pounds at Wong compared to 14.5 pounds with NO bone at Four (number may be off slightly but conclusion is the same). If you want the best duck, go to FOUR.\n3. The wonton soup at Wong is average. Soup is meaty, little salty and not clear, not very tasty. Good wonton soup should be clear and strong with seafood (shrimp) taste. Wonton itself is average average although each one has a big piece of shrimp! It could have some MSG in it and it will taste a lot better!\n4. Beef stew flat noodle soup is not bad and it is very vinegary. This type of strew is not common in Cantonese style. \n5. Tea is FREE.\nBathroom is acceptable marginally. Service is ok, not great.\nBottom line, good authentic Cantonese noodles restaurant BUT with very affordable prices earns Wong Kei  ****.\nCASH ONLY, BUDDY!",
                "datePublished": "2017-01-13"
            },
            {
                "reviewId": "PKFDSO5CRl0AEJ8HFsbK6Q",
                "author": "Janae Y.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I've tasted fantastic Chinese food and this place definitely is NOT fantastic Chinese food. \nWe ordered beef ho fun noodle and wonton soup noodles and they were both subpar, according to my Hong Kong parents. The table next to us was eating Peking duck, and the duck looked like it had been hacked by an amateur. \nService is where it gets bad. They looked mad when we asked for extra bowls and chopsticks. And, when we asked to \"add tea\", the waiter looked at us in disbelief and said \"add tea??\" He then took away our tea pot and didn't return it for the duration of our meal. \nWhat kind of Chinese restaurant is surprised that it's customers drink tea? Tea is like, all Chinese people drink. \nFinally, the servers got mad when we walked up to the counter to pay, as if they were afraid we were going to run. As we left, a server was arguing with a customer, who yelled that the server \"didn't know how to treat women.\" The server just stood smugly at the door with his arms crossed and didn't let those customers in. We didn't get the whole deets but you get the point, service is terrible. \nTo be honest, when I look back at this experience, it's so ridiculous it's funny.",
                "datePublished": "2016-12-17"
            },
            {
                "reviewId": "cG_7Eg3vHoczAB8t70v5jA",
                "author": "Christine C.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "This is probably the worst Chinese restaurant. The waitress is so rude. The service is really bad. What she wants is for customers to leave fast, which she makes it really clear to us. I know it is rush hour but she lets us share a table with a group of other customers. We did not enjoy our lunch there as the atmosphere is uneasy and awkward. \nAs for the food, the sour soup is really really bad, slimy and disgusting and cold. If you want the real Chinese cuisine, do not come to this place as it is so not representative.",
                "datePublished": "2018-02-18"
            },
            {
                "reviewId": "Q393LvrYKu6uhcX7nZcfEg",
                "author": "L H.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "If there were a zero rating, this place would get it. We made a bad choice going here. We saw the young waitress become impatient, and shout at 4 older Asian women who were ordering their food and asking questions. Our food was okay only. We failed to notice the great little Viet restaurant across from Wong Kei where we had Pho the next day! Give this a miss, it's not worth it to spend any money here. I wonder at how such young women waitresses could be so angry and hate their jobs, perhaps they are not paid well and with their service they likely don't get tips!",
                "datePublished": "2018-05-27"
            },
            {
                "reviewId": "FpzyGwazbXUvhwuAZV3dZA",
                "author": "Chrystel K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Whenever I am feeling starving this is my go to place. Cheap and quick authentic Chinese food. Portion sizes are huge and it's perfect for large groups. \nBe prepared that if you go by yourself or with someone else that you get seated with other smaller groups. The menu is extensive and you really are spoilt for choice! Whatever you pick it's all delicious. \nMy dishes of choice are always Singapore noodles, Pork chop and Aubergine on boiled rice, or Braised Brisket of beef on boiled rice. \nFree unlimited Chinese tea and quick service! Remember Cash Only.",
                "datePublished": "2016-11-13"
            },
            {
                "reviewId": "6QFL_vS0lSFPfOynRq5C_Q",
                "author": "James Y.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Walked into this restaurant on our honeymoon with my Chinese-Canadian husband at which time we were promptly seated upstairs with the rest of the non-Asian people (I am white Canadian) and were immediately and absolutely appalled at this racial segregation in 2017!! The floors stunk of chlorine going upstairs. Then we were seated at a \"shared table\" when there were plenty of smaller tables for 2 downstairs. There were also tables of 4 upstairs which I was told when we asked to be seated alone. We were on our honeymoon after all. We walked out, absolutely appalled by this service. This separation would never happen in a Canadian Chinatown. Disgusting - what way to turn away customers.  No matter how good the food, this is not ethically ok and clearly for appearances sake only. This restaurant should be ashamed of its behaviour.",
                "datePublished": "2017-07-20"
            },
            {
                "reviewId": "kAsO_lcWw8eZmAagR2YkLA",
                "author": "Tracey S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ok I can't fault this restaurant other than their too-hilarious-to-be-mad-at-them shoddy service. \nLuckily I was armed with the knowledge of very low expectations over the service and the expectation of being very disappointed, that I thought nothing would surprise me but boy, I so wasn't ready for this lol!  \nWhen we first arrived I scanned the room and took in the working class Chinese man's cafe tables, and thought okay... not complaining. I'm only here for the food! and then I looked over at the gaggle of staff hanging around the bar and then one stuck two fingers at me lazily (basically indicating a table for two) and I said yes and then he waved us off in the direction of the stairs. He didn't escort us upstairs nor did he come to the front to greet us. It felt very self service, almost empowering :D \nWe then helped ourselves to the best table of 4 after realising there weren't a table for 2 around but the waitress hurriedly ushered us to a 'table for two' which we later realised was a shared table with another two customers!!!?? I tried to protest but in vain as the waitress was having none of it. Honestly, the whole concept of customers are always right and you must prioritise customer's needs before anything else are completely foreign to these people. \nThe other two customers were as surprised as we were but later whispered that at least we all got into the exclusive dining area normally reserved for Chinese folks and as a Chinese myself, I got my non asian friend a free pass to the exclusive club which had linen covered tables with comfy enough seats compared to the greasy cheap looking mish mash of tables and chairs downstairs.\nWe were so fortunate that our fellow neighbours were such cool peeps and abit like the shared benches in Wagamama, we were like 'can you pass the soya sauce please?' etc. I mean I totally would've shared their food too (if they'd let me). Totally. Love the fact that Wong Kei forces us to interact with complete strangers. Such a unique perk. Also they know the issues with London's first world problems in their lack of communication with one another and has set itself on a mission to break these barriers. ;-) So admirable!\nOur neighbours even helpfully smacked down some annoying flies and wiped it off the table for us. :') The flies acted as a bonus decoration ;-) The authenticity in this restaurant to the Far East is so in tune. You want abit of China? Go to Wong Kei!!  \nIf a food restaurant other than your typical Mcdonald's and Burger King, offers a drive through speedy service then this is it! The whole service was comparable to a factory conveyer belt. Time is precious and every second counts despite the fact that the restaurant was half empty with ample amounts of unoccupied tables and chairs scattered across the floor. Compared to your typical Chinatown establishment, this one takes the prawn cracker! As soon as we were seated and handed our menus, a waitress hovered above waiting to take our order (like less than a minute after we sat down). When I asked her to come back in a few minutes, the look on her face was utter shock. Truly funny to see. Honestly our table was wicked. We interacted with our neighbours and made such jokes that the same waitress came back looking horrified with nose flaring, that we were enjoying ourselves lol. \nNow onto the food. This is what I came for. Prices have gone up ever so slightly since well, the last recorded menu prices online) but still remain ahead of competition in terms of value, portion and quality. We had hearty meals of won ton noodle soup which was laden with won ton dumplings that when I finally demolished those meat parcels, I was actually surprised to see noodles underneath it! For a fiver, it truly was the epitome of eastern comfort food like bangers and mash is to English folks. For the side, we opted for bean curd with chilli and salt. I would totally recommend it to anyone because once you try it, you can't stop! Might need some water at hand because they don't use that msg sparingly!! \nService is quick. You're in and out of there like fast food. In fact so quick you needn't worry about time. What they lack in service they more than abundantly made up for in quality and quantity of food.\nQuestion of whether you're genuinely welcomed sits in the balance. Service charge is optional (thank goodness!!) and the waitress counted the money at our table (quite insecurely) after hovering nearby for a while whilst we emptied coins from our purses lol! Not to forget that the tea is freeeeee!  \nComing here is an experience onto itself like a ghost ride in a theme park. You love to hate it. All in all, I'd definitely be coming back here in a rush!",
                "datePublished": "2016-04-30"
            },
            {
                "reviewId": "lcjnM4Bjv56JRPG-UTdPtg",
                "author": "Joan Z.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "The worst restaurant I have ever been to in my life, I would give a 0 stars if I could. Service was appallingly rude and barely even acknowledged us, and the food wasn't much better. A few of the waiters even went out of their way to make our experience miserable once we complained. PLEASE DON'T BRING YOUR BUSINESS HERE.",
                "datePublished": "2017-08-21"
            },
            {
                "reviewId": "ZWk_kDumccJK6_09GzqIyw",
                "author": "Cocobe L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I have a dear friend in London who recommended this place, as I walked in I thought this could be a big mistake but I took the plunge....OMG this was horrible .. Not for localvores aka organic eaters.... I fear I will regret this later!\nMy stomach went upside down with the tea, I knew I was in the wrong place for my tastes....cheap food and boy you can taste it.\nI made it through the night, .. This place is well worth the experience, cheap Chinese.. Gotta  love it. The fried chicken is so salty and pressed dry like a salt dish bomb #195 ... The sweet n sour pork # 79 or 78 was boney like waitress said would be ... Quite tasty but pineapple was so canned, I knew if I did not stop I would not do well later. Would not trade the memory or experience for the world, total must do at least  once. Thanks Abigal....",
                "datePublished": "2016-05-23"
            },
            {
                "reviewId": "uDzfAabKx-_Utn0bxNmBGA",
                "author": "Angelica C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Cash only.\nCheap Chinese food. They almost pride themselves about being rude.  Waiter looks at me and says, \"dap toi, share table!\" \nI was lucky enough to sit next to someone who's mentally unstable.....fun...entertaining. He was talking to himself the whole time!\nI don't care. Craving cheap Chinese food... And yes, I'm sick of fine dining.\nHad duck over rice. Blah. 3 stars only because I didn't get sick. £5.50 which is cheap, considering I've been having £40 meals all week.",
                "datePublished": "2015-01-09"
            }
        ]
    },
    "20": {
        "id": "0K0ExQLHdU6RsxGLP0YA6Q",
        "name": "Wong Kei Restaurant",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "41-43 Wardour Street\nLondon W1D 6PY\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jLJ3GwUb1kcFBuwCVteIxg/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7437 8408",
        "review": [
            {
                "reviewId": "LNdtrc02cVanuRR5psSHmQ",
                "author": "Rich B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Wong Kei used to be a go-to place for me when visiting London in my youth. It was a good place for a quick, reliable meal to start or end an evening in the pubs around Covent Garden and Leicester Square.\nVisiting London again, I thought it would be good to renew my acquaintance with the place after what must be 15 years, particularly because I was traveling with a friend who grew up in Hong Kong - I was keen to get his take on the experience.\nI am glad to say Wong Kei did not disappoint after all this time. Apart from the staff's fun uniform t-shirts, everything else was exactly as I remember it. The brisk, efficient service was as unfriendly as ever. The plastic bowls and flatware was as classy as ever. The seating arrangements were as communal as ever. But best of all, the food was as tasty and good value as ever. I was always a fan, and I still am.",
                "datePublished": "2016-09-21"
            },
            {
                "reviewId": "qHifhDt1bNpMo-9OZzT5UQ",
                "author": "Anthony R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "As soon as you walk in, they tell you to go upstairs!\nThis place was great. I was warned ahead of time that the service would be awful, but that wasn't really my experience at all.\nThe food was dirt cheap, tasted great, had huge portion sizes, and came quickly. The servers aren't necessarily super attentive or overwhelmingly chatty, but who cares? They brought my delicious and reasonably priced chinese food to me quickly. That's all I cared about. I would recommend this place and go again.\nThey only take cash, I didn't know this beforehand but there's an ATM/cash machine a block away so it wasn't a big deal to run and grab some cash money!",
                "datePublished": "2016-06-26"
            },
            {
                "reviewId": "Nc15luK3h9AhVEAu6jQoew",
                "author": "Jennifer F.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This is your typical Chinatown restaurant, and if you're looking for that sort of vibe, this is perfect for you and your friends! I was asked to meet a few friends here from Hong Kong for dinner before we went to the theatre. They heard it was famous for their bad reputation so they wanted to try it. I personally do not understand why they came all the way from Hong Kong to the UK to have Chinese food, but there is neither here or there. \nFood: If there's food in front of me, I'll eat it! I completely forgot what we ordered, but my friend pouted and said they all looked the same: stir-fried bbq pork, stir-fried vegetables, stir-fried a whole bunch of stuff and deep-fried tofu with chillies. Whatever we ordered, it came quickly and that was a good thing for us because we were in a hurry.\nAtmosphere: It has a typical Chinese cafe-style atmosphere: busy, tacky oriental art, and a slight layer of grease on the wall that comes with a dive like so. Where the chairs are from an 80's diner and the plastic cutlery and crockery has been used so much, their logo is wearing off. If you're looking for 5 star dinning, you've come to the wrong place. If you're looking for fast, cheap eats, look no further than this lovely dive full of oriental tourists getting upset that it's not up to par with their home cooking or Chinese students that miss home and did not want to have instant noodles tonight. \nService: The service wasn't that bad. I do want to say, it was surprisingly good based on their bad reputation. We walked in, told them how many people and were seated accordingly. In typical Chinese fashion, sometimes you may need to wave them down to get some service, but I feel that is the norm for busy restaurants.",
                "datePublished": "2014-10-18"
            },
            {
                "reviewId": "YCPfYDpRa-Ny51FVIcqn1g",
                "author": "Harry B.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I first went to Wong Kei in 1984 back when it was in its peak \"HOW MANY YOU?  UPSTAIR.\" mode and ate here at least once a week when I still lived in London. I've lived overseas for a good few years but always make a point to visit WK when I'm back in London. The dishes had no change over the years at all: a good thing. March 2017, my first trip back since 2010, and the taste is much the same but now you can't order off menu and the portions are smaller. Also, the mixed meat chow ho fun didn't have liver in, which while not everyone's favorite did make it tastier. I'll always come back but the incredibly solid consistency has gone; it was a good run...",
                "datePublished": "2017-03-27"
            },
            {
                "reviewId": "bdjTlrXRHKk7TaebA660fQ",
                "author": "Tim G.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "UPSTAIRS! Yells the wait staff for a bunch of tourists who are apparently here for the insults and terrible service. Wong Kei reminds me of a place back in San Francisco where a very famous waiter (Edsel Ford Fung of Sam Wo Restaurant) would insult unsuspecting patrons for not tipping, spit in people's food, and slamming food on the table.\nI figured with the curt treatment the place is a cheap, no frills, get in and GTFO kind of place the moment I stepped in. I didn't even need to read the Yelp reviews to know that I'm going here just for the food and not fancy table service. As soon as I enter, the waiter acknowledges me and tells me to share a table downstairs. Not even seconds later I'm asked if I know what I want. I politely asked for a menu and was given one instantly. That probably my first mistake. You should already know what you want. They run a very tight ship here and I was put on the spot like on the episode of Seinfeld where the Soup Nazi was scolding patrons for taking too long in the soup line and sent to the back for not following his rules. I settled on the roast duck noodle soup and it came faster than you can say, \"Long live the queen\". The food was delicious, the service was meh. The locals seem to come here a lot and don't mind. I really didn't mind since I've experience much worst service in the past. \nThe prices here are so ridiculously cheap that you're getting a great deal. There is no service charge and VAT is already included. Cash only!",
                "datePublished": "2016-06-21"
            },
            {
                "reviewId": "nJA5G5e8bZLTZxlmXymuYw",
                "author": "Stewart S.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Generous portion with below average's quality of food. Prices are very reasonable but don't expect to have good quality of food.",
                "datePublished": "2017-11-22"
            },
            {
                "reviewId": "5wIQdL9jxL4kAKm-dxwQQw",
                "author": "Francesca B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "If you want fast, good quality, delicious Chinese food, Wong Kei's is the place in China Town for you!\nStick to something simple and it's delicious - I can highly recommend the half/quarter crispy aromatic duck with pancakes (delicious!), the salt and pepper (chilli) deep fried squid is delicious.\nThe noodle soup with beef brisket or pork is also really yummy, full of flavour and meat.\nThe portion sizes here are great and you certainly won't leave hungry.\nYou should definitely try and sit on the ground floor as it's more open and airy than the upstairs floors. I love it in here, and even though the staff aren't overly friendly, if you're polite and thankful to them, they are actually very friendly back! \nDefinitely check out Wong Kei's, especially because of the delicious food and GREAT PRICES!!! Enjoy!!!!!!!!!!",
                "datePublished": "2016-04-18"
            },
            {
                "reviewId": "lKh4LYgA40dZXOe7Tkm3zQ",
                "author": "A S.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Since my last visit here, the Wong Kei has certainly not lost none any of its endearing charm. To be fair, there was a little less \"throw it at you\" on this ocassion but trying to engage in conversation with any of the staff proved to be a rather pointless task.\nAnyway, food is just about ok, it could be my age but all the dishes seem to be merging into one another. \nHad it not have been for some ridiculous \"one way pedestrian\" crowd control system on Chinese New Year, we would probably have ventured further down Gerrard Street.",
                "datePublished": "2015-02-23"
            },
            {
                "reviewId": "2wYMse5zh2RgxNBorF8CIA",
                "author": "Laura C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Looking for a rough and ready Chinese served at lightning speed at rock bottom prices? Hit up Wong Kei. \nHaving gained a (somewhat deserved) reputation for its scornful staff slamming down your dishes, disappointingly, it wasn't the case this time. They were fine - not friendly exactly but civil. \nAlthough, we were smelling distance from the toilets. Oh, and one of our tea cups had a faint lipstick stain smeared on it. \nBut, hang on a sec because there're some good points too. The food is tasty. And it's dead cheap. Like £5.50 for a huge plate of heartwarming crispy noodles, tender beef and crunchy pak choi.\nFor that price, I'd almost expect a bit of old lippy on the crockery. \nGive it a go, if you dare - an essential London experience.",
                "datePublished": "2016-01-29"
            },
            {
                "reviewId": "2chfmA7dHLd0r8rredKoZA",
                "author": "Roberto G.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "We walked in the establishment and were directed upstairs. We were a party of four. Coming from the west, we wanted more of the traditional dishes we were used to. We ordered starters and the RUDE staff did not want to let us keep the menu to order entrees. We did not feel welcomed and were under the impression that they wanted us to get the f%^*+ out. ALL of the staff was rude. Very very difficult and did not want to try and meet our needs. \nHowever the food was very tasty and the Singapore noodles were great.\nThe stars are solely for the taste of the food. This restaurant could easily be a 5 star place if the staff would change their attitudes. \nAverage priced. \nVery old fashioned decorations. \nBathrooms were somewhat clean.",
                "datePublished": "2017-03-29"
            },
            {
                "reviewId": "khMYVuVXwTx3hgkrMgTu9w",
                "author": "Qype User\n tomcoo…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Wonky's",
                "datePublished": "2008-05-19"
            },
            {
                "reviewId": "lr4q7hlzOcgnil3pRnIkSw",
                "author": "Samuel A.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Low price casual eatery with plates £5-8 and complimentary tea with equally cheap casual deco and free sullen service. Crispy fried noodles disappointing, soggy non-crispy noodles, weak gravy, fish balls flat compressed bland. Dry beef hor fun much better, tasty and fragrant though greasy. This dish just saved from otherwise lower rating.",
                "datePublished": "2016-04-23"
            },
            {
                "reviewId": "N6RDvsDJdfcHjxfeUOlShQ",
                "author": "Steve B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Wong Kei used to be infamous for cheap, filling Chinese food and rude waiters who would scold you and it was all part of the fun. I used to go as a student a long time ago and so it's officially a London eating 'institution' in my book. For me, the brusqueness of the staff translates to efficiency which I would take any day over ineptitude and slowness which drives me mad.\nIt was the first time I've been back since the re-opening or new management or whatever happened. On this occasion I was dining solo (always a good spot for solo dining) and was immediately directed to one of the solo dining tables right in the entrance area. The waiter came straight over and asked me what I wanted. I kind of like that, taking me for a regular because if I did know, I would just say right away. I asked for a menu instead since it had been a while...\nI ordered a wonton soup and singapore noodles. Pretty straightforward.\nMy order came quickly and I was surprised to see that the wonton soup was a large bowlful with plenty of wontons which were really good. Prawn and pork, freshly made with big chunks of prawn with a good ginger note. It made me think how good this was especially for the price around £3.50 vs the £11 bowls of ramen noodles that have sprung up everywhere (was never comfortable with paying £11 for a bowl of soup noodles).\nSingapore noodles also didn't scrimp on the meat and shrimp and a good sized portion. A bit overly salty not helped by the salty soup but overall solid.\nComplimentary tea.\nSo. If in the mood for a quick spot of Chinese in the centre of town and want to get served quickly with no hype and no queues then come here.\nGreat value and good food. Still love Wong Kei and the quality seemed better than before.",
                "datePublished": "2014-10-24"
            },
            {
                "reviewId": "bRIF9bEIM7radNjBuIyuvg",
                "author": "Joyce V.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "When you wind your way up the stairs of Wong Kei, you'll realise that this sprawling plaza of a place is truly labyrinthian and equally the stuff of food based nightmares. \nThe food as you may know, is not really Wong Kei's selling point, as much as it is a masochistic tourist attraction; the town's hottest perturbing immersive theatrical experience you'll ever go to or like surprise speed dating for sadists. \nNormally when entering a restaurant, a server will acknowledge your party and seat all three or two or four of you at an accommodating table. Here you'll be shoved into any seat anywhere, separated from your group like Nemo from his family and left to flounder and eat awkwardly in front of strangers, four flights away, up into an adjoining space in what seems like breaking into or being smuggled into an open-plan office block/ come restaurant floor next door to sit with said random people, whilst you're left to recount your steps and your experiences thus far. \nOn being escorted away from my dining companions, I'd have lost my mates if I hadn't grabbed a discarded prawn cracker at a nearby table and left a Hansel and Gretel-like trail back to them. \nSo, I ended up joining an adjoining end of table, table. On my own, within waving distance of one of my friends, but I had to muscle in on another couple who had been lucky enough to sit together. \nIt took sometime to get a waiter's attention, but it didn't take long to realise that the couple I'd been proffered to give my services to as a third wheel and Capering Gooseberry, had not just been stuck for conversation, but were simply too frightened to ask for; water, a napkin or anything else you'd usually expect at a restaurant. \nFinally a waiter, dashed to my attention. \n\"Drink?\"\nJust as I flicked my eyes down to the menu to enquire, he was off. Fed up by my too long split second hesitation. \nThe food came quickly, in fact when it did arrive it almost hit the linen before the plates did. \n\"Noodles\", my waiter announced. *Slam* \"Chilli Beef\" *Slam*. Down went the bowls, whilst before they hit the table, the broth defied gravity remaining in mid-air and began cooling from the gust of wind created from the clipped turn of my waiter's back again.\nHe'd gone! Thank Christ, but I'd still not ordered my drink. I saw a couple of my friends separated over on two other tables making perplexed gestures to me in nervous fits of laughter. I thought they were having a good time, but I was to discover their waitress did not linger, who's laconic tone implied she too could give even less of a rat's rear about my or their whining on about being thirsty. In the end she abandoned herself from their table for mine, offered me a drinks menu and rolled her eyes so hard I thought it'd affect the gravitational pull of the moon.  So I did the darnedest of things and ordered what was to be a flat sodding cola. \nWell, if you must hanker for Anglicised greasy run of the mill Chinese food, go here, go simply for the terrifying experience and GO ON, GET OMLETTE AND CHIPS I DARE YOU!",
                "datePublished": "2015-10-08"
            },
            {
                "reviewId": "kAs5DHqZuN83ssNUcp0hAQ",
                "author": "Thomas N.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A true classic. Busy busy , authentic cooking. Great ambience, very much at the heart of a Chinatown experience. Have been here since 1987 at regular intervals.",
                "datePublished": "2016-02-17"
            },
            {
                "reviewId": "k4S6Wg0u3ny81-WJI1qhZQ",
                "author": "Ellen Y.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Like the other reviews have said, the workers are not exactly the most welcoming or helpful and at times rude. As a first-timer at Wong Kei who was a little overwhelmed at the many choices, a waiter came over after 2 minutes of seating us told us to stop wasting her time when we couldn't tell her what we wanted to order, even though the restaurant wasn't packed. But regardless, we were starving, and the food came quickly, was cheap but a good value for the huge portions, and tasted decent enough for poor college students in London. \nRestaurant is cash only!",
                "datePublished": "2015-11-24"
            },
            {
                "reviewId": "I5yQwkPhQ6hRTFanaOD4WQ",
                "author": "Kai R.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "** Cash Only ** \nThis place is decent - large menu and food quality was pretty good.  Not the best Chinese food I've had, but also not the worst.  Service isn't that great (poor actually) as others have noted.  If you want a quick reasonably tasty meal, this place will fit the bill however.",
                "datePublished": "2017-01-02"
            },
            {
                "reviewId": "IsnuRLDF9NcHgCtUQWzSgw",
                "author": "Jan N.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This spot is always on my go to list whenever I visit London. You come here for the quick, cheap food and rude service and not much else. If you are visiting, definitely try this out for the experience.",
                "datePublished": "2016-12-21"
            },
            {
                "reviewId": "psuFkO5wdHMu37uWQh0O5Q",
                "author": "Nicole-Ann L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "My god. I've never had such terrible beef hor fun in my life. The noodles were tasteless and greasy, just a huge disappointment. \nThe sauce for the mapo tofu was starchy and boring, basically just seasoned with a load of salt or soy sauce. \nThe roast duck rice was average as well. The meat wasn't terrible but it wasn't great.\nAnd to be honest, it isn't that cheap as well. Oh well. Come here if you wish, though I really don't recommend it.",
                "datePublished": "2016-02-07"
            },
            {
                "reviewId": "I_bLy_POJkW3yb54WZyCIg",
                "author": "Makena K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "My husband and I stumbled upon this place by accident.  We were walking down Chinatown to find a quick bite to eat before going to the theater.  My husband asked a complete strangers if the restaurant was good. He said, this restaurant is known for it's rude service but the food is amazing. So hubby decided that this is where we would dine.  \nOnce insided, we were lead to the second floor and were seated with the couple we asked outside about this restaurant.  The male happened to be a local and his wife was was California.  This meal turned out great!!!  My husband has the wonton soup, I had the crab and corn.  For our main, my husband had crisply beef and I had the spicy aubergine. The service was quite good. We did meet several wait staff.  I thought they were playfully rude which I actually enjoyed.  \nThis was our first meal here in London.  We enjoyed the food, the service and our impromptu dinner dates.  A big PLUS was the theater (for Book Of Mormon) was just around the corner.",
                "datePublished": "2014-11-25"
            }
        ]
    },
    "40": {
        "id": "0K0ExQLHdU6RsxGLP0YA6Q",
        "name": "Wong Kei Restaurant",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "41-43 Wardour Street\nLondon W1D 6PY\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jLJ3GwUb1kcFBuwCVteIxg/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7437 8408",
        "review": [
            {
                "reviewId": "ePeC7danwUafvkWj_RmEEw",
                "author": "Geoff Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I admit it, I go to Wong Kei... and I LIKE it!\nSo they closed and reopened, and some things have changed. The prices went up a little (not by that much), although the portions are the same, the staff got a little friendlier and service just a tad slower. But what's important remains the same. It's a place where you can get a plate of relatively good Chinese food quickly for not a lot of money. It's by no means the best food in the world but it is at a price that's cheaper that the rest. \nBy all means go to the buffets in Chinatown, but unless you eat smart, you're losing out, the drink you have there will push you to the £10 mark... At Wong Kei, eat in, and your tea is free. I don't go for the really elaborate dishes, they specialise in the one plate meal in my opinion, rice or noodles with something on it. Larger plates are a pretty much a plate of the main, and you then order rice on the side, good for groups. I've only once ordered off of their Chef's specials list - udon with seafood and XO, and to my surprise I loved it, but it was expensive, so don't think I'd get it again. That and most of my colleagues didn't really appreciate it...\nSo stick to the basics, don't worry about sitting at the communal table (people, it's meant to zig zag so you're not sitting next to someone, please learn this! Talking to you Mr sweaty businessman who proceeded to elbow me for my meal and cluck that I was in his way - I was there first!). And enjoy the experience, yes the staff can be surley, but they're meant to be!",
                "datePublished": "2014-07-25"
            },
            {
                "reviewId": "7tHbJ5oCjM4budA2Mt9g8w",
                "author": "Melissa Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ever since hubs saw the menu and found out there was eel with black bean sauce on the menu he was sold. This was the first sit down restaurant that we headed to in London. \nWe went here for dinner around 8pm on a Saturday evening and were seated on the basement (may be called the ground floor) and service was prompt and efficient. We ordered the eel, hot pot with tofu and Singapore style thick rice noodles. Hubs loved the eel since this is not something we have in the USA or at least in Michigan and ate all but two pieces. The tofu hot pot had fish tofu as well as the regular braised tofu. As is typical with everywhere but the US, the hot pot was smaller than what I was expecting but tasted on par with the average hot pot. Lastly, the Singapore thick noodles were pretty tasty, but I found the curry flavor be not as strong as it's done in the states. The flavor was still good and contained mini shrimps, BBQ pork, onions, and sprouts. \nGiven the price of around 25£, it's a great place to grab a reasonably priced, some may even say cheap eat when you are looking for a Chinese fix in London.",
                "datePublished": "2014-05-20"
            },
            {
                "reviewId": "eZzsjBclZnQFsSfmzWUdGw",
                "author": "Jing Shyang Y.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Okay first off, this place is awesome. You're might think that it's probably awesome because of the food. Wrong. Or that it's awesome because of the service. Nope. Or that it's nostalgia from child-hood days (You might be right). But overall no. It's pretty much the best place in Chinatown because of the no fuss (read: efficient) service, down and dirty, give the customer what they ordered and with complimentary tea. No service charge, but it does go appreciated so leave what you can.\nWhat elevates it above most other place, is the chilli oil. Hands down the best chilli oil in all of chinatown. Nobody else does it. Nobody else has re-created it. I have literally eaten here and nearly eaten half a glassful of the stuff. I know that's probably not a badge to be proud of, but it is just that good and I probably wouldn't eat here as the food is nothing special without it. Cheap, but not special.\nRecently however, they've started raising the prices a little and portions are quite variable. You used to always get a gigantic (how do I finish this) portion. But nowadays you could get that, or get something a little more manageable. This said, The price of the dish I always get, either the shredded chicken/pork fried noodles (always make sure you get crispy noodles) or the belly pork/bbq pork on hot rice have increased from £3.80 and £4.00 a decade ago to £4.80 and £5.00 today. Take into account inflation and this is probably a below inflation increase, you still get unlimited tea and the amazing chilli which haven't changed a bit.\nIf you're a wetherspoon snob however, and you know who you are, you absolutely won't like this place and this review won't convince you otherwise. For others that like to give new things and try and risk poor service/variable quality good, Wong Kei is great, you just have to understand how it all works. What appears rude service on your first visit is actually efficiency engineered over many decades. After all, if you're there on your own sitting at the front, why would they give you a menu?? You should already know what you want, and most people do!\nPS. Like other budget chinatown places. Cash Only. They also do takeaway. I kid you not, sometimes you can get this from ordering to in your hand in less than 45 seconds. They give you a little container of chilli oil, but do it properly. Open up your chinese foil takeaway box and add more yourself.",
                "datePublished": "2013-12-29"
            },
            {
                "reviewId": "fCP4EPHvXea9JvTDIr-6Ww",
                "author": "Elle W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Apparently it's been a long time since the good old days of waiters telling you to piss off because there's a queue outside and being amusingly rude. Anyway, they're still reasonably priced (cash only, folks) and the food remains good. I wouldn't say it's a life changing culinary experience, but it usually delivers and I never had to send anything back. The trick is to order food from the back of the menu; basically lots of options of meat with rice or noodles. It's even cheaper and the portions are huge; you won't miss out for not ordering the \"posher\" sounding dishes on the first few pages.\nI can't stand green/jasmine tea, but if that's your thing you'll get it for free to your heart's content. There are some communal round tables where you sit in close proximity with strangers; if that's not your thing keep in mind it's always a risk. :)\nIf you want a chatty and smiley staff this is not the place to go (as it happens with most chinese places where staff is usually tired and overworked anyway), but if you like quick and good chinese food in central London, do try. I love sitting there during off peak hours with my tablet and munch on rice and meat while I people watch. There are always some amusing customers around, and sometimes the interaction between them and the staff isn't so smooth. Ah, the good old Wong Kei will always be the good old Wong Kei. ;)",
                "datePublished": "2015-09-22"
            },
            {
                "reviewId": "Z1YZk_JajaFMAAu9QrmePQ",
                "author": "Karen K.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Walked in randomly for dinner Because there was a decent number of people inside... Thinking this must be great food. \nI was abruptly rushed to seat w strangers - \"share table\" the guy said. So I sat down and ordered chicken drumstick w roast pork over rice. \nI ate a few bites and I'm like this sauce is gravy and it's totally not what I'm used to in real Chinatowns like NYC. Our sauce is more soy sauce w some oil and it's definitely more fragrant and tasteful. \nI barely touched my food. I arrived back to my apt and the food was not settling well in my stomach. I had thrown up. Afterwards I had a small snack or two and I felt better. \nI will not come back nor should you visit this restaurant",
                "datePublished": "2016-07-04"
            },
            {
                "reviewId": "0R5DyrJVUyA-uzuu2pRTiQ",
                "author": "Bruce K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Authentic Chinese food. You know it's going to be good when the restaurant is full and the menu has squiggly characters (that I can't read) as well as English. I somehow decided that something different would be a representative choice and rather than stick with something I knew, like Singapore Noodles or King Prawns, I stepped (more like leaped) outside of my comfort zone and ordered the steamed eel in black bean sauce. I still shake my head because I have no idea what I was thinking. I know I like the eel sushi, so how different could it be?\nI have no doubt that it was good, for being eel. It was served extremely hot and after a few minutes of waiting for it to cool down, I picked up a slice with the chopsticks. Do you eat the skin? Oh, there's bone in there too. It was messy. It was... interesting. It was... odd. Would I have it again? I think I can safely say I would have something else, though I would absolutely return to the Wong Kei. But I'll stick with what I know next time!\nService seemed decent. No one was rude or short with me. I wasn't rushed at all. My tea was refilled without prompting.",
                "datePublished": "2011-08-30"
            },
            {
                "reviewId": "EdYFzp1njCSE9gp39pxYsQ",
                "author": "Daniel J.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Like others have said, the service is pretty awful but that's how it's supposed to be at an authentic Chinese restaurant, so that wasn't an issue. The food tasted okay and the prices were average. My only real problem with my experience was the stingy portion sizes of our dishes. I'm used to the whole mostly rice, very little meat thing that asian restaurants do, but the value at Wong Kei compared to what you can get elsewhere in London straight up bad. As a tourist from a small Canadian city with superior Chinese restaurants (in my humble opinion), I gotta say... Londoners deserve better and shouldn't have to pay ridiculously high prices for half decent service/food when it comes to Chinese.",
                "datePublished": "2016-06-26"
            },
            {
                "reviewId": "bcMeL2kJg4i1OxHb3w5SOg",
                "author": "Chris K.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Oh my goodness, the quality has gone down again.  After two months of  Vegan diet on weekdays and seafood diet at the weekends until our Easter on the 12th, we are back to eating meat.  I ordered my usual Cha Siu with Choi Sum, and the meat was thin and the portion of the meat was very small, it contained carrots and tinned straw mushroom as well; it used contain Cha Siu and Choi Sum only.  The quality of rice plunged; it just tasted like an ordinary long-grain rice and part of it was mushy.",
                "datePublished": "2015-04-21"
            },
            {
                "reviewId": "x9ImDT1-nf0Z6sS2w1SCFA",
                "author": "Joy L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I came here during a weeknight for a quick bite with a friend. It was completely packed by 8pm so we randomly sat with a bunch of people (typical in this place). \nI'm Cantonese myself so maybe I have high standards, but I was shocked to find out that they don't offer the classic ginger scallion oil sauce with their white chicken. So instead I ordered soy sauce chicken over rice, which was really good but not enough meat to go with the rice.",
                "datePublished": "2015-07-13"
            },
            {
                "reviewId": "O91OP7H2erwR0MbxpPvF_g",
                "author": "Kathi S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Pretty good, authentic enough Chinese food. I had the schezwan prawns. The food was just spicy enough without being overbearing. The prawns were cooked very well.  Might come back.",
                "datePublished": "2016-10-01"
            },
            {
                "reviewId": "JX5hbcoYoJC76oSF5Sn_pQ",
                "author": "Christopher C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The place is simple: they serve very cheap, good tasting, filling meals. On this, Wong Kei never disappoints.",
                "datePublished": "2016-09-07"
            },
            {
                "reviewId": "bph1bXQJLRaOYpzKICAVAA",
                "author": "Helen D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ah the legendary Wong Kei!\nThis place has been a firm favourite for myself and my friends for the past 6 years (possibly more!). The free green tea, people-watching opportunities and rock-bottom meal prices have incentivised us to return year after year, despite the occasional cheeky comment and disturbing rumours of the chiefs doing a circle spit into the dishes of punters they dislike (seriously wish I'd never been told that story!).\nWhen times are good I order the Chicken with Cashew Nuts and a side of Egg-Fried Rice. When times are not so good I order the 3 Cold Barbecue Meats on Hot Rice. I have never not cleaned my plate. Myself and my best friend usually, in addition, order the Mixed Hors d'oeuvres. And proceed to argue over who gets that last succulent teaspoon of seaweed when the rest of the savoury treats are devoured. And we do this every. Goddamn. Time\nThe restaurant staff have certainly gotten a lot politer since 2014's change in management. Which many punters are sad about, given that Wong Kei's former reputation as a 'legendary' rude restaurant. Not me, however. The times I've been back since I've enjoyed more than ever. Customer service goes a long way with me.\nMy only big gripe with Wong Kei (and this is sadly perennial) is that I always seem to suffer from an upset stomach the rest of the night and the next day...",
                "datePublished": "2015-06-02"
            },
            {
                "reviewId": "mXLj8R8CMajXyrEnINmcfw",
                "author": "Tulsa H.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "NOT FOR WESTERNERS!!! Felt unwelcome. On New Years Day, the waiter wanted us to leave our stuff on the dirty floor. We said the floor is dirty. He told us to go eat elsewhere. Bad service. Horrible. Jan 1, 2016 at 17:00.",
                "datePublished": "2016-01-01"
            },
            {
                "reviewId": "ATmG55nY1MBSSXr-OgNDWw",
                "author": "Cristian P.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "The service was horrible and the food tasted awful. I had a horrible stomach ache after aswell. You should definitely avoid.",
                "datePublished": "2016-10-10"
            },
            {
                "reviewId": "v7TY2xTkg9rq7k4KqNct0g",
                "author": "Chris G.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "How bad can you go... Purely relying on cheap prices to fill seats in your restaurant?\nWith this as their business model, I will always have a soft spot for Wong Kei!\nThe first time that I ever came here, I was introduced to the place by a friend of my dad's when I was still in my teens. I really did not know what to expect. Upon returning with my best friend, he and I spent the evening completely perplexed as to what was going on around us, even though we were the customers and we were the ones who were placing the orders. We most definitely were not in control or command of what was happening to us! \nI seem to remember almost random dishes appearing with no explanation as to what they were. I also remember very well ordering portions of egg fried rice and the waiting staff slamming the bowl down and me repeatedly asking where the other portion of rice was. Each time I asked, the waiter immediately started walking away and shouted at me \"You got it!\" \nAfter grabbing a more senior member of staff, he finally explained that two portions is one bowl. Thanks for that!\nSo when I returned here very recently, I was wondering if they still had \"the same magic\" that they used to.\nWell, to be brief. Prices have most definitely escalated compared to what they used to be here. However, you most definitely get great value for your money. I can most definitely eat & eat & eat. And.... The relatively few dishes that I did order really challenged my eating prowess. \nService here is still fairly crazy. But I suppose, it is all about perspective. I personally feel that over the last few years service in London has gotten worse and worse. Get me started on this topic I will tell you that it is the fault of including service in the bills, but I'll back off that for now. So, comparatively Wong Kei is no longer the worst place in London to be served food!\nAnd you know what, that sort of disappoints me.",
                "datePublished": "2015-01-12"
            },
            {
                "reviewId": "QR1z6NFReB8Lz9Ijy_EW5w",
                "author": "Bondan D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I have been coming here for 17 years! Sat 'upstairs downstairs' met some great strangers sitting in the same table with them. Most of the time we talk about how fantastic the food is here everytime! Highly recommend this place not for their unique service but for their excellent food!",
                "datePublished": "2016-01-19"
            },
            {
                "reviewId": "r_iUwzOQOO35yueVNWEVpQ",
                "author": "Andrew R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Quite simply the best value for money Chinese in London's Chinatown. Superb quality.. Sorry Shell Crab starter is truly brilliant.",
                "datePublished": "2016-01-23"
            },
            {
                "reviewId": "8CJogrd26yvvFN8wqacVUQ",
                "author": "Kathy C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Wong Kei was ... eh ... OK to me.  The food indeed was authentic Chinese food, but for a restaurant in Chinatown, I was expecting more.  On our recent short trip to the UK, our first day in London, we walked all over the place.  by 4 PM in the afternoon, we were starving, having only had small snacks up until that point.  We rushed to Chinatown and decided to give Wong Kei a try.\nWe ordered half a crispy duck, wonton soup, pork and preserved egg congee, and a beef hue fen (stir fried thick noodle with beef).  The duck was a bit over cooked, but still got good flavors.  It came with pancakes, shredded cucumber and scallion to make your own duck wrap.\nThe congee was a very big size.  I was thinking it would be just a small bowl.  It was decent.  The beef hue fen was my favorite out of everything we ordered.  It has that 'big wok' smokey taste and the beef was very tender.  Our least favorite was the wonton soup.  The soup and the wonton filling were both bland.  \nThe price was decent, the food was decent... so it was A-OK for me.",
                "datePublished": "2012-12-13"
            },
            {
                "reviewId": "HiQi-8V895r62gVh1Neoww",
                "author": "Kate B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "BBQ pork on rice is still very good at this fast food chinese restaurant.  I love the vibrant atmosphere of Wong Kei and the smells.  Still good for cheap chinese food after all these years.  Not sure how long it has been there but I know it's a long time.",
                "datePublished": "2016-07-12"
            },
            {
                "reviewId": "BN1zZPgOL3v07168rlJjvw",
                "author": "Or V.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I wouldn't come back.. All the Asians are on the first floor and tourist are on the second. Honestly they are racist and the food is just alright",
                "datePublished": "2016-02-05"
            }
        ]
    },
    "60": {
        "id": "0K0ExQLHdU6RsxGLP0YA6Q",
        "name": "Wong Kei Restaurant",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "41-43 Wardour Street\nLondon W1D 6PY\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jLJ3GwUb1kcFBuwCVteIxg/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7437 8408",
        "review": [
            {
                "reviewId": "HkXTj891idnMKIfw3T7E4g",
                "author": "Hannah C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Cheap good Chinese food! There's plenty of seating and yes the free tea is a great plus. Service is fast and all the waiters speak perfect English. You have to pay 50 pence for a takeaway box by the way. I got sweet and sour chicken over rice for £5.20 and it's a pretty good sized portion too. I would definitely come back and try their other cheap options!",
                "datePublished": "2014-11-12"
            },
            {
                "reviewId": "r7am27TNzMxrFxxOnRK_AQ",
                "author": "Aly G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Good basic food. SUPER cheap especially for a visiting American stressing about how bad the pound conversion is. Horrible service -- but when it that cheap does it matter? Awkward seating...",
                "datePublished": "2016-03-09"
            },
            {
                "reviewId": "Y6pMXFFJpYp37ns_bxOIxA",
                "author": "Wendy L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This whole hype on social media in regards to Wong Kei closing and then opening with new management really got me wanting to go back to see if there has been any changes. \nWong Kei has always been a place for a simple fix of food at a cheap price and a place I can get fresh ho fun stir-fried at a reasonable price. Hate it when people state 'ho fun' in the menu when in fact it's just dried rice noodles rehydrated. Portion sizes is always a plus too along with no service charge and free green tea. But I never expect good presentation of food, wok energy, particularly good service or a very positive memorable experience.\nSo it caught my attention when news coverage was saying that the new manager is trying to input better service. Whilst customers were worried about the change in portion sizes, cheap prices and taste in their favourite chilli oil. So on Saturday me and my friend decided to test this new 'Wong Kei' out with a few of the most popular dishes and see if Wong Kei has lost it's original values.\nAlthough there has been a repaint, decor is still exactly the same, same off green/blue tables on the ground floor, plastic white plates with 'Wong Kei' printed on them. The only thing that looked any diffferent were the soy sauce that are now in Lee Kum Kee glass bottles. \nWe were given the new menu where the dishes looked exactly the same however all dishes were hiked up by 0.20p-0.40p. This certainly gives room for other Chinese restaurants to top Wong Kei in offering the cheapest one dish plates. \nWe started with the most popular Roast pork and pork belly on rice. Either we were very lucky on the occasion with the cut or the meat has improved in quality. I was quite impressed with how lean the roast pork was, succulent and well marinated. The generous slices of meat did have a good bounce to it with a generous portion of rice in the same sweet brown sauce I'm used to. Nothing had changed here, if anything it was better than a lot of times I have been. \nMy friend was so happy to find the chilli oil had not change either, still fragrant with notes of garlic and flavoursome. A spoon of that onto the rice dish add that perfect kick needed to make it a good simple lunch fix.\nMy usual char kway teow went downhill sadly. It was still fresh ho fun but it lacked flavour and depth. It was not as spicy as it used to be and in fact it was more bland than it used to be. There was minimal egg to be seen and portion went down as well. I've heard most of the chefs have left since the new manager took over but no reason was given. That could explain the cooking changes. They must be using a different curry powder or paste to.\nCrispy pork noodles had mix opinions. My friend was sad to find that the noodles had change and are a lot thinner. It didn't effect me as it just made things more lighter and crisper but some might like it with more bite. As a business perspective I can see these noodles being quicker to fry. This actually became my favourite dish of the three as I enjoyed the long shredded pork and the thinly chopped mix vegetables on top that created a good layered of texture. The sauce was seasoned perfectly for me and yes although greasy it was expected, nothing has changed there. \nNow I didn't feel service had change at all- not like it bothered me. But there was no major improvements. Still no smile or polite welcoming. Our waiter still quickly pointed to the back which some can consider rude and asked us to pick any table there. Our female waitress who delivered our food was nicer and answered the majority of our questions given but she seemed genuinely nice and not like she had particular training. \nStill quite intrigued if any other dishes have changed at Wong Kei especially the Wonton Noodle Soup. Still I somehow feel the old Wong Kei is lost and being the most 'cheap' and 'generous' portions in Chinatown is no more. But for it's roast meats, chilli oil and crispy noodles there is a reason for return.",
                "datePublished": "2014-03-19"
            },
            {
                "reviewId": "Fo1NEuKT5-wXf0DbO6tjhA",
                "author": "Fitfun F.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "An old favorite for London old timers from seventies. Not been here for 20 yrs but still here in Chinatown. No nonsense take it or leave it service without the frills. Just came from a walking tour of Downing St, Big Ben and St James Park changing of horse guard.  We had the roast meat rice £6, wanton noodles £6, mushrooms chicken rice hot pot £8 for small and fried rice noodles with egg sauce & beef £6. About £26 for 5 of us. There's a 15 mins wait for the rice hot pot. We forewarned every one on our table that service can be variable in tone. Not bad for a cold gloomy winter's day. Free hot tea but we opted for hot water.",
                "datePublished": "2015-12-12"
            },
            {
                "reviewId": "fUjVJMC32bL7yh_GQ-Ff2g",
                "author": "Ed C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Automatic ding for having an empty soap dispenser in an already unsanitary bathroom.\nOtherwise, the food tastes like most authentic Chinese places: it tastes fine but nothing spectacular.\nI came for dinner and ordered a soup, main pork dish, and some rice. Overall, it was decent. None of the dishes really stood out to me. They're merely meeting my expectations for Chinese food. My parents did say the steamed fish dish that they had was actually amazing though so that counts for something I suppose. \nI encountered inconsistently slow service here which isn't uncommon for Chinese places. I'm pretty sure the two tables next to me got their food before me despite showing up afterwards. However, being insulted at one is new to me. When I asked the waitress where my food was long after her estimates had passed, she said it's my fault that I'm so impatient because I'm from mainland China. Thanks for assuming that just because I'm a foreigner who can speak Chinese, I'm automatically from China. \nI was also hoping for a break from pricey pubs, but in the end, the total came out to about how much I'd spend at a pub so it wasn't as cheap as I had hoped. Also an itemized bill would be nice so I can be sure I'm not being ripped off.",
                "datePublished": "2014-05-17"
            },
            {
                "reviewId": "NG7hagtAMxCbayCsBk-yGg",
                "author": "Katie F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Have been coming to Wong Kei for several years and have yet to be disappointed. Food is always plentiful in size and flavour. The duck pancakes in particular are exquisite. Personally I am not a fan of the free jasmine tea they serve, but that's just personal taste. \nThe chilli oil provided on the table is also amazing - definitely the best in Chinatown. No other place comes close with their chilli oil. \nService has gradually improved over the years, though still known for being rude, it is now more in a playful fashion, as if only done to keep up the reputation. I tend to find that you are treated nicer if you come alone and sit on the ground floor, and treated more as a burden if in a group.\nWould be 5 stars if they accepted card - cash only can be a drag.",
                "datePublished": "2015-01-02"
            },
            {
                "reviewId": "6YSbVTNYnl0pBLBUEKfT7A",
                "author": "Anthony C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Perfectly fine, decent Chinese food. Not spectacular, but we left happy.\nThis is noodle oriented shop, not dumpling centered. Most Chinese in the US are Szechuan and/or dumpling--even if they have no special dumpling skill: they serve the standard steamed dumplings.  I appreciated that Wong Kei sticks with what they do best: noodles.\nWe shared a beef with black bean sauce and a shredded chicken with fried noodles. Both were good. they did not bring any white rice for the bean sauce dish, which is odd when coming from the US--they brought it when we asked. And even though there were three of us they did not bring plates. \nStill, the food was good and we were satisfied--paying check was a little bit difficult.",
                "datePublished": "2014-04-16"
            },
            {
                "reviewId": "xdN8zlwEFYhORj01X8JWIw",
                "author": "Tyler P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Consistent. Consistent douche bag servers, consistent awkward seating arrangements with complete strangers, and consistently the cheapest yet fastest Chinese grub in London's Chinatown.\nI got to hand it to WK, it's complete equal opportunity. You are not a special butterfly or some prefab diva. You are equally treated like an inhumanely kept dog, fed only the basic food for sustenance, while sat by some complete stranger that both you and him/her are making it like the other is some white elephant in the room. But you know what? This establishment only cares about two things: feeding you the fastest way possible and getting you out equally as fast so that the process can be repeated with the next human being(s). And that's why I still have love for this joint. \nWK hasn't let me down once. The bar is set (low).",
                "datePublished": "2013-09-14"
            },
            {
                "reviewId": "5NbflPoEI3ROMPqcB0oRUQ",
                "author": "Jo K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "So cheap for what you get! You can get a decent meal for two for less than £30. Probably not the best place to go if you're after quality, attentive customer service but the menu is diverse and you're guaranteed to get tasty dishes that are great value for money. The noodle and rice dishes portions are huge so it's easy to over order but you can always ask for a doggy bag to takeaway!",
                "datePublished": "2015-07-28"
            },
            {
                "reviewId": "UB03QSiuEEibRcP3K656ng",
                "author": "Alex L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Not sure how this place gets so many 5 star reviews. It's pretty much quick & dirty Chinese food. I'm not saying this place is dirty (figure of speech), but its cleanliness is on par with a typical cheap Chinese restaurant.\nI've had the Beef Flat Noodle and Slippery Egg & Beef Rice, which were average to below average. Quality was okay, service was pretty nonexistant; just go in, eat, and get out. I did feel slightly rushed here - though it might have been a more psychological thing for me than actual waiters trying to rush us out.\nThe servers seem to give bad service on purpose, but it's all in good fun - as if they're playing a part. They actually aren't rude and quite courteous. I remember one visit I was watching as a waiter kept his eye pinned on a little kid jumping around in a seat. The server mentioned to the family that it was dangerous for the kid (~3 years old) to be jumping on the seat like that, and that it could tip over - which the parents just ignored. The waiter had his eye on the kid whenever he wasn't serving someone else, and would occasionally jerk towards the kid/seat when the kid seemed to be losing his balance. Nice guy - though he told one of our party to get their own chopsticks when asked to get a set of chopsticks (which he did get).",
                "datePublished": "2013-05-25"
            },
            {
                "reviewId": "H3JH8BggI1SDC0LP4IkOpA",
                "author": "Wendy f.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Known as the fast food chinese in chinatown, \nThe service is brisk and you get stuck on tables with complete strangers while we all tuck into our food, its like were back in asia again... its great ;)\nThe cheap eats, with  big portions... and taste is pretty authentic \nAverage cost is £4-8 for a dish \nI ordered \nRamen noodles with duck\n3 meats with rice \nwith free green tea",
                "datePublished": "2013-02-17"
            },
            {
                "reviewId": "cSq3vXXQh96ADMvzkSYLaQ",
                "author": "Priscilla T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Yeah!! My first UK review :)\nThanks yelpers for pointing this place out. Great place to grab a super cheap bite (I ordered the fish ball noodle soup and sauteed choi sum) - under 10 quid!\nThe service is actually quite friendly and definitely efficient. Not sure why everyone thinks they're rude...probably helps that I speak some cantonese :)\nI have a feeling I'll be eating here a lot when I'm out of dinner companions.",
                "datePublished": "2011-08-05"
            },
            {
                "reviewId": "aG52Ljzop9g1q-cBjO7KPw",
                "author": "Alessia B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "One of my favourite restaurants in London for sure! Everything I've had so far is great quality and amazing taste! They got absolutely everything\nThe rude staff is kind of their thing and you kind of just make it into a game to make the waiter smile ;)\nCheap, fun and Noodles need I say more?",
                "datePublished": "2015-11-27"
            },
            {
                "reviewId": "v4O9aHlK_gtPKr-t5h9VKw",
                "author": "Wade L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "We came here with a group from work to experience China Town and a local company tradition. The service is what they are somewhat known for, but with a twist. They can be loud, short and bordering on rude while always having fun. Lots of above average Chinese food for the price.",
                "datePublished": "2015-05-22"
            },
            {
                "reviewId": "TxPBBP_ztOd0zM1wQraxbQ",
                "author": "Tom H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Decent, authentic Chinese food for £4 - £5 per head. Could it get any better?\nYes. The service is amazing. Well, when I say amazing, I don't mean amazing in the way that you might be thinking. I mean amazing in that they're so blunt and rude that it becomes amazing in a quirky \"it's cool to be uncool\" kind of way.\nFor example the service goes something like this...\nUS: Walk in door\nWAITRESS: \"Yes, wha you want?\"\nUS: \"Table for 3 please\"\nWAITRESS: \"No, sit here\" (on someone else's table)\nUS: \"Sure, thank you?\"\nWAITRESS: \"Wha you eat?\"\nUS: \"Can we see a menu\"\nWAITRESS: Rolls eyes and reluctantly gets us menu's\nWAITRESS: \"Ready?\" (Before we've had a chance to open the menu's)\nAnd it goes on like this. It's rude, but in a good way, it's part of the charm and the fun of it. It's no-nonsense and totally worth it for the quality of the food and low price.",
                "datePublished": "2012-10-31"
            },
            {
                "reviewId": "SsVH1SSP_2UK0vSeVURenA",
                "author": "Albert H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Exactly what I expected based on the reviews overall. Good food but bad service. Very much enjoyed the pork belly hot pot dish.",
                "datePublished": "2016-07-27"
            },
            {
                "reviewId": "-TAWEWJoeb4K2ee1legECg",
                "author": "Stephanie O.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Only enter this place if you are okay to sit with strangers. We entered as a couple and were ushered upstairs and pushed over to a table of 6, which had two others sitting there. We awkwardly sat down and said a little hello to our neighbours opposite us, already eating their meal. After they had finished and left, they were replaced by two others. So our date turned out to be not so much a date. We had it good though on our table of 6 with only 4 people. Behind us were an older couple sat opposite two young Indian guys on a four seater table. It looked super cramped and awkward. At least we weren't single diners. The downstairs is reserved for single diners only. I don't know what's worse...being singled out because you're single or being forced to sit within perfect distance to be able to hear the couple opposite whispering sweet nothings into each other's ears whilst we devoured our food.\nOnto the food...We had the deep fried salt and chilli squid which was actually amazing. Not greasy, lightly battered, great flavours. We also had a pork, chicken, duck and vegetable dish which has basically just pork with pak choi. Find duck or chicken and you were lucky. Good sauce though. \nWould we come back? No. Too many other places to try in Chinatown and this one did not stand out. Service was okay compared to what other diners have written. Complimentary tea was nice.",
                "datePublished": "2015-01-11"
            },
            {
                "reviewId": "5RkaMsLSiuZcl2gZFo3NCg",
                "author": "Nicole R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Delicious food. You have to get the aromatic duck appetizer. Assorted meat with fried noodles was a tasty delight. Upstairs dining  is airy and spacious.",
                "datePublished": "2014-06-10"
            },
            {
                "reviewId": "5lgn2UznzCuhLgARG-Zlqw",
                "author": "Thomas W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This is an old school fast food Chinese restaurant the kind that used to line the streets of America's Chinatowns.  It is a tremendous bargain, and very reliable.  I am not a fan of the crispier duck dishes served in London.  I prefer the more succulent versions.  We had a shrimp cashew, a vegetable dish, and a pupu platrrer appetizer on the fixed menu.  I enjoyed the shrimp dish the most.  If you love no frills restaiurants this place will do!",
                "datePublished": "2013-04-23"
            },
            {
                "reviewId": "cjmNsVi74Cl2WlPRmslHDg",
                "author": "Sid L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "It's my favourite place in London.  Don't be put off by the lack of ambience or the quick and abrupt nature of all the people working there.  It's incredibly fast, great food and huge portions at a wicked cheap price.\nYou can't go wrong, they've got everything you want from a Chinese restaurant and it's the best service I've had in a long time (honestly).",
                "datePublished": "2015-01-09"
            }
        ]
    },
    "80": {
        "id": "0K0ExQLHdU6RsxGLP0YA6Q",
        "name": "Wong Kei Restaurant",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "41-43 Wardour Street\nLondon W1D 6PY\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jLJ3GwUb1kcFBuwCVteIxg/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7437 8408",
        "review": [
            {
                "reviewId": "Gfrdv1J9Q3xRzq-doiS4Fg",
                "author": "Wai M.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "The food was bad with the service to match.   I would stay away, as there are so many better restaurants around Chinatown.",
                "datePublished": "2015-04-03"
            },
            {
                "reviewId": "M52PBIaMFOZ_ML00F_eA7A",
                "author": "Ambrose C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I heard of this place through the 2010 Not For Tourists Guide for London and a bunch of London guidebooks, saying that it is one of their recommendations for inexpensive eating in London. I decided to walk inside to grab a lunch and see how they do. \nWhen I got inside, they quickly gave me some tea. The tea was fairly bitter and tasted kind of bland. I don't think the people who work here speak English very well, and I ended up speaking Cantonese Chinese to them. The t-shirts they wore were pretty cool as well. \nI ordered the Fish with tofu over rice. The fish was pretty bony, but there was a decent crisp in the fish, and I thought it was decent at the best. It is not high on my recommendations to order at this place unless you do not mind eating fish meat from the bone. The tofu was pretty good though as well as the rice. The dish also had some Chinese mushrooms and ginger as well. The ginger put some flair into the flavour of the dish, while the mushrooms were pretty tasty. Portions were pretty good and I got my stomach full. As for the prices, most of the dishes were under £9, so it's fairly inexpensive for a city like London. I paid £5.70 for my dish, which is probably the least amount of money I spent for a meal in London so far. \nOverall, this is not a bad place to grab something inexpensive to eat in London and I would not mind coming back here again. However, I would not recommend getting the Fish with tofu over rice.",
                "datePublished": "2010-11-07"
            },
            {
                "reviewId": "K4uejGbyAHtD8lpbO5LwVA",
                "author": "Beriah B.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Stopped in at around 2000 hrs on a Saturday evening. There was plenty of seating, so I sat in the main dining room and ordered the beef chow fun. The version they served was a gloppy, soupy mess, with pieces of noodle and beef swimming in an unidentifable sauce. It was definitely not the sauteed rice noodles I expected. So I'd stay away -- given the huge number of choices in the immediate area, you can do a whole lot better elsewhere for about the same prices.",
                "datePublished": "2016-06-05"
            },
            {
                "reviewId": "BGnWqBjXs6ciJGVvRCTQ3A",
                "author": "Michaela B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "It's a tradition in my university sports club to eat here so I may be biased, but I absolutely love this place. However, this is not recommended for any delicate diners. The food is actually incredibly good for the most part, with some of the best duck soup noodles and soft shell crab locally in my opinion (a lot of the local competitors use a lot of veg in their soup so a lot of the rich duck flavour is lost). It is very good value for money, with massive portions, and is very cheap. You can tell it's cheap from the decor, the tableware and the fact that Wong Kei is infamous for it. Do not expect Western-style service. You will not get it. The waiting staff are very quick and also very to-the-point and for the majority of times I've been there, are not going to faff around. I personally have no problem with this but I know it's not for everyone. If you are a couple, you may be seated at a large table with other people if they're very busy. You could always wait for a smaller table to become available but it could be said to be part of the Wong Kei experience. This has only happened to me once and I've been as a pair several times, usually being seated downstairs on the smaller tables.\nGreat food, great price for said food, and exceptionally fast service.",
                "datePublished": "2015-05-27"
            },
            {
                "reviewId": "yyUhkZwNIOo7VyAsiP6uFA",
                "author": "Andrew M.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Wong Kei. The best part about this is the name which let's be honest is a bit hilarious. Especially when your aunt keeps saying it in a slightly northern accent. She was raving about the Singapore fried noodles here and since she was the woman of the hour, we went.\nThe place looks like a canteen on a large scale. Not to worry, I thought, the best Chinese places tend to look unimpressive as they care solely about the food. So I said to myself (no I didn't say \"Self\"...I mean who actually does that?) that I'd judge it on the food alone with just a bit on the service.\nThe service overall was pretty good, barring a slight issue at the beginning where they refused to put two tables together (there were roughly 15 of us in the group). Why you ask? No, not because they were too busy or that they didn't' have the tables (they were about half full at best and could easily seat 100 covers), but rather because they \"just didn't do that\". A bit of an odd response for a restaurant to have as I'd imagine keeping 15 hungry diners in a half empty restaurant is a pretty good idea business wise. So we had a mini-standoff between several angry Indian mums and 2 Chinese guys...needless to say the mums won.\nAnyways, finally seated together, I get left with the dubious honour of ordering for the group (as seems to happen more often these days...). Naturally we got several portions of these Singapore fried noodles along with a selection of meat dishes and a roast Peking duck to start.\nThe duck was alright but by no means up to par with that for the Four Seasons (the lovely restaurant in Queensway or Chinatown not the hotel). It has some decent flavour but too much of the fat had been rendered away leaving the meat just a tad dry. We also ran out of pancakes quite quickly and couldn't get the attention of any of the waitstaff to ask for more.\nThe meat dishes we had ordered (the typical staples of Westernised Chinese dining) included beef in black bean sauce, pork in oyster sauce and chilli, cashew chicken, and grilled eel. The eel turned out to be a popular favourite despite not being the melt in your mouth bbq eel I had expected. It was grilled with the skin on and a light flavourful sauce. The skin was too rubbery to really eat but had done an excellent job of protecting the tender meat within. The rest of the dishes could not distinguish themselves from the average Chinese takeout but were satisfying in general.\nFinally, the Singapore noodles. I love my aunt, but I don't know what she was on about with these things. They tasted a bit bland and limp and lacked any of the fiery bite of other such noodle dishes I've tried nor did it have sufficient variety in texture to be appealing. They functioned just fine as a base for other dishes but then again so does egg fried rice. Overall, very disappointed in this but that might be due to the hype as well. \nThoughts: It's cash only so be sure to bring a few notes. Price wise it's pretty decent with the whole meal coming up to around £10pp (which in true asian fashion was fought over with each adult trying to pay for all of it). You can BYOB but they will charge you a corkage fee of £3-5/bottle that they see. So bring a case of identical bottles, just open one, and switch out the empties for a full one whenever the staff aren't around!",
                "datePublished": "2012-05-01"
            },
            {
                "reviewId": "42PEcWHKnVOq0J5lJu_0Ig",
                "author": "Chunkylefunga X.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I used to go here a lot in my teens and the banter from the staff was phenomenal. I went here again after years of absence and now sadly it seems that Wong Kei's unique selling point has gone and it's no different to any other restaurant in Chinatown.\nThe building itself is pretty big so I've never had to wait for a table and I've been after London protests when numbers are higher than normal.\nThe food was ok but not amazing, certainly not better than any of the restaurants that surround it.\nIf you need a guaranteed place to eat, especially if you're a large group then this is the place to go but other than that it's nothing to write home about. Bring back the banter!!!",
                "datePublished": "2013-05-08"
            },
            {
                "reviewId": "HyESGA3O9VGgWETWJwWEKg",
                "author": "Jessica L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "So we walked around trying to compare prices in the close area and we thought this was the best price one for us college kids. (And the 'FREE TEA' got to us, haha)\nDecor: Nice & cozy; they have a downstairs seating area too\nService: Hah, they expect you to know what you want within minutes, and we took FOREVER to decide. But they were nice about it! And some of us spoke canto, so the guy chatted with us for a little bit and that was nice.\nFood: \n- Ma Po Tofu: really good! I was surprised, considering it isn't really a canto dish. If you order this, remember to get a rice dish or just a (pretty large) bowl of rice (for about 1.50?)\n- Roast Duck (cold): I didn't particularly like it because it was really fatty (Though I know some people like it) and I found it a bit salty (yet again, some people like that).\n- Yang Zhou Fried Rice: DELICIOUS. haha, get it!\n- Choi Sum w/garlic: pretty good, not what I would say best I've ever had. It wasn't the freshest, but the garlic was good (it was his recc).\nPrice: We had 4 people and it came up to 10 pounds a person, which isn't too bad since I was pretty stuffed.\nOverall: I'm pretty happy about this place! I'll still be searching for other Chinese restaurants before I say this is my top place.",
                "datePublished": "2011-01-12"
            },
            {
                "reviewId": "i_SdQO08UTu6SkvpSWTM0A",
                "author": "Muir V.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I saw a guy here asking for an itemised bill and being told to suck a duck. He started bleating about 'but in a restaurant...' The waiter shouted 'This not restaurant, this eating house!'\nSums it up.\nOne of life's reliable pleasures is going here by myself with a book and eating duck noodle soup (brought out within a minute of ordering it - 1.5 minuets after walking into the place) and slurping down hot, free tea.",
                "datePublished": "2014-11-10"
            },
            {
                "reviewId": "MhWJ83vuI_rZ9mlv8ivRyw",
                "author": "Wai-yee P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "ok, its true Wong Kei has a very bad reputation - but people who hate it simply don't know how the restaurant runs:\n- its a \"no-thrills\" restaurant, its cheap - you can't expect customer service!\n- to eat here, just follow the following rules:\n1. if you by yourself, grab a chair and sit - they will come find you with FREE tea!\n2. if you're with a friend (so 2 of you), just say 2 or put 2 fingers up (the right way round of course), they will say go upstairs or downstairs (most likely downstairs - they have a system!)\n3. the more people, the more fingers\n-they speak good English, Cantonese and Mandarin!\n- when you think their rude, you have to realise they work extremely long hours, don't earn much and don't expect to be tipped like Americans! so cut them some slack!\nI love this restaurant not because their food is amazing - its so so and CHEAP! - but because I don't have to worry I'm eating alone, I can relax alone - everyones about their own business - everyone sits with everyone, sometimes you talk to strangers if you feel like it, or just keep to yourself - here you can be yourself and don't worry about being judged.\nConclusion: Cheap! and maybe cheerful (if you've done the right thing!)",
                "datePublished": "2014-08-06"
            },
            {
                "reviewId": "nuvhECOlyvVuTzBtCPn18g",
                "author": "Natalie P.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I went here about 6 months ago with one of my best friends who can speak Cantonese so that was very helpful for a start and because she'd been here quite a few times, she knew the best place to sit was higher up the restaurant. Apparently on the Ground Floor they're really rude to you - which was ironic as they certainly wouldn't have won any awards for being particularly friendly on our (the third) floor - and it is one of those establishments that is famous / infamous for being rude and that's part of the attraction for some people frequently the joint. Each to their own I guess. \nThe food was delicious and the service okay, but it was annoying to be sat at a table with two pervy older men who sat and drooling over my friend and I for our entire meal and I felt particularly uncomfortable when she went off to the loo and I was left with them. \nWhen it the time came for us to pay our bill, it was annoying to be told that they did not take cards and that we would have to go to the nearest cash point. The waiter even shouted loudly, \"SHE (nodding at me) can go and get money out, whilst YOU (aimed at my friend) wait here.\" We did this after saying, tactfully, how ridiculous it was that they weren't in the 21st Century and didn't have the ability to take card payments. When the waiter was being rude, this was when it was useful that my friend could speak Cantonese as she had a slight, let's call it, debate with the rude waiter. \nGreat location and very convenient, just make sure you come armed with cash and attitude - and you're probably better in a group so then it'll just be you sat on your table!",
                "datePublished": "2012-05-13"
            },
            {
                "reviewId": "q9iEf3lrHr28FH8vVbFevw",
                "author": "Santi D.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Went here more than three times already but this time they gave me an unpleasant service. There were four of us and we ordered two dishes to share but the waitress did not want to accept our order saying each of us has to order one meal. She was rude to us, took the menu from our table without asking nicely and only said \"cannot cannot\". Clearly her English wasn't very good. I had better experience previously but this time they made me not want to go back there again for their bad service.",
                "datePublished": "2014-01-12"
            },
            {
                "reviewId": "XjxX7_2K1omxjRtLk1IHNQ",
                "author": "Eng L.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Do not waste your time.  The service here is completely terrible.  I don't care how good the food is,I wouldn't let my dog eat here based on how rude they were.",
                "datePublished": "2015-08-24"
            },
            {
                "reviewId": "d6G9khoKm0r1soogOWpVmQ",
                "author": "Heather M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Wow!  The cheapest, tastiest Chinese meal I've had in London.  A huge restaurant with 4 floors, and so efficient.  For people dining by themselves, sit on the main floor.  For larger parties, keep walking upstairs.....  \nLike most Chinese restaurants, waiters are brusque and very fast.  Empty dishes seem to disappear in the blink of an eye.  The bill comes almost telepathically to your table.  \nThe food.... so good.  I had a roast duck noodles, which was all of £4.20?  Seriously?  It was delicious and filling and just what I needed.  I shall be back again.  \nBTW - my rule of thumb for Chinese restaurants - usually it's good if a) there is a lot of bad grammar on the menus, plastic tablecloths, lots of people, it's slightly dirty, and brusque staff.  All achieved with Wong Kei.",
                "datePublished": "2011-09-19"
            },
            {
                "reviewId": "mWppdANDlvCxIWuLMec0nA",
                "author": "Daryl L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Cheap and cheerful. Brisket of beef with rice or noodles is a favourite.\nAnd for only £3.90!\nAdmittedly they're not the best for roast duck or pork just a few shops away, so stick to the noodle or rice dishes.\nThey're good for solo dining or a quick meal before movies etc.",
                "datePublished": "2012-03-02"
            },
            {
                "reviewId": "af3qVU86OCb2eXDutmo3iw",
                "author": "Pete J.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "It's Chinese fast food. It was busy mid afternoon and we shared a table Chinese-style with another couple. The food was forgettable, but fast and cheap. Three stars for it being a step above the overpriced tourist traps that comprise the rest of London's Chinatown.",
                "datePublished": "2013-08-01"
            },
            {
                "reviewId": "OyVhXU8tF9n52QmdnFYAJw",
                "author": "Michelle T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "If you're after a cheap place, decent food and a good serving size, Wong Kei ticks these boxes. My usual orders are the pork porridge and black bean aubergine on rice. This is a no frills place, I've never had to wait in line and always walk out full.",
                "datePublished": "2014-02-05"
            },
            {
                "reviewId": "ZrPw0sv2_sEGWfaEOX1kpw",
                "author": "Barbie L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Please avoid. Cheap but untidy. Doesn't taste bad per-say, but I certainly wouldn't say it tastes good. I'm a tourist from New York City, and this sure left a bad impression of Chinatown on me until I visited other restaurants surrounding this place.\nLondon Jade Garden down the street is so amazing and authentic, please don't come here and ruin your appetite.",
                "datePublished": "2009-04-17"
            },
            {
                "reviewId": "sfUeSp2_bDg1lidk-5ls7A",
                "author": "Gar Wing L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Cheap & cheerful, if you're in a rush this place is ideal, super efficient service. Downstairs is good for single diners & upstairs you either share a table or get your own if in a larger party. \nDishes can be hit & miss, but you can't really complain when they are about  5GBP per dish.\nWhat happened to the rudeness, they've got more polite over the years!",
                "datePublished": "2011-12-22"
            },
            {
                "reviewId": "lf0y_Fbbm_eiBXyYqUZtCQ",
                "author": "Lauren B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "After a few or more sticky sweet drinks in Soho I love stumbling down to Wong Kei, not only to snicker at the name, but to devour their fast, hot and dazzling dishes.\nThe service here is brisk if not quite rude but none of the patrons seem to mind as they are more concerned about what they will soon be shoveling into their pieholes and when the tube will shut.\nI always get the crispy duck which they somehow manage to bring out in whole pieces and in record time, armed with only spoons, they've managed to reduce to a beautiful pile of scrumptious duck.  \nWhenever I go with friends we order as a table so we can take a bit from each others plates but staples definately include crispy duck and pancakes, singapore noodles, spring rolls, and chicken balls.\nMy only real complaint is that I always have to run out to get cash to pay!",
                "datePublished": "2011-07-20"
            },
            {
                "reviewId": "Csfh_-EKLow8AM4kht7sIA",
                "author": "Robert B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "If you like Chinese then you will like Wonkies. Its situated on the end of China town in the height of central London. The food is great, the service is quick and the quality is fabulous.\nThe thing is about Wonkies and this is whether you like traditional Chinese meals or not there service of feeding people is known all around London and the rest of the world, the prices are reasonable and the restaurant itself has the all the Feng Shui you need to know where you at, what style of food your eating and more importantly you will be able to eat in the knowledge your not being over charged.\nThe grubs great, its always busy and the staff there have been there since day one. This business is making money, and they need to because the overheads down West End are sky rocket.\nThe type of people who eat in this restaurant vary, you have the traditional China town residents, regulars and people like me who venture down West regularly to eat Chinese food. Even if it was not Chinese food I would probably still eat there, because I like Chinese tea (sound familiar?). If so you will love Wonkies as am sure you already know having been there is you get free green tea, not just any old green tea but green tea that helps you clear your palette before eating and green tea that helps you wash down your food.\nIf I have any grumbles about Wonkies it is about the pepper, now it has not happened for a while perhaps because its the summer and the air is much drier but previously I have found the pepper shaker to be blocked. This means simply tapping the pot and sometimes means having to take of the top lid and scrape away the troublesome blocks of pepper, once years ago the pepper fell out onto my food, but anyway I still ate it because I get very hungry. I once invited my pops and brother but unfortunately they declined coming and took me to the pub instead.\nWell what did they miss out on rather than just speaking about the free condiments and wonderful abundance of chopsticks. Sweet and sour is always a favourite with us English. For the health fanatics out there I recommend asking the waiter for greens with your meals, the crispy belly pork is great. The best thing about Wonkies though is the duck is does not matter whether your talking duck pancakes or Duck on rice is all very yummy. Another great meal if your ok with pork and don't mind prawns is a pasta based meal. This meal is called fried Quon Dou its yummy just try it with a huge dollop of the yummy chilli sauce, you will not regret this one the foods great.\nSea lovers ship ahoy there's a great meal that is a set meal with pasta that comes with yummy fish-balls calamari or squid and a yummy spinach based leave to soak up the gooey sauce.\nIf your in two minds about eating Chinese when your down the West End in London and are unsure where to turn or take your large party of hungry friends then Wonkies is where you should turn.\nP.S. Another little tip there is often budget meals on the walls with special that are not necessarily on the menu, there nice but I would not get to distracted the food I spoke of here is well worth checking out for now. If your really adventurous your could try the intestines or the offal dishes but I usually go with what's your normal Chinese grub, but if its a dessert your after your stuffed there are no sweets at Wonkies. Final note yes they do sell Chang beer. Happy eating.",
                "datePublished": "2011-01-10"
            }
        ]
    },
    "100": {
        "id": "0K0ExQLHdU6RsxGLP0YA6Q",
        "name": "Wong Kei Restaurant",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "41-43 Wardour Street\nLondon W1D 6PY\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jLJ3GwUb1kcFBuwCVteIxg/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7437 8408",
        "review": [
            {
                "reviewId": "YulLocWkI4rcB_dsrC-r7A",
                "author": "Qype User\n Evil_B…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Wong Kei's has been famous for being rude to customers for over 20yrs it is why people use to go, usually to take a friend who was none the wiser & then sit back in amusement & watch their look of horror & disbelief on their faces, as the staff are abrupt & rude & normally move you to another table at least once during your meal, for no apparent reason, often 2 or 3 times. \nI haven't been for a while. I really must go back & relive that de ja vou experience again!! \nI hope it hasn't changed, as it's just so much fun, you could always clock the diners who were, in on the joke & those who are new to the delights of Wong Kei's, the tasty cheap food always comes 2nd to the side show entertainment, that is the waiters & newbee customers!! I have been eating there on & off 20yrs & it never fails to be an amusing night out! \nVery cheap food, but still tasty & very abrupt rude staff, who will be ruder to your newbee diner friend if you slip them a few quid!",
                "datePublished": "2012-07-10"
            },
            {
                "reviewId": "1l6DQSFB_ptIYpa-IoQfdQ",
                "author": "Daisy-may B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The noodle soups here are so good... and SO cheap, actually the cheapest I've found in Chinatown.\nThe staff are definitely not friendly or warm, I can't comment on any of the other dishes on the menu because I've never tried them (and probably never will) I love it here because it reminds me of traveling and because I have a noodle soup addiction and am in need of serious help.\n(... Oh and theres free tea)",
                "datePublished": "2011-02-19"
            },
            {
                "reviewId": "iuIMoT5fjSibg9UpiOcWBQ",
                "author": "Simon W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "It may be a while since anyone eating here was greeted with the then-traditional, What the f~~k you want?, but this was, in reality, one of the things that marked Wong Kei's out ( along with communal seating, now a pretty normal feature  as a tangental comment you have to wonder at big chains like Wagamama taking a leaf from a famously rude restaurant's book). Which pretty much leaves it as a cheap, OK Chinese restaurant ( surrounded by cheap, OK restaurants).",
                "datePublished": "2011-10-03"
            },
            {
                "reviewId": "urYB5fqDhfTL1h8HwCjQOA",
                "author": "Grace Y.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Bad service. Bad food. \nSuper cheap. \nThe worst restaurant review I ever gave out. \nYou might like this place if (1) you have never had Chinese food before, (2) you like dickheads to serve your table, (3) you enjoy sitting next to some stranger, watching them slurping noodles, and getting their saliva/broth all over your face. \nIf you love your stomach and want a stranger's-saliva-free face, stay away.",
                "datePublished": "2011-02-25"
            },
            {
                "reviewId": "c-U0CchMyWsDnwxnZtnJDg",
                "author": "Sarah Jayne A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Perhaps the only place where you go to eat *because* of the bad attitude and rudeness of the staff.  Actually, that might be part of the charm initially but we keep coming back because we love the no-fuss food and the great prices.\nThe actual building might be related to a tardis because it appears to never end. On various visits we have been sat, down down stairs, in the middle bit, in the weirdly more upmarket upstairs bit and now and then in this weird 'down the hallway' bit that takes so long to walk to I think we were actually in Leicester Square by the time we reached our table.\nMore often than not, we order the same set meal for two because it is such a good value (under £8 per person) and because we love everything they serve as part of it. It is served family style and comes with sweet and sour pork, steamed Chinese vegetables, black bean beef ,chicken with mushrooms and a large amount of white rice.. We agree that their sweet and sour pork is the best we have had anywhere. \nDon't get me wrong, Wong Kei's is the 'greasy cafe' variety of Chinese food but since I am a non-flashy type of gal that works great for me. I love the little quirks like the waiters being just the right side of rude, the cheap plastic plates and the luminous pots of chilli sauce that are always sitting on the table.\nIt is wise to have some competence with chopsticks if you eat here but I am sure the waiters that do speak a bit of English would have no problem humiliating you a bit as they found you a fork.",
                "datePublished": "2010-12-28"
            },
            {
                "reviewId": "p7Goz35hLzD3n4gyOggesQ",
                "author": "Fotios T.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Don't sit on the ground floor in winter time. You will freeze.\nTheir food is basically OK. most of the time it comes super speedily, once I had to wait quite a while (I have a feeling they forgot my order). Ma Po tofu was a touch slimy, singapore noodles pretty standard if a little salty. Rice is usually overcooked, which is surprising to see in a chinese restaurant.\nRedeeming qualities: freakin' cheap. Massive portions. Free Tea. Hilarious. Always interesting if you're on your own.",
                "datePublished": "2011-01-03"
            },
            {
                "reviewId": "TvjgTCMioE8YZyU9hgItGg",
                "author": "Rico S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Hahahahahahhahahahahahahaha.\nBest value Chinese restaurant in the area.\nPortion sizes are decent (even for Americans).\nService is fast and brutal.\nIt is inexpensive.\nOrder the Singapore fried noodle. Its a little salty but otherwise tasty as a futhermucker.\nOne of the few places in London where people (and for this read women)\ncan eat on their own without feeling uncomfortable (no upstairs for you!)\nI miss the days when they were incredibly rude and threw the menus at you *sigh*",
                "datePublished": "2010-11-04"
            },
            {
                "reviewId": "c0bnflaHG7ltYsybieZm9A",
                "author": "Mital P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Wong Kei is great!\nDecent portions of food at very good prices. Cash only but good for a group as they have big round tables.\nThe service isn't great but you almost go there for that, as it adds to the experience as long as you're expecting it!",
                "datePublished": "2011-03-14"
            },
            {
                "reviewId": "FJvPvdbVTIkP1MUDIoxziQ",
                "author": "Jonathan C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "The food was okay (though a warning, the hot pot isn't like shabu shabu, it is literally rice in a warm pot) and the portion sizes were pretty good. The service was very brusque and it felt like we were being rushed out the door. Compared to the Chinese food I've had in the US, it wasn't particularly good and seemed very greasy. Though it was better than Panda Express and it was a pretty cheap meal, I won't be going again.",
                "datePublished": "2013-09-05"
            },
            {
                "reviewId": "UU15jweXMkN43Ostukvu0Q",
                "author": "Coyote B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I stayed for a week in London and ate here five times!  Yes, I ate here five times.  The prices are a bargain compared to other Chinatown restaurants.  For example, I had eel with black bean sauce over rice for 5.7 GBP and the comparable dish is 13.8 GBP next door.\nGranted, their try to rush the customers through, but I still enjoyed eating here and will definitely return.\nIf you speak Cantonese, you will be treated respectfully.",
                "datePublished": "2010-03-18"
            },
            {
                "reviewId": "JIBdwOYFVt1xNNkzZpEKrg",
                "author": "Qype User\n chrisg…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "If you are looking for a wonderfully polite service, attentive to your every need, this isn't it. However what you can guarantee is good food, well cooked and fast. Part of the allure of Wong Kei's are the surly, busy waiters running around like flies and doing their best to avoid the wrath of their manager.\n From most of the reviews on this page you can see the service is non-existent, but almost everyone agrees the food is tasty. And better still, it is cheap as chips (or chow mein). If you want a good night out with a group of friends, where better to go than a bustling noisy Chinese restaurant, where the conversation will be endless thanks to a few impolite members of staff.",
                "datePublished": "2011-04-28"
            },
            {
                "reviewId": "gXZfNY-TGGf--TJthtnzTQ",
                "author": "Marc G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I used to frequent Wong Kei Restaurant while living in London.  The restaurant serves good size authentic food.  The waiters tend to be borderline obnoxious at times.  The place is normally overflowing with patrons.  When I visit for lunch on my own, I normally will be seated next to someone else due to lack of space.\nThe prices are affordable, not a tourist in sight and the rudeness of the staff is, for the most part, simply hysterical.",
                "datePublished": "2010-02-07"
            },
            {
                "reviewId": "8RYVzxFzLv4UgPn7y7Qf2g",
                "author": "Qype User\n Jonla…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Like others, I went expecting the 'rudest restaurant in London', but despite the waiter not wanting to sell us any drinks (their loss, I guess), it wasn't actually too bad.\n Portions were a decent size, and the set menu meal deal for two (£12 each) was reasonable value, though a bit more expensive than I was expecting considering how cheap the place is made out to be.\n Expect to share a table with others, especially if you're not in a big group. I've had better food in Chinatown, but then again I've had far, far worse!",
                "datePublished": "2009-03-11"
            },
            {
                "reviewId": "6ayxT24UsycpaIVfrYsXpw",
                "author": "Boon K.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Its good to see lots of reviews about this place!\n The main points of Wong Kei are:\n 1) Cheap cheap cheap. You won't find cheaper Chinese food elsewhere in Chinatown.\n2) Waiting staff are stretched thin, and customer satisfaction is their lowest priority as they have way too many tasks to handle.\n3) Food is decent for the price paid\n4) During busy times you might have to share a table with others",
                "datePublished": "2008-10-16"
            },
            {
                "reviewId": "izN1Z9uiNdzgS2ZlAmvibQ",
                "author": "Michelle R.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Location= Yes = 1*\nChinese tea = Yes please 1*\nMe and my (previous partner at the time) decided to celebrate our 2 years together (shivers) at Wong Kei's. \nSoon as we arrived at the door, the waiter came up to us and took us downstairs to our seats. It felt like we was in the middle of rush hour (no not the film!). \nI ordered Singapore noodles and he ordered special fried rice. I'm telling you the noodles was so dry that I had trouble finishing it! And you know when you can tell that the waiters are waiting for you to finish your meal and leave..I swear I could read their mind...'HURRY UP AND BYE' (accent)! Not a pleasant experience and the sight of my previous partner did not make a difference.\nSo all in all, would I go there again? No comment",
                "datePublished": "2009-11-22"
            },
            {
                "reviewId": "vk3A1-JI5BDVkoPWx5PrYA",
                "author": "Adrianna V.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I went there for a dinner with my husband and first thing I didnt like was sharing table with 6 other people. I was hoping for privacy but ok I guess thats fine. Theres was just a lot of other empty tables and I dont think few groups o f 8 would come right after. The server was very rude and rush me a LOT! Luckly the food was very very good so I belive thats the most important part.",
                "datePublished": "2014-08-12"
            },
            {
                "reviewId": "Vku_VFMhsdWBKEAllUVRQA",
                "author": "Qype User\n gutter…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I have been eating here for over 20 years and I have to say, it isn't because I love their food..it is purely the entertainment value of the staff. If there are a more surly bunch of customer facing employees anywhere in the world, then they must be on a Pirate ship. I have never seen the manager smile and he doesn't so much as show you to your table, as frog march you to it!\nI love it!",
                "datePublished": "2008-10-31"
            },
            {
                "reviewId": "2RIf2k4HAxa0RgrD5EsHPw",
                "author": "Zoe B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I don't go to other Chinese Restaurants anymore.\nThere's just no point; they're not Wong Kei.\n It's fast paced, no fuss and efficient service - this place runs on high customer turnover and plenty of customers there are.\n The menu is vast and so are the portions and the prices are extremely favourable. The food tastes great and you get plenty for your money.\n The restaurant is actually 4 storeys, all pretty different - the lower ground floor is like a canteen with a water feature, the ground floor like a diner and the upper floors like a rather nice uptown restaurant, it's a bit of a lottery where you get seated - at busy times you might share a larger table with other diners, wagamama style.\n If you want to feel spoiled when you go out for CHinese, you won't like it, but if you want good value, good food, and if you're in a hurry and want to be served quickly and get out quickly this will definitely do the trick! \nNot that you can't take your time - no one pressures you to leave or anything, but if you do want the bill they'll happily get it to you double quick. :-)",
                "datePublished": "2010-05-19"
            },
            {
                "reviewId": "0KodDnfokuAHSHB9G49PKA",
                "author": "Jason G.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Very run of the mill Chinese food. But cheap and plentiful. Get the set dinner menu, they will just bring out a bunch of food... no decisions have to be made. One of the dishes was fried something... we thought it was just fried fried.",
                "datePublished": "2012-09-12"
            },
            {
                "reviewId": "PrkhYbSC7KkK-Ybd7q5dGg",
                "author": "Leon C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "It is 11:45 am and Wong Kei restaurant is already brimming with custom. This place seems so authentic I could swear I was in China. The servers are abrupt, yet organised to a level most people could never reach. Strangely for the location there seems a distinct lack of tourists, yet this large eatery is full of people who seem to know exactly what they want. I am watching people sit and receive their meals within five minutes. My beef ho fun and egg fried rice takes a little longer. I've kept myself busy with the free pot of green tea every customer gets, so I don't mind. Once I start eating I slip into noodle heaven. My ho fun is excellent. The chilli's are hot, the peppers crunchy and the beef tender.\nI know some people will not like the random seating, but I enjoy sitting with strangers who are there for the same thing, a good, quick and tasty meal. This is not the kind of place to bring a date, but if you want a great meal in your lunch hour, I can think of nowhere better than Wong Kei.",
                "datePublished": "2009-09-22"
            }
        ]
    },
    "120": {
        "id": "0K0ExQLHdU6RsxGLP0YA6Q",
        "name": "Wong Kei Restaurant",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "41-43 Wardour Street\nLondon W1D 6PY\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jLJ3GwUb1kcFBuwCVteIxg/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7437 8408",
        "review": [
            {
                "reviewId": "fSVIhjYOw8s9Lq6AczXfgA",
                "author": "Ryan W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "When I was in high school and living in Surrey, we used to travel into the city by train on the weekends.  Since the food was so cheap and we were all broke, Wong Kei (Wonkys) became a staple in our lives.  It is so refreshing to see from Yelp reviews that nothing has changed.  They still treat everybody like shit and the food is still good and cheap.\nI will never forget being seated with a group of total strangers the first time.  The man said, \"you sit here\".  I sat.  A minute later, I told the same man that there was a noodle in my spoon (hoping to get a clean spoon).  He shook the spoon, knocking the noodle to the floor and said, \"here\".  These are the reasons Wonkys gets 5 stars in my book.  Unforgettable memories.",
                "datePublished": "2009-06-30"
            },
            {
                "reviewId": "X3_XmsyxSUOk326ENI-iOw",
                "author": "Lorraine W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This place is great!! It's definitely a 'no frills' restaurant, from the decor to the service but the food is good and reasonably priced for Chinatown. We usually have the set meal at £12 a head which is excellent value as you do get a lot of food!! The first time I came here with friends we ordered the cheapest bottle of wine on the menu at £9.95, definitely not a good move as it tasted akin to how I imagine battery acid would taste!! On our next visit we opted for a slightly more expensive bottle at £12.95 and were presented with a perfectly drinkable white wine.\n Be prepared to share one of the large round tables with complete strangers, but that's half the fun of the Wong Kei experience, that and the waiters who've never heard of customer care!!",
                "datePublished": "2009-11-26"
            },
            {
                "reviewId": "IBXq2imHw-ZXJ1_fzh1-Jw",
                "author": "Phi C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "It had been a while since I last ate at Wong Kei. I didn't remember much of it so I decided to try it again recently. \nIf you don't mind being shouted at, your not bothered about the service and just after cheap (but not amazing) food then this place is ok. Personally, I won't be eating there again.",
                "datePublished": "2009-08-10"
            },
            {
                "reviewId": "3GM-wL-v2COd4b8DwUWUwQ",
                "author": "Yee Gan O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Wonky's, as Wong Kei has come to be known, is the John McEnroe of Chinatown restaurants. Rumour has it that Mr McE has it written in his contract that he has to throw a few tantrums when he plays on the senior tour, otherwise the fans would feel shortchanged. Well, people go to Wonky's for the cheap and tasty Chinese food but also for the drama and the slight adrenaline rush from the fear arising from any interaction with the staff.\nFamous Wonky's phrases\n\"Sit down there!\"\n\"What you want?\"\n\"Share table!\"\n\"You cannot be serious!\" Ooops sorry that was a McEnroe!\nAnd if you can speak Cantonese, listening to the waitresses' comments about the customers can bring a wry smile or shocked horror to your face depending on your view of what customer service should be about.\nAnyway onto the food. I find the ground floor a nice spot for a single diner and the single plates with BBQ meats or fried or noodles in soup tasty and good value for money. The cavernous multi-floor restaurant is quite frequently full and you may have to share tables, which proves that the old ones like McEnroe are still the best entertainers.",
                "datePublished": "2009-03-24"
            },
            {
                "reviewId": "LVNQCjqPLjk1cnFFQqVvMg",
                "author": "Kirsty C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Wong Kei's food is okay and the prices are excellent.\nThe waiters are famous for being rude to people but unfortunately they have never been especially rude to me.\nAnyway, I like it. Recommended for a nice cheap lunch.",
                "datePublished": "2010-12-24"
            },
            {
                "reviewId": "4cP9VIZBUdVoulCmTv77Eg",
                "author": "Qype User\n marmot…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place is a london classic. I remember going here once a few years back and enjoying an evening's free entertainment as a bunch of drunk so-and-so's started a massive fight with the waiters good times. The resteraunt isn't really like that anymore though and the staff are a lot more friendly nowadays. The food is cheap; dirt cheap by London standards. Expect to pay about 3 quid for most mains (noodles/rice dishes etc) and up to ten quid for some of the pricier dishes. The menu is variable in quality but most dishes are ok and some are true gems. The singapore noodles, for example, are some of the best in London and the Hong Kong style pork chops are another highlight. Service is a little curt but, as I said, not so unfriendly anymore and very quick.",
                "datePublished": "2013-02-02"
            },
            {
                "reviewId": "TFfbG-IKeaPgIzI4HMLjQg",
                "author": "Chris C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I am not sure how to follow Smartiboo's experience of Wong Kei, but I am always surprised by the number of English people who know about this place and actually claim to \"like\" Wong Kei.\n Well, I don't. I find the arrogant waiters ignorant and annoying, and even though Chinese waiters have been known to be a little short, these people have turned rudeness into an art form. As I understand Cantonese, I am also not too happy with some conversations I have overheard.\n I was here several years ago when the decor was \"Paint Peeling Off Wall\". They have since spruced it up a bit so that most of the paint is now actually on the wall. And that is about the best I can say, but this is actually not a criticism as lots of good places in China have somewhat basic decor, or worse.\n The food is not too bad, I have to admit, especially for the price, so if you want to eat well and reasonably cheaply, then this is definitely one place to consider. However, this place was a lot cheaper years ago. By the way, NEVER order the set menus - they are invariably crap and made up mostly of food they couldn't sell the day before.\n But whatever you do, please don't bother leaving a tip for the waiters - as they say, they don't expect it and it will only embarrass them! :o)",
                "datePublished": "2010-02-15"
            },
            {
                "reviewId": "dpv_7J-rCUqXmzQLUjA36g",
                "author": "Qype User\n ramdu…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I keep going back here yet the toilets are disgusting, the waiters have less charm than a brick wall and the place reeks of stale fat and buckets. Why? Because its cheap and fast. When eating out in one of the most expensive areas of central London, Soho, and in need of a quick bite to eat, you can eat here if you ditch your snobbiness at the front door and grow a thick skin in case one of the waiters decides to kick off at you.\n The best dish by far (and the cheapest) is the crispy aromatic duck. I've never seen it cheaper in London; half a duck will keep 3 grown men happy-chappy!\n But seriously, this restaurant is a hidden gem in Soho and well worth a visit. You'll hate it when you arrive but leave thinking you've been given a bargain. Just stay away from the toilets and be sure to be quick ordering your food!",
                "datePublished": "2010-01-27"
            },
            {
                "reviewId": "jXib9WZhCelr5Atcfu_r-A",
                "author": "Qype User\n david-…",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Reading the previous reviews I was \"warned\" about the rude waiters but did expect some decent food. I was underwhelmed, to say the least.\n We ordered the 12,50 set menu. The first dish was a mixture of deep fried assortments, which tasted all the same, the plate was lushly decorated with cheap deep fried sea weed. Obviously they do not change their frying oil a lot.\n The duck pancakes that followed were nice, but then again what can possibly go wrong in making these?\n The biggest disappointment of all was, however, the mains: 5 saggy dishes of very low quality food, all of them in sticky sweet sauces. They all looked like they had been prepared hours before and kept in a water bath. The fried rice was evidently done with powdered egg and the meat in the dishes was of very low quality, not to mention the watery vegetables.\n Neither was the food good nor was it cheap for what it was. We left feeling like we had eaten glue. This was the first time that a qype recommendation let me down and I was well embarrassed in front of my guests.",
                "datePublished": "2010-03-09"
            },
            {
                "reviewId": "jJcsJQ2nvV3-h3dFrRVD_w",
                "author": "Qype User\n big_ba…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Absolutely crazy place, about a million covers, decent good value food.",
                "datePublished": "2012-02-24"
            },
            {
                "reviewId": "yyEKJrhoAMyAiJavSI7XuA",
                "author": "Eric K.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "My first china-town experience in London..... not bad, not great.... about in the middle.....  and especially since it's my first.  \nCompared to Chinese in the states, this is pretty poor.... but at least these people looked chinese, and seemed to understand a bit of the chinese that my parents were speaking to them.\nbut hey... its nice once in a while having something that actually resembles chinese food... I don't know if mexicans feel the same way in california... shrug",
                "datePublished": "2009-02-19"
            },
            {
                "reviewId": "Nie4gjZ9zYe1fbDIQR0kJQ",
                "author": "Adrian W.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "After 3+ months of cuisine française, I wanted to tuck into something more familiar on our first night in London. After figuring out where Chinatown was on the tube map we made our way there and stumbled into Wong Kei since it was the first \"decent\" looking restaurant that wasn't a cheap looking buffet. \nThis place is cavernous, with three floors and people shuffling in and out when it gets busy. The wait staff is cold and quite unfriendly, even by Chinese restaurant standards, however they get the job done. The food is standard Cantonese noodle house fare, though unlike the case Tayyabs, where the food was better than what I had in the US, the offerings here were in the opposite direction. Their clay pot rice, while tasting ok, didn't come in a clay pot and thus didn't have the unique texture and crunch on the bottom that its supposed to have. While the chow fun was on par which what I was used back home the won-ton soup lacked flavor and the duck over rice came covered in candy-sweet dark brown sauce, which I think was a nod to local tastes, since I had seen the exact same thing in Glasgow. In any case, this place is inexpensive by London standards and will satisfy your Cantonese food fix. Mostly.",
                "datePublished": "2011-01-02"
            },
            {
                "reviewId": "6ftXMq8ZvdR8bHdeNMrTKQ",
                "author": "Zoe H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Wong Kei is notorious for its extremely rude staff and cheap tasty Chinese food. The rudeness of the staff has to be seen to be believed but people keep returning to China Town's largest restaurant.\nWhy? Well the prices have probably remained the same in years which is good news in these credit crunch times. Wong Kei is a no nonsense fast food restaurant- don't expect to relax after your meal with a glass of wine. The next 'batch' of customers will be nearby ready to sit in your seats as soon as you have paid the bill. It's not so much service with a smile as service with a snarl.\nThe food is always good although that cannot be said for the interior- I wouldn't describe it as dirty but another paint job is definately long overdue. Do NOT come here for a romantic meal because you are seated with strangers on the circular tables.\nIt might not be for you but I always know what to expect- good value Chinese food but no customer service. That's fine with me and they are so abrupt it's almost entertaining.",
                "datePublished": "2008-12-01"
            },
            {
                "reviewId": "wd2UkCmD08egxAFihyZ1Xg",
                "author": "Qype User\n 4ndyM…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "If you know what to expect, then this place is great. It's not like the old days when part of the attraction was surliness of the staff, but you are still herded in and sat with strangers around the big tables (a friend of mine was once sat on the same table as Noel Gallagaher). \nThe food is good, arrives quickly, and is cheap. It's not the place for a nice relaxing or romantic meal, but if you want to get off the streets and have some good cheap food with others doing the same then it's great. Here's a tip, try talking to the people you get sat with, most times I've met quite a few interesting people.\nIf you can't use chopsticks you will have to ask for a fork, and the constant free teapots of Chinese tea are a big bonus!",
                "datePublished": "2011-12-22"
            },
            {
                "reviewId": "0k366vEhnutLNUbXtHm6Lw",
                "author": "Jason J.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I been there several times, that doesn't mean that restaurant is great. The price and taste were OK for me when I was a student. I couldn't remember too much things over there. I just remember that I have to eat with some strangers by the same table and the service was sucks, but I was OK with that. It is kind of unaccepted condition for me right know. Do I really grow up?",
                "datePublished": "2011-07-11"
            },
            {
                "reviewId": "MNEpe2p8qQxIg_J0HPOAHA",
                "author": "Ally K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I like the price the most.. AND the food is pretty good. What more can you ask for?\nDon't expect good service, though. But it's not as bad as before I hear.",
                "datePublished": "2010-07-20"
            },
            {
                "reviewId": "YBi4PfRmXSMhlsrc-ZXIcw",
                "author": "Alex H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place is awesome for so many reasons. Yeah, yeah, yeah the food is great but the entertainment is even better. Entertainment, you say? Oh yes, entertainment. It comes in the form of the wait staff here who make a game out of abusing the guests as much as they can without actually providing bad service. They're feisty, loud and over-agressive but if you know what you want to order you can guarantee that you're going to get it in a matter of seconds and it will be exactly what you ordered. ahunter summed it up beautifully as ruthlessly efficient. I ordered a Tsing Tao beer and it was in my hand before I even finished the last incorrectly pronounced syllable. Oh and it came with one of those old school pull tops. Awesome.\n The food is truly excellent and served in the traditional family style of throw everything in the middle and fight over it. It really made me feel like I was back living in Hong Kong. One of the most satisfying Chinese restaurant experiences I've had in a long time.\n Great location, great food, great service.\n WHATCHOO WANT?!",
                "datePublished": "2008-06-02"
            },
            {
                "reviewId": "hE7Zz5bLKrhlN8d0wIjEcg",
                "author": "A W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "cheap ok food best out of all Chinese café , but remember its not Authentic Chinese food try one down street but wong kei price and taster way better",
                "datePublished": "2014-08-27"
            },
            {
                "reviewId": "I7pvN5OXrWLTW2uQy-hAQA",
                "author": "Tanika M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Amazing restaurant in a buzzing location. Quick, delicious and hot food was exactly what I wanted and so I received just that. Waiters are a tad rude but the food is excellent. Be prepared to sit on a table with strangers but overall, you wont be disappointed especially not at the cheap prices.",
                "datePublished": "2011-05-05"
            },
            {
                "reviewId": "3PDFbgiTrvq2J8t9pSsc6g",
                "author": "Steve C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I heard from many friends' \"recommendation\" and visited this notoriously \"famous\"  restaurant when I was in London seven years ago.\nThe food served there was dirt cheap.  I recalled it started at four and half pounds per dish.  The portion was extremely huge -- enough to fill up the stomach of two hungry customers.\nOf course the taste is awful -- unless you have never tried any Chinese food.\nAnd I could tell how rude those waiters treated the \"haole\" (Hawaiian word for Caucasian) customers.  But the restaurant was packed with haole on that day.  Why did they enjoy being abused?",
                "datePublished": "2011-05-03"
            }
        ]
    },
    "140": {
        "id": "0K0ExQLHdU6RsxGLP0YA6Q",
        "name": "Wong Kei Restaurant",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "41-43 Wardour Street\nLondon W1D 6PY\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jLJ3GwUb1kcFBuwCVteIxg/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7437 8408",
        "review": [
            {
                "reviewId": "hKfx0Kuuvor8SzrAywf2xQ",
                "author": "kyong k.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Best value Chinese you can find.\nAlways a seat available (because it's freakin' huge), food comes out fast, quality is low - but good, and it's CHEAP.\nService isn't as bad as it used to be.. (think older London tour books talk about how terrible the service is...)",
                "datePublished": "2010-07-16"
            },
            {
                "reviewId": "7qy4_dANNkVSMeWOdRr3jA",
                "author": "Qype User\n Na…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Following the reviews from Mssrs A and A Hunter in particular, I went on a date to this place. Chinese generally isn't my favourite cuisine but I will certainly come back here. It's as efficient in service and atmosphere as the other reviews suggest, but I really didn't feel rushed at all, and we stayed to finish our wine with no indication that they wanted us to leave!\n A pot of chinese tea was put immediately on our table, and we went for the house wine - a risk a) in a cheap chinese and b) at £7 a bottle - but it was dry and perfectly drinkable! We started with the finest crispy duck pancakes I've probably ever eaten, then we both had won ton soup. Delicious broth with noodles (which were slightly undercooked), with 5 or 6 giant pork and prawn dumplings. Delicious. We had chinese greens on the side - a giant pile of steaming hot stems with oyster sauce. It was all extremely tasty and we couldn't even finish it all. And the bill? £22 inc the wine. Have already told everyone I know about this place!",
                "datePublished": "2008-06-16"
            },
            {
                "reviewId": "PjyBkeBvfiw_WmdKHQYlTg",
                "author": "Qype User\n ZMAn…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "First off, the service is here is crap, if it is existent at all. Surly waiters dump your dishes down, never bother with requests for tea refills, and give you your bill before you've finished eating.\n But fortunately, that's the worst of it. By persevering, you'll enjoy good food at a low price. I normally get the duck rice or the 3-meat rice, which is good value considering the amount of meat you get. But I would advise anyone coming here not to order any of their wet noodles, which can be fairly bland.\n Food comes quickly too, so after some grocery shopping at Chinatown, here's a place you can go before running home.",
                "datePublished": "2009-01-30"
            },
            {
                "reviewId": "5ci1AG-yERkd7RIGWURRhg",
                "author": "Qype User\n sirilu…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Lots of stars because I remember the food being good. I haven't been for a loooooong time but the fact that it's still going strong says something for it.\n The main draws used to be the cheap but good Chinese food and the utter contempt that the waiters showed every single customer. The last time I was there I caught one of them basically telling a customer to piss off in Cantonese (something I picked up from martial arts movies). It was hilarious!\n Anyway, the reason I write is because my brother went in the other day and actually got service with a smile. And he said the food was still good.\n Update: I put an extra star on 'cos I notice a lot of other people besides my brother say the waiters are more friendly now. It's perfect!",
                "datePublished": "2008-09-01"
            },
            {
                "reviewId": "rZBkEpiG7TeO0FvNsyjh8w",
                "author": "Qype User\n foxy1…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This place is a fantastic experience, great food, near-comedy atmosphere and great great prices.\n Recommended to us by many of our family and friends, we just had to give it try. We'd heard the legends of rude and ruthlessly efficient service and arrived hoping to experience such.\n You definately have to give it a try if you are in the area, its cheap, cheerful and an experience not to be missed",
                "datePublished": "2008-11-27"
            },
            {
                "reviewId": "PsAGC0-j9p6KIde1IAuszw",
                "author": "Qype User\n playla…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I can't believe people are marking this place down because of the service. Surely that's all part of what makes this restaurant such as institution?\n On my first trip down to London, the amount of people back here in Sheffield who said you must go to Wong Kei's to be abused was phenomenal. Their reputation has spread far and wide!\n Plus, where else can you go for food and exercise at the same time as you traipse up and downstairs? It's cheaper than gym membership!\n The waterfall downstairs looks like something a person with no discernible taste might have in their garden and the plates look like the indestructible ones they used to give us at primary school.\n The main reason to go though is the food. My partner is a notoriously fussy eater and I've never seen him clear a plate so fast. We had pork noodles and they were amazing and the jasmine tea was also nice. I think the meal we had added up to about a tenner and we were stuffed.\n A great place to go if you're not bothered about dressing up and going somewhere fancy.",
                "datePublished": "2008-11-20"
            },
            {
                "reviewId": "xkkE62gW_6VqoW3dWaS3bQ",
                "author": "Qype User\n jonath…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I had to see it to believe it, but what a great experience\n Yes the staff are notoriously rude and you usually end up on a table with complete strangers/confused tourists. But how on earth can you argue with the 3 course set dinner for £12 a head (and I'm talking crispy duck included). You can't you just can't.\n Did I mention the house wine is £8 a bottle, and they have no problem with doggie bags..",
                "datePublished": "2008-11-17"
            },
            {
                "reviewId": "4QYJADbQD6md9NYQ4f6eBA",
                "author": "Qype User\n sarah7…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Why do so many Chinese people eat here? Because the food is Fantastic! Order anything from peking crispy duck to deep fried chilie salt squid and you cant expect anything but very traditional, superbly cooked food. I've never met anone with any complaints about the quality of the dishes. Excellent value for money as well..!\nService and seating arrangements leave much to be desired, but the food really does speak for itself, hence its 500 person capacity often being packed.",
                "datePublished": "2007-11-18"
            },
            {
                "reviewId": "iUfQ0Or8R3feWuJtRoDkbg",
                "author": "Qype User\n lace11…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I have been frequenting this institution for years. Its brilliant whether dining with friends or alone. The food is tasty, with huge portions at great value. I recommend the Char Siu (BBQ Pork). The service is famously abrupt but has improved and still retains a certain charm. The food is often delivered very quick - a plate of rice can be quicker, tastier and cheaper than McDonald's!\nIf you're happy with no frills tasty food, you found the right place.",
                "datePublished": "2007-12-07"
            },
            {
                "reviewId": "vwjlV08DmF8M8SJlwNpBQg",
                "author": "Qype User\n merlin…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Agree with most of the reviews here that say that the waiting staff are comically rude.\n This is a typical Chinese canteen - a no frills experience on the inside, but the food is excellent for the price.\n I thoroughly recommend the Cold Roast Pork and Duck on warm rice - real bargain and generously portioned.",
                "datePublished": "2008-09-26"
            },
            {
                "reviewId": "f_oyjNIStCiA1BaBTQQpyQ",
                "author": "Carl S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "For 26 years I have eaten Singapore Noodles at the Wonk, and they are Heaven. Fab noodles and a pretty tasty hot and sour soup too. See if you can get a tale on the ground floor. Only once in 26 years for me. We visit the Wonk every time we go to London.",
                "datePublished": "2013-01-03"
            },
            {
                "reviewId": "WuzVgxpbUcuRCTyw8cygGg",
                "author": "Qype User\n funkyu…",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "After looking at every menu at each restaurant in ChinaTown in the rain late last night, instead of going to the one that closes at 4am, for some reason we went to Wong Kei cos I think we were enticed by the No service charge and no charge for chinese tea lol I know restaurants in Chinatown arent known for the service and value for money but my gawd the service I recieved in here was the second worse Ive ever had!! (The first was in a chinese cafe in Toronto but thats another story!)\n The waiter didnt write down the order, came back to check, repeated the order back to him, later came the dishes except for one, told him but not only did he give me mouth, we never even recieve the dish we ordered!! We didnt say anything after only because we didnt want to spend any more money in there. The teapot came with a streak of chilli oil on the lid, the portions werent big, food was greasy, the place was just dirty with food all over the floor. We didnt even dare to go to the toilet!\n When the bill came, the dish we ordered which we never got wasnt written down either...so clearly he wasnt listening and didnt care and gave me mouth about it! Needless to say, we did not give a tip, never going back even if it was cheaper than other places, the food was greasy I may as well had a kebab probably would have been cheaper and tastier! Next time we will find a chinese restaurant outside of chinatown.",
                "datePublished": "2011-02-14"
            },
            {
                "reviewId": "tAwZyUcemLNspMiwRcABrg",
                "author": "Qype User\n iSmit…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "OK, everybody has heard about Wong Kei - especially how it 'used to be'. Well, now, I think most people think of this place as 'where can I get a good portion of Chinese food at a good price?' - well, this is the place.\n First tip upon entering is to ignore the waiters on the ground level trying to get you seated straight away on this level - they only do this so the tourists outside will see a busy restaurant and think it must be popular. I would continue walking passed them explaining you have friends upstairs waiting - as the nicest tables and environment are upstairs. My experiences of unfortunately being seated on the ground level is noise, bustle, flies (in the summer) and drafts.\n The food is plentiful, and usually tastes very good. My personal favourite is the Sweet&Sour Chicken with Rice. But the cheap Jasmin tea isn't something to savor, so I'd skip it for a beer or coke.\n We often bring groups of friends here for dinner, so much so that 'Mr Man' (the manager, I am told) often throws in a free extra dish :-)",
                "datePublished": "2010-12-17"
            },
            {
                "reviewId": "zIo2rlzR3lAZrY8OdzBrXw",
                "author": "Qype User\n kei…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Wong Kei (or 'wonky's) was a firm favourite when I was studying in London. Wong Kei makes its money by selling decent Chinese food at an electric pace. They can have you in, fed and out in under half hour but the experience is not to be missed.\nThere are a lot of horror stories about how food the service can be but it's more clinically efficient than out and out rude. You are told where to sit, you might be sat with a stranger, there is little banter with the waiting staff but the quick turnover, the meeting with strangers and the cheap, quality food make for a great experience. Enjoy.",
                "datePublished": "2008-11-28"
            },
            {
                "reviewId": "1M_q_sN0PI3kG8Y2yCxFzw",
                "author": "Qype User\n hughth…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "If like me you believe that eating should be a question of taking on fuel rather than some kind of quasi-religious social event then the Wonky in Soho is the place for you. The minute you're in the door you're basically grabbed by the scruff of the neck and shoved down at a table, often one that's already occupied by some Chinese person loudly slurping down noodles. A demand is made for what you want and a pot of Chinese tea is banged down in front of you, followed seemingly just seconds later by the dish of your choice. In my case this is usually lemon chicken and boiled rice: mm lovely! The place being something of an institution you can buy a Wong Kei t-shirt just like the waiters wear. Some say the waiters are rude here. A diner in Soho (possibly here) once had a request for a second cup of coffee answered with a barked: No: you pay, you go!. But to me they aren't rude, they're efficient. And I wear my t-shirt with pride. Be warned the place don't take credit cards though, so take some cash and spare yourself an embarrassing mid-meal trip to the cash point. And don't even think about using the toilets. Apart from that, absolutely great.",
                "datePublished": "2012-06-03"
            },
            {
                "reviewId": "JqMbCxh60K5kBMta_VtaAg",
                "author": "Qype User\n CapoDa…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Wong kei's is my favourite Chinese resturaunt and the only one I have visited more than 3 times.\nInside you can sit upstairs or downstairs and it seems like two different resturaunts visually. The food is fantastic and you really do get a lot for one dish so really great value for money.\nYou can spend about 5-10 pounds and be full.\nI really liked the crispy duck, and they have some mean soups.\nThey provide you with a tasty tea while you wait and the service is sometimes quick sometimes a bit slow but it really depends on how busy it is.\n The selection of beer is not too vast but you are here for Chinese food not for the alcohol so that isn't too much of a bad thing. Inside is usualy quite packed but there is a great atmosphere in the resturaunt.\nSo overall probably one of the best Chinese resturaunts I have been to.",
                "datePublished": "2008-01-11"
            },
            {
                "reviewId": "EvInD8oCIOI1Nd2BfBrM4A",
                "author": "Qype User\n kateya…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Food was ok (not as good as some places I've been but not as bad as some others!) - the prawn toast didn't have very much prawn on it and was more sesame toast than anything else.\n There were no kerfuffles during our visit, the food was simple and quick, but wasn't of the most amazing quailty. Still, you get what you pay for!\n Converse to some opinions, the waiters were actually quite nice to us. It must have been pay-day!",
                "datePublished": "2010-03-27"
            },
            {
                "reviewId": "rvA4JXM7KQakwbLEvNDClg",
                "author": "Gillian F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Roast duck noodle soup and fish ball noodle soup are perfect for a cold London day! YUM-wish I was there!",
                "datePublished": "2009-01-31"
            },
            {
                "reviewId": "qkVkfQ_ryM4xXghtGXkDeA",
                "author": "Coco L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Nothing beats a cold winter London night than a big bowl of noodle soup... even better when it's easy on your wallet.  The wonton noodle soup with chasui used to be my fave before I swore off meat.  I don't know about the rudeness.... everyone's is usually pretty nice when I visit, altho sometimes they are really busy and may not be as friendly.",
                "datePublished": "2009-01-08"
            },
            {
                "reviewId": "X6AKrWhQ3_BLM_zDjpOofA",
                "author": "Qype User\n Fidel2…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Slipery floors but cheap and good quality. Kids will love it.",
                "datePublished": "2010-02-28"
            }
        ]
    },
    "160": {
        "id": "0K0ExQLHdU6RsxGLP0YA6Q",
        "name": "Wong Kei Restaurant",
        "category": "chinese",
        "servesCuisine": "Chinese",
        "priceRange": "Under £10",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Chinatown",
            "streetAddress": "41-43 Wardour Street\nLondon W1D 6PY\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media1.fl.yelpcdn.com/bphoto/FRS766QUY4JPHIC8Hpi44A/o.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7437 8408",
        "review": [
            {
                "reviewId": "u1uUTWDaIlvW4GM4MFNC9w",
                "author": "Qype User\n snakek…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Very large chinese restaurant, set over four floors and very popular with students and anyone looking for a cheap, quick meal. It is not one of the most plush restaurants I have frequented but the barbeque pork noodle soup is wonderful, at under £4 for a very large bowl, it is an excellent choice for a quick lunch.The restaurant also has an interesting seating policy, be prepared to be seated at large large round tables with other customers. This can be a positive thing, as I have had several interesting conversations over my noodle soup.",
                "datePublished": "2008-11-22"
            },
            {
                "reviewId": "ZZaFtXWRwsbJ285U8lWn8w",
                "author": "Qype User\n buloo…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Impressively cheap! Even though the food is really cheap, they have very delicious roast pork and char siu! A plate of roast pork and char siu rice is only £4.50! The ginger and spring onion pork chop with rice is also very tasty! These two dishes are normally what I have with wonton soup as the starter! Inside  A DOWN TO EARTH simple interior! Quick service and fast food! Good for a fuss-free dinner before a night-out partying! A favourite everyday place to be!",
                "datePublished": "2008-04-25"
            },
            {
                "reviewId": "MsyionODo7_3OHkGVMVW6g",
                "author": "Qype User\n bigdav…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Cheap, incredibly quick service, great food, waiters that don't speak a word of English - just what Big Dave wants at 11.00pm after a night out on the beers. Big Dave recommends the shark fin soup... JOKES.",
                "datePublished": "2011-01-19"
            },
            {
                "reviewId": "OcV9BVe6IE6gaX-BXT2eZQ",
                "author": "Orestis M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The first time I ate in this restaurant was in 1979 when they were in Blue post alley. The menu stayed the same for many years and it was finaly changed in 2000 something. My favourite dish was always 114 (Singapore fried noodles) and 112 (Fried Quai Du). I went in after the menus changed and the numbers were removed. I asked for a 114 and the guess what? I got Singapore fried noodle. I was soo pleasedI felt like a veteran coming home.\nI have not been there for 5 years or so and I am hoping that the numbers have come back in the meantime. As for the service it used to be:\nOne? you sit here (ground floor)\ntwo? go downstair (basement)\nother numbers upstair (any of the other floors)\nglass table tops so the plates would slide across, generous portions and excellent prices.\nStrangley enough, the Lido around the corner had exactly the same menu, but at about 25% higher prices. Thankfuly that is now gone.\nFor chinese clients, there used to be a chinese menu that had a number of items not available on the english menu. I am curious if that is still the case.",
                "datePublished": "2008-03-31"
            },
            {
                "reviewId": "Y-4lSIiiMD1EXsIfWd1M8w",
                "author": "Qype User\n pluk8…",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "This place is pretty awful. Although this restaurant is the cheapest in Chinatown it is very easy to see why. The staff are always rude and they shove you on a table full of strangers. When my friends had a birthday party there they even had the cheek to ask for some of the cake! Some of the plates were also dirty. The toilets were a pit and extremely unsanitary. I hear the place was originally closed for refurbishment because the council forced them to clean up their act. My advice is that if you do use Wong Kei, at least get a take away to avoid the poor service!",
                "datePublished": "2008-11-17"
            },
            {
                "reviewId": "V5YDpuMWiQ7kyhUWGpmquw",
                "author": "Qype User\n eve78l…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The food here is no doubt good and worth the wait. The waiters are known to be rather rude but they've improved since the last I visited in December. The noodle and rice dishes are aromatic and tasty and you don't have to wait long to get a table!",
                "datePublished": "2008-01-03"
            },
            {
                "reviewId": "kJkHoWJlYvMieSvuBj1sYg",
                "author": "Qype User\n JujWal…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A really great chinese. the food is super cheap, but that doesn't mean it's low in qualityquite the opposite in fact! You can get all our favourites on the menu, and the waiters are really entertaining too.",
                "datePublished": "2008-06-29"
            },
            {
                "reviewId": "XivcPUUyCxB-IJeNTsxj0A",
                "author": "Qype User\n snowyh…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Ha Ha Ha, glad everyone else has had the same experience here! I went to London for the first time a couple of years ago and was taken here in the evening before a night out.\nWhite tiled floor ceilings and walls everywhere,cash only, the staff are very surly and almost slammed my meal down in front of me, put on a table next to loads of strangers, I was really out of my comfort zone but enjoyed every minute. \nThe food was great and really cheap, the real menu on the back looks really interesting, stir fried tripe anyone?\n Tried going back here for lunch the next day I liked it so much but ended up getting completely lost!",
                "datePublished": "2009-01-10"
            },
            {
                "reviewId": "azI_LpBnvUeW5j3sC1ssdg",
                "author": "Qype User\n Rioca…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Yau Nam noodle soup... Thats all that needs to be said really. Just thinking about it has made me decide on where I am going for dinner tonight.",
                "datePublished": "2011-04-12"
            },
            {
                "reviewId": "Rc6EnqW3joClaz8qSGaNSA",
                "author": "Qype User\n minjuk…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "service wasn't bad as much as i heard. cheap chinese meal to have. generally not too bad.",
                "datePublished": "2011-02-16"
            },
            {
                "reviewId": "3conSsRLrZWpz1NWiBgAQA",
                "author": "Qype User\n parcoo…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Wong Kei Restaurant is one of my favourite dinner place. I dine at Wong Kei at least twice a week as it is cheap and authentic. Normally, I have eel rice and Chinese tea and it will be about £5.50. Sometimes if I feel like it I will order some fried choi sum and wanton soup. It is a chinese fast food. The service is quick and they will try to get you out as quickly as they can to get more customers. Apparently they earn their pay based on the number of customers the get each day, hence the hurry!",
                "datePublished": "2008-11-28"
            },
            {
                "reviewId": "GJ842w-TCGHNFQJv7OsfIg",
                "author": "Qype User\n wai…",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "No no no, how can this place be number 1? Okay so the food is pretty decent and the prices are low but IMHO the service out weighs all of that, The staff are the rudest for miles! They usually sit you with other people, plates and cutlery can be dirty, they give you your bill when you have one more bite to go, like a pre-emptive strike for you to leave. Other places like 1997 or crispy duck (on the same road) offer a similar service but at least with better standards. I would much rather pay the extra and eat there.",
                "datePublished": "2008-11-18"
            },
            {
                "reviewId": "Ndv3Nw9PyUKup9jLArO5KA",
                "author": "Qype User\n notfor…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Definitely the best Chinese restaurant in Chinatown. Huge portions, and dirty cheap. Food is tasty and served quicker than your average fast food chain.\n The whole 'expect abuse' thing is no more, and like all myths most seemt o want it to continue. Completely family friendly although you're likely to share a table with other guests. The chilli sauce is to die for.\n Good place for a quick feed, but if you're after a real 'dining experience' go elsewhere!",
                "datePublished": "2008-11-15"
            },
            {
                "reviewId": "iu_I2UxpgSmPnHen9E1HfQ",
                "author": "Qype User\n chebe…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "It's really impressive how cheap and how good the food can be here, in the heart of Chinatown. The beef with chilli and black bean sauce is my personal classic and it's only £5! Seafood noodles can be as cheap as £3,80, the service is fast and they serve you jasmine tea for free - I find it perfect to help digestion after so much food. Portions are large! You might share your table with strangers and they are famous for the kinda rude service, but that's absolutely alright when you get the (cheap) bill.",
                "datePublished": "2008-01-20"
            },
            {
                "reviewId": "7qNHIT7A1ShI6VYNLgLyPQ",
                "author": "Qype User\n sambai…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Love it. Simply, the most authentic Chinese food in Chinatown. A lot is written about the service in Wong Kei's, and its true it is amusing sometimes, but its not super rude. Its just fast and a bit brash. Have the chilli salted tofu, and some gailan (chinese brocolli). And the hot n sour soup",
                "datePublished": "2008-10-01"
            },
            {
                "reviewId": "-GCU4W0hGthvrS3GskIfOg",
                "author": "Qype User\n jeff…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A great place to have quick meal at great prices. I ordered a plate of stir friend noodles and a chinese tea drink for under £5. This is a fantastic price in central london. However, do not expect restaurant like service and be prepared to share a table with some other people.",
                "datePublished": "2008-11-26"
            },
            {
                "reviewId": "Xu9ZqWMEihggzRlfHOeXEw",
                "author": "Qype User\n foodie…",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Once upon a time, this is a chinese restaurant famous for its poor (somewhat rude) service. After 10 years, I returned to this restaurant again, hoping to check out if the service and food quality has improved. I wasnt disappointed as the poor and rude service remain and the food is only average. Not my choice of restaurant and I would certainly not bring any friends there.",
                "datePublished": "2008-11-20"
            },
            {
                "reviewId": "Tswo48RYSlam0MQtJJBZXA",
                "author": "Qype User\n levant…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Deservedly famous Chinatown restaurant. Food is basic and cheap and you sit at communal tables. Service is brusque but it's all part of the experience. The barbecued pork noodle soup is fantastic and great value for £3.50. You get free tea with your food which is lovely.",
                "datePublished": "2008-11-16"
            },
            {
                "reviewId": "2Aj368hv55Rg8YM8yLKiAA",
                "author": "Qype User\n Smarti…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Wonkey Wong Kei undoubtedly has a reputation for itself, whether it be good or bad, it's definitely a 'known suspect' in Chinatown. I've been here by myself loads of times, but I can't remember what food I ordered, or whether or not the food I did order was any good. The reason being, is that each and every time I've visited this canteen, some sort of commotion has taken place, which completely diverted my attention away from the food. And when I say commotion, boy do I mean COMMOTION.There are two notable occasions that stick in my mind. The first was this one time when I popped in on a beautiful summer's day, for a quick bite to eat. For those of you who haven't been there before, the downstairs street level is for single diners only. Groups of more than two, are seated upstairs in the sections that look more restauranty (carpet and wallpaper etc). But downstairs looks like a prison diner, a mess hall, a state school canteen kind of thing.So I was just sitting there, amongst an eclectic mix of diners (cabbies, minicabbies, students, oriental residents, workers from the nearby brothels, and this old aristocratic-like English lady who looked like miss Marple), when I heard a disturbance brewing at one of the neighbouring tables. There was some bickering going on between a customer and a waiter. So I turned to see what was going on. The customer was like a cockney type character, of slim build, in his 40's, about 5'9 with a demure 'The Sun' reader disposition about him. He may have been a cabbie. The waiter was a chubby, well-built stocky chap, in his twenties, who had short spikey hair and I think he was wearing glasses. So as I turned to figure out what all the fuss was about, I realized that it was regarding the dish that the customer had just received at his table. He started off in a friendly I didn't order this one, mate tone of voice, and the waiter contested with a firm yes you did kind of reply. It was a classic yes you did, no I didn't scenario, with each repetition increasing by a few decibels a pop, heading towards an almighty gut-wrenching crescendo. The cabbie character was adamant that he didn't order that dish. The dish in question was a 'duck fried rice'. Eventually, the waiter lost his cool, leaning over the customer, and with one sweeping karate chop hand gesture, sliced the air vertically down, right in front of the cabbie, and bellowed into his face, an ear splittingly coarse YOU ORDERED DUCK FLIED LICE!!!!!!!!!. Needless to say the whole restaurant went silent and turned to see the action. Miss marple started shaking her head in disapproval and I joined in with her, commenting on how rude I thought the waiter was, and how unnecessary his behaviour was. The poor cabby bloke was quaking in his boots, filled with fright, and shock, taken completely by surprise by the sheer audacity of this waiter's reaction. He just sat there cowering under the still airborne karate chop hand, which was still hovering around the poor guys face. Eventually, he came to his senses and managed to muster a bit of courage, replying to the waiter I don't need this s&%&! I'm not paying for it. I know what I ordered, and it weren't 'duck fried rice'!. And with that he stood up, still trembling from the combination of fright and embarrassment, and half heartedly managed to force a cocky swagger towards the front doors of the restaurant, turning around intermittently to issue a couple of 'f&$£ yous' to the waiter that had just ruined his day. How vulgar miss Marple said to me, as we both sat there in complete and utter disbelief.So that was one fond memory of Wong Kei. The second one I have of that place, is even more bizarre. It was one early evening, sort of like dinnerish time, when I was just passing by and couldn't help but pop in for a quick munch. So as usual I took position in the singles department, when I noticed a couple of giddy girls come in asking for a table for two. They were in their early twenties, sort of Essex secretary type girls, obviously having a little bit of a night out on the tiles. They seemed a little hammered. So they disappeared upstairs, and before I had time to place another mouthful of food into my mouth, another couple arrived, asking for the same deal. This time it was a couple of lads, both in their early twenties, basically the male version of what had just preceded them a few seconds ago. Two lads out on a bender. They too were ushered upstairs somewhere in the restaurant area. Then out of the blue, like say about ten minutes later or so, they all came flying down the chute, like human-laundry, one after the other, catapulted right out into the middle of the mess hall, all intertwined in some sort of brawl. They were fighting each other. It was the two lads vs the two ladies, if that's at all possible. There was screaming and shouting, ranting and raging, bodies flying here and there; it took me a while to figure out what the hell was going on. Basically, one of the lads was",
                "datePublished": "2010-02-02"
            },
            {
                "reviewId": "PUUk0AfdbGIUR0YF2U4Hrg",
                "author": "Cityvox User\n vidau…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Fuel up and go\nA great place to go if you are on a budget and also if you are very hungry ! The food is good and plentiful and complimentary jasmine tea is given (tip: when you want a refil leave the pot lid open and it will be efficiently re-filled). The drinks list is limited but reasonable priced. I've been going here for years and the service doesn't really change... it's quick and efficient but don't expect pleasantries. You don't get a choice of where you sit (either which level or table). Mostly you end up sharing one of the large circular tables with other diners. Taking this into account I have never had a bad experience here and it all adds up to a quirky dining experience. The decor is basic but varies from floor to floor, I think the best room is the first floor by the window if you are lucky enough to be told to go there !",
                "datePublished": "2004-07-22"
            }
        ]
    }
}