{
    "0": {
        "id": "ga_A83dfGW8VhNHQ5JLT3A",
        "name": "Le Relais de Venise L’Entrecôte",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Marylebone",
            "streetAddress": "120 Marylebone Lane\nLondon W1U 2QG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hLn4o8RhI6JbQDn5H1t_Ww/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7486 0878",
        "review": [
            {
                "reviewId": "e77_3Wu1d14XP0cgslsBew",
                "author": "Sarah K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Simple set menu with everything cooked perfectly! Sometimes it's nice to have very few options. This place does one thing very well. Steak and frites!",
                "datePublished": "2018-09-24"
            },
            {
                "reviewId": "hj8j1YljA2C2J1XaVZx0RA",
                "author": "Matthew L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This was one of the first meals that I had in London and it was really good. This restaurant is known for two things, steak and fries. The restaurant loves serving this so much that it is actually the only two things they have on the whole menu.  The steak was cooked perfectly. Also just when you think you are done they bring you out more steak and fries so that you can have even more.  \nThe waiters and waitresses are just nice but not the friendliest of people I have ever met.  The food was really good, but the place inside was not the largest.  \nThe best part about this place is the simplicity of it and the fact that you know your going to get good steak and good fries when you come here.  I would highly recommend to people looking for steak and fries in London to try this place out!",
                "datePublished": "2018-10-02"
            },
            {
                "reviewId": "gcaWD9NiMKd-m8YTbr2jcg",
                "author": "Freddy R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is probably one of my favorite places in London. The atmosphere is very good inside, always crowded so may be you will need to wait outside to wait for your table! But trust me it worth it. There is no menu only one menu salad, meat and chips thats it. But everything is cooked with heart and Quality always same. Enjoy it!!!",
                "datePublished": "2018-09-15"
            },
            {
                "reviewId": "kQqDqU3ioYwUsMN804BZEg",
                "author": "Greg G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Just amazing. The most delicious restaurant for steak and fries in London. I've been to the one in Paris, and the one in New York City and they are all spectacular. This one does not disappoint. And if you see a line out front don't worry it moves quickly.",
                "datePublished": "2018-08-28"
            },
            {
                "reviewId": "9CBrLFKy20o_UYV2an2UAg",
                "author": "Evan F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A great dinner here with two close friends.  Atmosphere and pace is frenetic, but the close tables and loud conversation levels leads to a very communal experience.\nThe steak Porte Maillot with \"special sauce\" was executed perfectly...especially since it is the only main dish on the menu!  You simply chose the \"doneness\" of the meat.  By American standards, we ordered the \"medium\" version and it came out medium-rare (my actual preference)...just know this to help determine your desired meat temp.\nThe salad was simple and elegant, three total ingredients and that mustard-based dressing was certainly unusual but quite tasty!\nWe shared a bottle of their house (red) wine and I had a nice dessert with ice cream and bitter chocolate \"balls\" (les profiteroles au chocolat).\nA fantastic meal in a lively setting, what more could you want?",
                "datePublished": "2017-02-20"
            },
            {
                "reviewId": "fJpEOMYksgO80YUrBeYLvA",
                "author": "Shad J.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Delicious food, friendly customer service...I love the  sauce it is definitely special and hard to find any where else. I can't wait to go back here in my next visit to London.",
                "datePublished": "2017-07-18"
            },
            {
                "reviewId": "_vCskCF2t0FRohOWAv-nVA",
                "author": "Ali L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Mmmm this place takes the cake in how to create a hype, not much to write home about.. Dresserts aren't bad though",
                "datePublished": "2018-02-18"
            },
            {
                "reviewId": "NmGwzVaXaJi95HeHjO5kUA",
                "author": "Kevin J.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "We went for lunch and loved it.  It's a fixed menu that includes a green salad, thinly sliced steak, and French fries.  When you think you're done, you aren't because they will bring your second serving of meat.  The quality of the food was excellent and the atmosphere very nice too, although tables are very close together.",
                "datePublished": "2018-06-12"
            },
            {
                "reviewId": "KPj5Z2jp9JzUJ6r_uwKogQ",
                "author": "Shar B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "A little bit of Paris in London. The authentic Entrecôte right in the heart of Marleybone. From the service to the atmosphere to the food it's exactly like the original in Paris. Well done! This will be a regular stop on my London trips",
                "datePublished": "2017-12-25"
            },
            {
                "reviewId": "iTh4uDllhqeQlnOvLndQ1Q",
                "author": "Kailey O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "When there's one item on the menu, you better believe they get that right. Your only choice is \"How would you like that cooked?\". I picked medium rare, but the waitress informed me that this is cooked in the French style and medium would equal my idea of a medium rare.\nA salad was delivered first, which was greatly appreciated! The salad was a really nice, light touch to what would be a heavy hearty meal. Then the steak arrived with french fries, both which melted in your mouth.\nFor dessert, we ordered the tower of ice cream and meringue (i forgot what it was called) and the profiteroles. The latter was my favorite of the two.",
                "datePublished": "2016-06-11"
            },
            {
                "reviewId": "szKqaKsIVYKUx0vq0e8pgQ",
                "author": "Andrew R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Excellent steak. Love the \"Secret Sauce\" great service. Opens at 1800. Be there early or stand in line.",
                "datePublished": "2017-03-16"
            },
            {
                "reviewId": "5T4QFULyXZACdRFdrJEWOQ",
                "author": "London S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Excellent food. Perfect salade, perfect steak, sauce and fries. 4 stars and not 5 because you can't book and the queue can be horrendous.",
                "datePublished": "2018-02-10"
            },
            {
                "reviewId": "j9X3i4bsgIfzfuGfvPitIg",
                "author": "Daniel F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Melt in your mouth steak L'entricote with that classic sauce they do. I don't know what exactly is in it, but always ask for an extra pot on the side it's so damn good. \nJust when you think you've devoured it all, they come back with a full second portion of all this too. Ohhh seconds?? Yes please.\nAll this is after you enjoy a wardorf salad as part of your main, which is fab too.\nThis place has a few restaurants around town as well as NYC and Paris were it originated from. With one thing on the menu, sit back, order a glass of red wine and wait for the sensory delights to arrive (twice). It's consistently good whichever branch I've been at (note- I once went Canary Wharf and they had 50% off at weekends).",
                "datePublished": "2016-01-12"
            },
            {
                "reviewId": "0sM-sgeFanZC4QwuIBw7hw",
                "author": "Ming B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "\"WOOHOO! AS GOOD AS IT GETS\" definitely describes this place. A friend first brought me here on a cold day where we ended up waiting 20 minutes for a table. But I came back the following week with friends, and then again with my family, until we figured out it was best to come before it opens to be the first wave of customers in. And then it became a regular thing with anyone visiting, ever. Or any catch up, or any birthday celebrations - yes - we're going to Le Relais de Venise L'Entrecote for dinner.\nThe experience starts with a mouth watering walnut salad with this yummy sauce, but the unspeakably good star of the show is the sauce that comes with the steak. Let me rewind a bit and say that steak and fries is all you're gonna get. You tell the waitress how you like it (blue, rare, medium or well done - there is no in-betweens), she writes it on the table and off she goes. When it comes out - you are presented with a plate of delicious steak and fries to mop up all the excess sauce you manage not to cram in on every single bite. \nI was so shocked the first time I came here because, as normal, I finished my meal in record time still lusting for more. AND MORE THERE WAS. The waitress comes back with the SECOND HALF (?!?!) of your meal, the steak that was still in the kitchen so that it won't go cold, and an extra helping of fries. Lord have mercy.\nAnd once you think you can't go on, you have a look around and get massive food envy as all these delicious looking desserts start piling out. Now, I don't speak french so you're just gonna have to figure this one out on the menu yourself but the MUST orders are the profiteroles (which I usually don't like, but these are filled with vanilla ice cream instead of cream and are DELICIOUS!) and this stack of ice cream, meringue, praline, amazingness.\nThis place is definitely a 10/10 in my books!",
                "datePublished": "2015-04-24"
            },
            {
                "reviewId": "dKaqjByIahGgR2opvcZehg",
                "author": "Kamran N.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I don't understand what the whole fuss is about: we waited in the queue outside (or in American term: we waited in the line!) Then we were served two small portions of steak with a special sauce but frankly speaking I had much better steaks but the fries was great. The waitress was super serious and when we asked to have our photo taken, she commented that if it is quick! I know it is hectic but a photo at most takes 10 seconds! Anyway, I don't think I will go back here.",
                "datePublished": "2016-08-03"
            },
            {
                "reviewId": "WMEmSxb5UoI-SdtY1H-tqA",
                "author": "Shirley C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I was told rare is bleeding but what I really got was medium rare, no blood, and the famous sauce that was really just supplementary rather then complimentary to the very mediocrely cooked meat...",
                "datePublished": "2017-08-09"
            },
            {
                "reviewId": "6rLKWVMFMiWvVYRXmA0qcg",
                "author": "Amanda S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place had only our reserved table free when we arrived, it was packed and I understood why after we ate! The menu is set and in my opinion, perfect. They start you off asking how you like your meat and then bring you a little tasty salad with a mustard vinaigrette. Shortly after you finish your salad they bring you a plate with a semi small amount of steak in peppercorn sauce and fries. Don't worry about the size! They come around after you've eaten your way through it with plate refills of fries AND steak! I was full from my first plate (looks can be deceiving with size! Eyes bigger than stomach!) I can say without any doubt this is the best steak I've ever eaten. It was cooked perfectly and the meat was flawless, zero gristle to trim and full of flavor. I had a delightful Peruvian beer with dinner and creme brûlée for dessert - my man had a small bottle of red wine. The waitress was friendly and checked in with us a few times. I dream of this meal!",
                "datePublished": "2017-01-22"
            },
            {
                "reviewId": "QNh-TLr-rEqrpNNVfOm0GQ",
                "author": "Derrick K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Intimate and vibrant french restaurant that serves up only one dish, which is steak and frites. The cut is \"La Entrecôte\" which is the cut from the ribs.\nYou only need to make two choices:\n1. What to drink?\n2. How you like your meat prepared; rare, medium or well\nAfter that it is cruise control. The meal starts with salad dressed with a mustard dressing and bread. Next comes the delicious steak and frites. The surprise is the second serving of both steak and frites. That put a smile on my face.",
                "datePublished": "2015-04-20"
            },
            {
                "reviewId": "SF_aaCk5OI5E866uWs6J1Q",
                "author": "Nirmal P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Yes, it hit the spot!  Simple and Delicious steak and frites! That sauce is A+\nHighlights:  Steak cooked to perfection with generous portions of frites...plus SECONDS! Reasonably priced, Good and fast service all inside a nice, clean and big dinning area.  Also, desserts are awesome.  \nCan improve:  Take reservations and Give Ketchup or Tomato Sauce.\nBenchmark:  I am not a big steak & frites guy and even I found it irresistible.  They set the steak & frites benchmark in my book.\nWord of advice:  They don't take reservations so go early when they open for dinner around 7 pm and you should have no problem getting a table.\nDined in April 2016 and will definitely return.",
                "datePublished": "2016-04-18"
            },
            {
                "reviewId": "WgMEI_YXrq7ydcBVuEPiKQ",
                "author": "Karla L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "We arrived when they opened and got right in.  The service was excellent and the food was delicious.  I loved that I didn't have to decide what to eat, just told them how I like my meat cooked and they take it from there. The salad was fresh and delicious, they provided bread which was crispy on the outside and soft inside.  The steak was perfectly sliced and done to my liking. The sauce was amazing, and the fries were perfectly cooked.  They even offer you a second helping if you want. For desert we tried the Le Vacherin du Relais, it was layers of meringue and ice cream topped with hot chocolate and whip cream - it was incredible. I wish they had a location in Los Angeles where I live.",
                "datePublished": "2016-05-24"
            }
        ]
    },
    "20": {
        "id": "ga_A83dfGW8VhNHQ5JLT3A",
        "name": "Le Relais de Venise L’Entrecôte",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Marylebone",
            "streetAddress": "120 Marylebone Lane\nLondon W1U 2QG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hLn4o8RhI6JbQDn5H1t_Ww/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7486 0878",
        "review": [
            {
                "reviewId": "ftqx452mWfHRa93XDn7TzQ",
                "author": "Amy C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great restaurant experience here. Excellent service, perfectly cooked steak and delish crispy French fries. We had the house red wine which was also very good. They have a location in New York too that I want to try :)",
                "datePublished": "2016-07-10"
            },
            {
                "reviewId": "yEJ7qGFNpqHegwsggHpM8w",
                "author": "Shona B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Le Relais de venise only does one thing, but it does it well: steak frittes. On being seated, the server will ask how you want your steak cooked - if you're vegetarian and/or have a nut allergy, this is your opportunity to shout. The green salad brought to you before your main has walnuts on top, but if you ask for them to be left off, it's not a problem. What may be a bigger problem is that the chips are cooked in groundnut oil - if you have a peanut allergy, you will starve.\nI believe vegetarians can substitute their steak for a lot of cheese, but it's an expensive option. £24 for steak frittes or £24 for fromage frittes with a dessert. If you're a veggie, I just wouldn't bother.\nThe steak is brought to you in two parts, which effectively works out as two giant plates of cow and chips, so it's a big undertaking. My advice is to skip lunch because if you can't finish the main, you will be disappointed with yourself.\nThe desserts are around the £5/£6 mark and are nice (the crème brûlée is a reliable offering) however you will probably be too full to manage one. House wine (around £5 a glass, £10 for a carafe, £20 for a bottle) is drinkable enough.\nYou can't book a table even if you're a group, so eat early (5.30pm) or expect to queue out the door. Although tables are a little close, that's because there are a lot of people who want to get in and don't mind sitting on their neighbours.\nAll in all, this isn't a cheap meal, but it's a substantial one, cooked well.",
                "datePublished": "2016-05-26"
            },
            {
                "reviewId": "Jzt9FauezyAWJ-T4u39BPA",
                "author": "Mario G.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This is my second time here for dinner. I won't say the food isn't good but what I can say is the service is really a DISASTER! \nOne girl who served at our table always put on a shit face and was very rude. We had four people here and she was keeping pushing the table to my friends side which made them really uncomfortable, and she didn't say anything about that. Apart from that, my friends went shopping afternoon so they had some big bags, in case that those would block the aisle, they saved their belongings temporarily at the cloakroom. When we about to leave and asked staff to get the stuff back, one girl just stared at us with very disgusting face and chose to ignore us.\nSo, if you want to experience this kind of world standard shit service, please come here, I bet you've got little temper to lose here.",
                "datePublished": "2016-01-28"
            },
            {
                "reviewId": "0x0ywubMzgS36GU7bwR3VQ",
                "author": "Sandra G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "YES! FINALLY A RESTAURANT THAT COOKS MY STEAK THE WAY I LIKE IT! \n(sorry for the all-caps intro, but I'm just so happy!!)\nSo, anyone who, like me, likes their steak rather under than over and is getting tired of the whole 'the least we can cook it is medium rare' bullsh*t, head to Le Relais de Venise. \nBut with the food being so good and the whole thing being VERY good value for money, you'll most probably have to queue. Though chances are I'll be in the queue too, so maybe we can have a little chat then?",
                "datePublished": "2016-01-08"
            },
            {
                "reviewId": "hAXUOnTjcF7bow4bYYTpfw",
                "author": "Menaal M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "It's one of those London things.. although not exclusively. Sauce is delicious. Meat is good quality. Salad is yummy too! No nonsense place for a fun casual meal.",
                "datePublished": "2017-02-22"
            },
            {
                "reviewId": "6kY7slA0vV5RrMwiFTH34Q",
                "author": "Mike C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "My first Le Relais experience was in Paris where I accidentally walked into that restaurant. And I enjoyed that experience. When I learned that there was another version in London, I had to make sure I had to bookmark it on my trip here.\nWalking in the London version, it even feels like you're in Paris. The tables are very cramped and that you are literally right next to another stranger only inches away. So you need to pull out the table to move around.\nAnd just like the Paris versions, there are no menus. Just steak and frites with a small salad in the beginning. But it's the sauce that makes this place standout compared to other steak joints. It has a nice, tangy vinaigrette flavor that only this restaurant can provide. The steaks by themselves are just normal steaks, served in only \"Rare\" or \"Medium.\" Even \"medium rare\" is not allowed. Again, just rare or medium here in London.\nAnd just like the Paris version, you get your second serving shortly after you finished your first plate. \nAnd as for the dessert, you may need one of the French waitresses to help you out since the menu is in French. But I went with the Profiteroles au chocolat. Nice warm chocolate smothering some vanilla ice cream with shaved walnuts. Now that is a great way to finish the meal.",
                "datePublished": "2012-06-18"
            },
            {
                "reviewId": "Us3nQg5NCFCDNfRqzkjXdA",
                "author": "Tina M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The steak was excellent. I loved it. The fries were excellent--very crisp without being dry and not too fat. The sauce was probably the best part about it, however. I feel like I've gotten comparable steak and fries elsewhere, but the sauce really brought the whole dish together. It really makes you wanna go back for more and more! I will say, however, that I've had better steak elsewhere. I may have a skewed view, though, because I had a really intense conversation with relatives while eating there and was somewhat distracted. Overall, though, this place was amazing! I'd totally come here again if I am in the neighborhood.",
                "datePublished": "2016-12-12"
            },
            {
                "reviewId": "DXv5EpAku7KPJecp-4gSmg",
                "author": "Jason E.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Excellent, faultless meal.\nThe service was attentive and efficient, but most importantly -- savvy. We all know they're trying to get customers through quickly (this place must make a FORTUNE!); however, I never felt even a little rushed. Everything was perfectly timed to allow us to enjoy a relaxed meal.\nThe house Bordeaux is super drinkable, not overly tannic, and well-balanced (even if slightly lacking in depth), with a seemingly minimal price markup for a bottle. \nWhat you get is what you come for. Delicious steak and fries. It's an excellent and simple meal perfectly executed. What more does one need to say? \nShow up early if you don't want to wait, otherwise, expect to wait!",
                "datePublished": "2015-02-01"
            },
            {
                "reviewId": "U6rxyrEcegXNryl9RohzWQ",
                "author": "Linda J.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I was meeting a girlfriend for lunch and she wanted to go to Le Relais de Venise.  I was excited because it's in my neighbourhood and I've been wanting to check it out because I've heard great things about it.\nFood: There's no menu.  They only serve steak frites and as much as you want of it.  They will ask how you would like your meat cooked.  They then start off with a simple salad, the steak comes in small slices, frites and a wonderful sauce that makes you want more.  Very simple.\nDrinks: We ordered one sprite and tap water.\nPrice: 56.10 GBP for two people.\nAmbiance: The restaurant feels like a true bistro in Paris.  It was very crowded and bustling for lunch.  It's first come, first serve and they will not seat your party until everyone is there.  \nService: This is why I gave three stars.  Here's where everything went wrong.  The service was horrible.  Our server was a woman who seemed like she hated her job.  She didn't have the time of day for us.  She was very unfriendly, curt, rude and kept bumping into my girlfriend's chair without even saying I'm sorry.  There was a table next to us that was empty and when they were about to seat two people she looked at the diners, said \"oh sh*t\" and then slammed down the cutlery and glasses onto the table.  The icing on the cake was when she was serving me the frites and dropped one in to my water glass.  She didn't apologise or even come back to replace my water.  I waited for 10 minutes, asked for a new glass of water only to find her very annoyed.\nWould I go back?  Maybe.  I wouldn't rush back and if I did go back I would definitely not sit in the section of that server if she's still there.",
                "datePublished": "2014-12-25"
            },
            {
                "reviewId": "TwjIVKNGVeubkA4p4NH5pA",
                "author": "Christie F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Love this place. No choices, just a question of how you want your steak cooked. Amazing salad; a few wine choices. This is the epitome of do one thing and do it well.",
                "datePublished": "2015-09-14"
            },
            {
                "reviewId": "LtMcyakbAo7YZRvPUk8KbQ",
                "author": "Robbie B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "One of the best restaurants in the chain compared to other locations. Always good prompt service and the food is great. You know it's good when there is such a line outside waiting to get in, so it may be better to turn up a little bit earlier than you want to eat, just in case.",
                "datePublished": "2015-11-03"
            },
            {
                "reviewId": "MYBR_w93qbCnU0erkTupkQ",
                "author": "Celine T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The steak was good but not as good as some of the other locations. The restaurant was crowded and the service staff did not care much. We went quite early so even though they don't take reservations we were able to get a table fast.",
                "datePublished": "2016-10-05"
            },
            {
                "reviewId": "hpX_katA6e02Vyyu7trwNg",
                "author": "Faisal L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "They only have one entree on the menu and that is steak. When you get there, you are asked, how do you want your steak. So the only other decision you have to make it is what to drink and what dessert to order. \nThey serve a good, fresh and healthy salad. Then comes the most sumptuous steak ever. Melt in your mouth, flavourful steak, with chips (fries). When you are done, they bring you a second serving of steak and chips.\nAmazing food, fast efficient service, and very affordable. One of my favourite spots in London, as well as in Geneva. \nBe prepared to wait in line as they don't accept reservations. I have stood in line on weekdays as well.",
                "datePublished": "2014-06-09"
            },
            {
                "reviewId": "GPlDf9CBQ9yhYay3_wqymQ",
                "author": "Kendall H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "It's a good dinner but just prepare to wait in the long line around the corner. It's all you can eat so you do get some bang for your buck. I do think there are better places  to get steak. The meat wasn't particularly good and the tight tables are a bit claustrophobic.",
                "datePublished": "2015-09-23"
            },
            {
                "reviewId": "dSxvehaIMJzIfbzz_egNdg",
                "author": "Colleen C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I hate decisions.\nSo, you can see...that means I quite love Le Relais de Venise L'Entrecote (especially when a colleague selects it, and the time) -- even though I can scarcely remember the ordering of its name. \nI assure you though, once you've been -- you'll never forget! \nTo do but one thing so well, is sometimes as magical as the green sauce the steak and chips come drizzled in. What LRdVLE lacks in choice, it makes up for 10-fold in quality. \nYou'll get this, my pretties: \n1. Steak. (the ONE option is -- \"how would you like this cooked?\")\n2. Salad. \n3. Chips. \n4. Greeeeeeeeeen sauce. \nIn perpetuity. Served by lovely French people in trim black and white uniforms. \nQuite fabulous for a business lunch (though it does fill up quickly) -- as you'll not be waiting around for everyone to make decisions and can be back to your office swiftly. The guesswork has been removed. You'll be having steak. And salad. And chips. And that green sauce everyone moans about for days and days... \nAnd if you're like me, you'll be thrilled. Yum. So French and so disciplined. \n*no reservations. \n*great deals at their Canary Wharf location, ask the servers.",
                "datePublished": "2013-07-17"
            },
            {
                "reviewId": "X9o2iNHfuFY6T4KA4bBUOQ",
                "author": "Jeremy S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "There is only one thing on the menu, apparently that's a bit of a trend around London right now (see Burger & Lobster). Delicious steak and frites, which also comes with a starter salad. The steak sauce is super buttery so prepare for a post meal coma. Also neat how they serve your main in two portions so the second half stays hot, thoughtful!",
                "datePublished": "2013-06-12"
            },
            {
                "reviewId": "FQTZnIhMsWYYw9NQipXIRA",
                "author": "Erica K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Bloody Hell (for lack of a better commonwealth expression, I apologize), this place is fabulous!\nI arrived at 6pm (when they open for dinner) sharp after attending the theater, and the line was already one block long!  We were the last group to be seated snagging the final open table, and we had a minimal wait of 10 minutes.  If I had to wait 45 minutes, I would have done it gladly.\nIntriguing fact number 1: There was no menu. I was so confused. My date (sister in law) was getting the giggles off the bat watching me trying to piece together this culinary puzzle. A lady came to take our order, simply asking how we liked our meat. Strange, what if I wanted fish....? I said rare, and then she took a marker to my side of the table with a large \"R\" (clearly it is paper table cloths!) \nIntriguing fact number 2: Then they brought out a salad. I didn't ask for a salad, but I certainly didn't send it back!  Butter leaf lettuce with walnuts and a mustard vinegrette. It was so simple and yum! \nThen the waitress came to the table and served me beautifully butterflied steak strips with a green sauces and hot chips.  The chips were long, skinny and crunchy!  And the meat, well, it was one of the best meals I've ever had. The meat is imported from Scotland, and it is in a league of it's own!!!  Intriguing fact number 3: I got my entree, twice! Oh yes, what is better than one delicious meal? Having two helpings of it! SO don't worry when you polish off your plate.... more is coming!!!\nHead out there (early) so that you can roll out of there like I did, content and happy as a clam. I wish we had one of these in Nor cal because I would be there all the time!!!",
                "datePublished": "2011-04-20"
            },
            {
                "reviewId": "Lej2HgIK26j2I_uKhRS47Q",
                "author": "Alex S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "You ever meet those people that are really, REALLY good at one thing? Like, you have that roommate you went to school with who knows trivia from \"The Matrix\" movies better than anyone, or there was that girl you crushed on who could mop the floor with anyone on Wednesday nights when the local pub is having trivia for the week and the theme is H.P. Lovecraft and you're both impressed and terrified? This place is like your friend, only they are incredibly good at serving steak and fries. Oh, and being awesomely personable. And being able to tolerate a table of out-of-towners (from Texas, to boot) with the patience and sass of someone who can easily blend patience and sass while also convincing me to have not one but two scotches after a bottle of wine. Yes, this place and the staff are that good.\nWe arrived around 8:00 on a Friday night per the recommendations of the locals. The place is a small restaurant with a line wrapping around the corner and extending back into a corner of an alley where you can look up at the guy living in the apartment across from the place who methodically paces while on the phone and organizes his shoe collection (sorry guy who lives across the place - but your shoe collection is boss). There's a reason people are willing to wait 45+ minutes in the cold and rain for this place. And if you're still reading this review, you're about to find out why.\nWe probably waited around 25 minutes, but we got lucky. A professional and polite hostess greeted us at the door when our turn in line had come and we were walked to a table in a crowded dining room. Let there be no doubt: L'Entrecote has figured out how to maximize their space and the maximum occupancy here is probably 6,000 despite being the size of my hotel's lobby. You'll be making new friends at your table, such as the traveling couple next to us who were absolutely sweet, so if you're shy, you may need to get over that real quick.\nOur waitress came over and took our order and immediately panic sunk in. No \"medium rare\" steak?! Send me back to Texas where our beef is still moo-ing when you cut into it! Turns out there was nothing to fear as the \"medium\" steak was heavenly. My advice would be to placate the salad beforehand and save room for the main course. Don't get me wrong - the salad may rock your socks off but the steak and fries will also send your socks to the cleaners and bring them back with a complimentary breath mint. \nThe whole place operates on a \"steak and fries are our entrees\" menu, and there's a reason: the sauce. If you've tasted their sauce and found it anything less than a miracle on your plate, please book a trip to the local funeral parlor because you clearly were born without a soul. I went back for seconds, another in our party went back for thirds. Add all this up on our bottle of red wine and you have a meal fit for anyone who plans on eating themselves into a coma. This doesn't even take dessert into consideration, with the absolute best profiteroles I have ever had. Bonus tip for those of you still reading: get a round of scotch (or two, in my case) with the profiteroles. Not only will the sweetest bartender in the world deliver them, but you will find out that this is a combo no one can beat without some serious effort.\nSpeaking of the sweet staff, everyone working here is an undercover angel. I'm convinced of it. I never call out staff in my reviews but our server, Asia, was phenomenal. She not only put up with our relentless questions and my request for scotch after wine and port, but she did it with a level of quick wit that immediately endeared her with all of us. The team here helps each other out, with one girl removing empty glasses deftly and naturally, the bartender delivering scotch with a divine smile, and the food runners polished and focused on their destination. Make no mistake, the reason this place operates as efficiently as it does is because of the immaculate workers under the roof.\nSure, you can knock on them for wanting to turn a table quickly to get the line out the door moving, and you can complain about the limited menu. Doing either of those is providing a grave disservice to this establishment, a hearty dining option filled with delicious food, professional staff and a diverse enough dessert menu to ensure you need to come back. And if this is your first time eating here, I genuinely envy you and what you are about to experience.",
                "datePublished": "2013-05-17"
            },
            {
                "reviewId": "5J2yqMZgTkZEMc-AMGIJUg",
                "author": "Briony C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "After a little confusion about whether this was an all you can eat place (it isn't), a group of 8 of us headed here for dinner while in London. After looking on Yelp I was really worried about just how long we'd have to queue for but thankfully on a Thursday if you arrive around 6 - 6.30, you won't have to wait at all. Score!\nWe were seated at a large table and they quickly took our orders - I mean, super quickly. The only thing available is the steak and chips (with a salad to start) and they simply ask how you want it done. Options are blue, rare, medium and well done. I went for rare as I figured this being their speciality it was better to go for less cooked than over cooked. \nI didn't particularly enjoy the salad starter, to be it was just a normal kind of salad with dressing. There was also bread on the side which again, didn't win me over as it was just a standard kind of baguette. When the steak arrived though, I was in heaven. Lovely and pink with a delicious gravy kind of sauce and a good portion of chips. I quite like that they served your meat in two goes although I'm sure the second portion that was served to me was my workmates order of blue steak as it was a hell of a lot more bloody than my first portion (that being said, I still ate it). \nService here is weird - they are all aloof and abrupt. I didn't realise we were still in those days of service, I thought that died along with Gordon Ramsay's popularity in the early 2000s. Stuffy, unfriendly service is never going to win me over no matter how good the food is. If the staff were a bit more upbeat and accommodating this place would have been upgraded to 5 stars for sure.",
                "datePublished": "2013-10-25"
            },
            {
                "reviewId": "MmP_M3phNZFjmJzL1HAUeQ",
                "author": "Tammy T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "If there is a crowd waiting outside, do not fret! The service is extremely quick. \nIf you like steak and frites, come here (because this is all they offer).  The salad has a simple mustard dressing.  The steak is covered in a green sauce that is amazing. The frites are fried to perfection. :)",
                "datePublished": "2013-06-07"
            }
        ]
    },
    "40": {
        "id": "ga_A83dfGW8VhNHQ5JLT3A",
        "name": "Le Relais de Venise L’Entrecôte",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Marylebone",
            "streetAddress": "120 Marylebone Lane\nLondon W1U 2QG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hLn4o8RhI6JbQDn5H1t_Ww/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7486 0878",
        "review": [
            {
                "reviewId": "grj2-cz8MZ928zxezQ567Q",
                "author": "Nevart S.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "I visited the restaurant last night with a group of people \nI've been a huge fan of L' entrecôte for many years, I hadn't been since 6-7 years \nService was poor, the waitress didn't speak or understand much English, the fries were cold and soggy, the meat was cold. We complained & returned the plates. Second time around they were a little better but nothing like 6-7 years ago. It was not worth the 45 min wait outside & I will never go back. So sad I always dined at the L' entrecôte  here and in Paris every time I visited. \nThey have become negligent because of their popularity",
                "datePublished": "2016-08-20"
            },
            {
                "reviewId": "nKIRI1gxonFc_X0slXbLLA",
                "author": "Glenn R.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Worst service have seen in years. Abysmal. Food swimming in dressing. Major disappointment",
                "datePublished": "2017-03-21"
            },
            {
                "reviewId": "8t4M4TmLnhc0HuOCeNXp6w",
                "author": "Mashael Z.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I was pretty excited to come here because of all the great reviews but it was just ok. There was a huge line and it was crowded but I don't understand why.\n The menu is just steak and fries with no variations at all. My husband didn't like it at all because the steak just tastes like the sauce, and he is a fan of the true taste of the steak itself which a good chef can bring out. He also didn't like the sauce that much. I like sauce more than he does so I didn't think it was so bad, but it still wasn't anywhere near as great as these reviews make it out to be. It was just a steak that was slathered in an okay sauce and as long as you like that sauce you'll be fine, because that is what everything tastes like.  Not bad but nothing special.",
                "datePublished": "2012-11-21"
            },
            {
                "reviewId": "vNr56KEjmfMLjXwINmJW9A",
                "author": "Justin F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The moment we walked into the space we knew it was going to be a great experience. Delicious food, nice atmosphere.  Loved it.",
                "datePublished": "2017-02-07"
            },
            {
                "reviewId": "gCUCsWGcGQyMvyX_dtbAxQ",
                "author": "Stephanie T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Respect for a place that can make it their business to serve just one entree. There's no \"choose from the menu\" situation. You're served a plate of salad, a plate of steak and fries, and then another plate of steak and fries.\nSteak is a food people are pretty picky about and this places manages to sell only steak and also do it successfully. You can get your cut done any degree of rare-ness and it is properly executed.\nThe merengue tower dessert is also quite good.\nI realize it doesn't sound as classy but it might be more pronounceable (and also straightforward) to call this place Steak, Steak, Frites.\nHaving visited in Paris as well I can say these people have their stuff done!",
                "datePublished": "2013-05-31"
            },
            {
                "reviewId": "uU2VQ-yyUqFK_YcpO5BmRw",
                "author": "Christina G.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Came for dinner with a friend - plan was to eat around 8:30 PM on a Wednesday, but the line was insane, so we went to the pub around the corner, had a pint, came back and the line was gone. We were seated promptly and put in our orders. I was a little hesitant to go to this place as I like my steak a certain way (blue - as in, almost still alive) and it almost always disappoints in the UK (because a steak ordered blue in Britain often comes out as medium rare or even medium - ick! And British people get twitchy if you send food back in restaurants, so it really is rolling the dice). But my friend really wanted steak and this seemed like a good option in the neighborhood.\nAs others have noted, there are no menu choices - only desired level of doneness for steak. I ordered mine blue. We also got the house Bordeaux, which paired nicely with the food. When the steak came out, it actually was blue! Success! But the plate was so ripping hot that it was starting to convert the beautiful bloody meat to a grey overcooked mess, so I had to be uncouth and evacuate it to the bread plate. The server gave me a \"wtf\" look and I tried to explain, but she didn't speak English, so they probably just thought I was a weirdo, but whatever. That's better than ending up with overcooked steak.\nOverall, it was a reasonably good dinner, but for £24, I could make myself better steak frites. Nice atmosphere, though. I'd say it's worth it if you want a simple, pretty good meal, but it's definitely not worth waiting more than a few minutes. If the line is long, probably better to find someplace else.",
                "datePublished": "2015-04-14"
            },
            {
                "reviewId": "N_T5XvTSHjtrxzPkEo4NCA",
                "author": "Jennifer D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is my favourite restaurant - though the original in Paris trumps this one, bien sur. The food is the same, just as amazing, but the atmosphere is not quite the same as in Paris. They probably treat you a bit nicer here, and ain't nobody got time for that. From the baguette to the walnut salad (the vinaigrette is divine) to the steak-frites with the extraordinary secret sauce, accompanied by the house white or a flute or two of champagne - leave me the hell alone because I'm officially in heaven. \nNo seriously, piss off. Ommmmmm...",
                "datePublished": "2014-04-19"
            },
            {
                "reviewId": "QgKT3S-Isl5btDjQnrziEQ",
                "author": "Dave S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Le Relais de Venise is the centre of the steak world. There is nothing to decide here, no options, you can either order the steak frites or you will be asked to leave. Seriously, the surly waitresses will throw you out if you don't order the steak frites. You can however, select if you would like your steak cooked blue, rare, or medium.\nSo does Le Relais de Venise live up to the hype? Most definitely. I'm still dreaming about the secret \"green sauce.\"   At 21 quid for a walnut salad, some bread and 2 servings of steak frites you can't go wrong. That's right, course 1: salad. course 2: steak frites. course 3: steak frites. So worth a visit.",
                "datePublished": "2012-02-07"
            },
            {
                "reviewId": "VHEXqcnHvhIAWsCVOxtrwA",
                "author": "Nicole D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place was awesome from the start. A delicious salad followed by steak cooked to perfection, in a crazy good sauce, served with fries/chips. How could it get better? Seconds!!! :)",
                "datePublished": "2015-12-03"
            },
            {
                "reviewId": "2WMZUQsV7UGWwKolRoRkRA",
                "author": "Jessica P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "My husband and I had dinner here with 2 friends on Monday night. The food was fantastic, I love the simple but perfectly cooked menu - and very reasonably priced. Service was prompt and friendly. I thought the house red wine wasn't great (having eaten at the same restaurant previously I remember it being better the first time).\nWill definitely go back!",
                "datePublished": "2015-04-30"
            },
            {
                "reviewId": "rSIwqCSaP1PuL8eI4FVXiQ",
                "author": "Daniel C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I start this review with a question. Is there a chance for a single option menu to represent a fantastic option for a restaurant? Le Relais de Venise L'Entrecôte proves anyone that this is indeed possible, besides the first impressions. You are probably going to be waiting in a queue in the cold for a good while, but I can guarantee it is going to be worth every second. \nSteak and fries (as much as you want for the later, obviously not for the earlier) with a wonderful sauce that is their big secret. No one knows what the recipe is, but I assure you are going to be willing for more after you finish your meal. I am not much of salad person, so that is why I am not commenting much about it (they serve before the meal).",
                "datePublished": "2015-01-03"
            },
            {
                "reviewId": "vXp_7_5KViq4WzTYTjimLw",
                "author": "Agnes L.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "After all the hype, it was a bit of a letdown for \"affordable authentic French food\" and it felt a bit touristy. \nMy context: At my local taphouse in a collegetown back in America, there is a Monday night dinner special where I can get a similar quality steak with mashed potatoes for $5 (with purchase of a craft beer on tap). So when I heard that this steak dinner would be an amazing deal and the sauce would be what seals it, I expected more.\nWhat I got (everyone gets) for 24 pound deal = \n*To start: a fairly run-of-the-mill waldorf salad (walnuts, romaine, mustard-based dressing) and half of a French baguette, which was soft but cold and I would have liked some butter to go on it. I ended up dipping it in dijion mustard, as there was a jar of it on the table and I liked the kick \n*Supposed star of the show: Two servings of steak frites (cooked only at rare, medium or well, already slice and covered in a mustard-based sauce) - This might sound like the typical (possibly ignorant) American tourist, but I'm not used to already have my steak cut for me and not being able to order my desired medium rare. The sauce also tasted a bit bland to me. The frites were fine - shoe-string so extra crispy. Overall, this was plenty of food but afterward, I felt unsatisfied so I ordered dessert (rare for me!)\nUltimate letdown - the lemon tarts. I was shocked to receive what seemed like grocery chain store quality dessert as they had rock hard crust that seemed to lack sugar and a filling that tasted more saccharine rather than zippy from citrus (which I craved).\nWith a glass of the cheapest house red wine and gratuity added on to the bill, my dinner ran closer to 40 pounds total. So I suggest to avoid waiting in line, and instead save your money for street or pub food of similar (sometimes better) quality for a quarter of the cost.",
                "datePublished": "2014-11-30"
            },
            {
                "reviewId": "WJs4j4gwUjjIxSSrFuMm8Q",
                "author": "Ariana M.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Waste of time and money to be honest. Don't believe the hype - go to Entrecôte in any other city but London puts this name to shame. \nObviously it took long to be seated but that was expected. So was the subpar service. The food was the only thing we were really there for, and it was thoroughly disappointing. We both ordered medium steak and it came pretty much well done and at room temperature. The sauce was average and they provide a lot of fries but a really stingy portion of meat. The salad was the best part but is the equivalent of what a 5 year old can make with basic kitchen ingredients. \nApparently the profiteroles are amazing but we were both too disappointed to devote any more time or money to this establishment. \nWhile it is not steak frites, burger and lobster knows how to perfect its dishes while providing outstanding service. What do you know, it seems possible after all.",
                "datePublished": "2015-02-27"
            },
            {
                "reviewId": "pnuoDjIyNV4xqT3Dw3YIOA",
                "author": "Samantha S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I don't know what we were thinking when we strolled over at around 7pm on a Saturday night. The line went out the door and around the corner. We waited patiently for an hour. Believe me, it was worth it. \nThey've got the formula down to a delicious science, so there's little room for personalization. They won't do your steak medium-rare, for example, and wine list is pretty much \"Red or white?\" Still, those are minor inconveniences when the result is so satisfying. The one real misstep was the crazy overload of mustard in the salad dressing. \nThis location is ideal: on a quiet side street around the corner from Marylebone High Street. The interior can be a bit loud and more than a bit crowded, but it feels lively rather than annoying. The service is pleasant and appropriately brisk. And they'll wrap up your leftover steak if you just can't move on to Round 2.",
                "datePublished": "2014-01-03"
            },
            {
                "reviewId": "Zxu4L9KPDQroS-OY5uCl-w",
                "author": "Rosie A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I am OBSESSED with this place. I believe they have a few other restaurants across London, I've also hit up the one near Bank, which was fabulous as well. \nNo menus, no BS. You get a waldorf salad, steak (sorry vegetarians) , chips and the most incredible sauce you will ever taste. You pay a flat rate (I can't remember exactly how much, I want to say £20) and you can basically have as much as you want to eat. The chips are crispy, the steak is super, and again, let me just say, THE SAUCE. You will dream of this sauce for days afterwards. I think there must be some highly addictive substance in it, because I was getting major withdrawals during the hazy weeks that followed. \nThe staff are attentive, the wine is reasonable but good, and it's always a buzzy atmosphere. I'm uncertain of whether you can book a table, but normally the wait isn't too long.",
                "datePublished": "2014-11-06"
            },
            {
                "reviewId": "ywmHUMALUcB-qrFs0ayJgw",
                "author": "Jodie B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Yes, we had the steak. Yes, we had the fries. And yes, it was delicious. \nIt seemed hugely touristed - and a warning - there's nothing on the menu besides steak and fries... So go for that and wine in mind, and enjoy!",
                "datePublished": "2014-02-16"
            },
            {
                "reviewId": "s2z_bEfG6d3ylJFQ0t-MiQ",
                "author": "Avi A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "It's amazing what you run into these days with a simple \"French restaurant\" google search.\nLe Relais de Venise (which I believe to mean \"Over from Venice\") is one of those cozy little restaurants neatly packed away in London's many streets and alleys. From outside it looks like a classic French cafe, which sits two minutes away from the city's busiest shopping epicenter (bond street/oxford street). \nI didn't have high expectations for this place despite the many glowing reviews my peers had given it; I quickly withdrew my preconceived notions when the meal began.\nWe arrived at 6:15 pm (15 minutes before the restaurant opens) - mind you, this is a Tuesday night, not the weekend - and the line of eagerly waiting customers was already curling around the corner. I knew I was in for a treat. It was rather funny once we were seated because I picked up the menu card (see photo) and there was literally ONE choice listed: The walnut salad and entrecote with a \"famous sauce.\" I'm a sucker for guarded restaurant secrets and I knew that must have been the reason why everyone frequents it. The meal is split into \"first\" and \"second\" service (first and second helpings) and only costs 23 pounds (~$35).. That's like restaurant week prices back in America. \nThe salad was quite simple and leafy. As I savored the tangy dijon flavor of the dressing, I took a minute to survey my surroundings. The waitresses were hustling around taking orders and serving customers. The restaurant had filled up in the first 5 minutes and there were already another 100 people waiting outside. \nOur first serving had arrived and it was a perfectly medium-rare piece of tender beef. Entrecote typically comes from the rib side of the cow, but could also be a sirloin, depending on how it's cut. I digress. The meat could have been a little warmer, but then again they were entertaining a full dinner service and the food came in a timely manner. \nThe beef was smothered in the most delicious french sauces I've ever tasted. It wasn't a bearnaise as far as I could tell. And I definitely don't think there was any pepper in it. The consistency was somewhat soupy and the greenish tinge must have been taken from an herb. After several tastings, I feel like it might be basil (perhaps an allusion to Venice/Italy?). The rich, flavorful aftertaste of butter lingered on your palate after every bite -  probably a thickening agent used at the very end. The seasoning was perfect. I also tasted some garlic and maybe white wine? If it's a french sauce, they probably began with minced shallots too, which they later strained out (providing a little sweetness). But what do I know? (see photo). I ventured to ask them, and of course I got \"it's a secret.\"\nThey gratuitously pile on a load of french fries which sort of adds an extra 500 calories to your meal, but it somehow goes well with the rest of the meat. After all, 'meat and potatoes' is always a fail-safe. When you think you're done, you're surprised to be offered another portion of everything! Each serving of beef is a little smaller than a filet, but overall, it's quite filling. It was indeed very delicious.\nWe finished the meal off with the Vacherin de Relais dessert; a tower of meringue and ice cream blanketed with chocolate syrup and a dollop of chantilly cream on top. So amazing (see photo). \nI would definitely come here again for this eating experience. You won't be spoiled for choice, but the one thing they offer is a home run. A toast to French cuisine. \n5/5",
                "datePublished": "2011-12-29"
            },
            {
                "reviewId": "B1H4LTPuFhwgfeu6_u-SDA",
                "author": "Jo H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The steak here is the best I have ever had and the service is well timed perfection.  It is also a window into the City business scene and is very buzzy and fun to participate in.  I cannot wait to return.  P.s.  Wines by the glass are all quite good.",
                "datePublished": "2016-01-01"
            },
            {
                "reviewId": "N-34nJBVhcuqEOJy0v8itg",
                "author": "Juliana K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Apparently, there is always a really long line here, so I would recommend going on a weekday when it isn't as bad.  When we got there, the line had just wrapped around the corner and we probably waited about 25 minutes to get seated, which went by quickly. \nThe menu is fixed and consists of a salad, steak, and fries.  As soon as you sit, a server greets you and immediately asks how you want your steak cooked: rare, medium, or well done.  The bread and butter they set on the table for you is quite tasty but try not to eat too much of it, because you will have a generous portion of food coming your way.  The salad comes with a mustard vinaigrette which was delicious.  As soon as you are finished, they bring you your first portion of steak with fries.  When you finish that, they will bring your second portion of steak with MORE fries.  The steak is served with their \"famous\" sauce, which was outstanding.  They do have dessert, which looked great, but I was way too full to eat anything else.\nFun:\n They serve your main course in two portions so that it remains hot.  Also, they do have a vegetarian option available!  I believe the vegetarian meal is the salad with some sort of selection of cheeses along with the fries, and your choice of dessert.  Both the vegetarian and meat-lovers meals are only 23 pounds! Not bad for great, quality food.",
                "datePublished": "2013-08-26"
            },
            {
                "reviewId": "WvJGbj5VRRi_aFxLGnHcqg",
                "author": "Amy S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Loved the salad and the ambiance was nice, however I found the steak... disappointing. \nAfter all the reviews I was really hoping for something special, but it was just, ok. The green sauce was very nice, however it wasn't something I would go out of my way to get again. Woke up this morning feeling a little queasy from the amount of oil on the fries as well...\nIt's a shame they don't do the salad with some of the steak slices on top for £10. That would be something I'd come back for. Otherwise... it's off to try the next steak place!",
                "datePublished": "2012-06-29"
            }
        ]
    },
    "60": {
        "id": "ga_A83dfGW8VhNHQ5JLT3A",
        "name": "Le Relais de Venise L’Entrecôte",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Marylebone",
            "streetAddress": "120 Marylebone Lane\nLondon W1U 2QG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hLn4o8RhI6JbQDn5H1t_Ww/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7486 0878",
        "review": [
            {
                "reviewId": "Mbd2TWxHmYkKWKSGCCtjNA",
                "author": "Ayako Y.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Really don't understand the charm of this place - I did not understand it in Paris and I still don't understand in London... I think it is French, steak and all you can eat French fries at the price of 25gbp is what makes people go crazy. I personally much rather grab a good old Babette and chips for 15-20£ rather than being in this mess..\nAlso the steak has no crust, could argue this is how French take steaks, the green sauce has hardly any flavour, the meat is under salted... The salad tends to be over dressed - the only charm seems to be fries.. Which for me is a very bad value... \nBy the way, this is one menu restaurant, salad followed by steak in green butter sauce with fries.. \nI would easily live a happy life without ever having to go.., by the way, I did not have any particularly bad experience... It is just super crowded, and chaotic for nothing for my taste.",
                "datePublished": "2014-04-05"
            },
            {
                "reviewId": "5DcUCh4EUbcLomxNwemjog",
                "author": "Nikki P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "If there's one thing this girl loves, it's a nice steak cooked rare and big ol' glass of red wine. Luckily for me, that is all this place served. My husband and I were in London for a weekend trip, and he had eaten at their location in The City while in London for work, but they were closed that night. SO, we went to this location instead. We arrived at about 7:30 pm on a sunday evening, and there was a line (note: they do NOT take reservations). However, we didn't stand in line for longer than 20 minutes. And, if it's cold (like it was the evening we went, there are heaters outside the building to keep you warm while you wait. \nWe sat down, with my husband on the booth side of the table, and myself in a normal chair. The waitress came up and to both of our surprise, pushed the table as far back towards the wall as it would go. At first I thought, well, that was bizzarre. But after I thought about it some more, there are quite a few tables crammed into such a small building. \nOrdering dinner consisted of the following: Hello and welcome. How do you like your steak cooked? Rare. And would you like something to drink? Red wine. Okay, that'll be right out. Easiest ordering process EVER! About 2 minutes later, our salad was brought out with our wine. The other nice thing about this restaurant only serving one type of food, is that your food comes out SO fast. Which pleased my belly, I was quite hungry.\nWhen the steak came out, and I saw a green sauce on top of it. I was a bit wary, as I've had some HORRIBLE sauces (most specifically roquefort sauces). But the sauce on the steak is great. The only thing I didn't like about eating here? There was too much food and I couldn't eat it all. Le sigh. \nI will definitely be going back to this restaurant the next time I'm in London. And just as a tip (at least while I was there), if you check in on yelp, you get half off on weekends at their canary wharf location.",
                "datePublished": "2013-10-16"
            },
            {
                "reviewId": "Fjia7DPYr1xELVxE9w-ttg",
                "author": "Lana B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love and live for this place. The service is superlative. The steak & sauce are orgasmic.  The salad is divine. Get a bottle of the house wine.",
                "datePublished": "2015-07-05"
            },
            {
                "reviewId": "yZOHKxrDj-UnGJk67YkUaQ",
                "author": "Schelly Y.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "No reservations and only one menu. It seems like a lot of people really like this place so maybe for me it is just a personal preference issue. I would say the food was okay but I would rather pay 21 and eat elsewhere.\nThey start with a green salad with mustard vinaigrette topped with walnuts, followed by steak frites, £21\nYour meal is servedl in two portions. There is only an option for rare or well-done.\nI thought the sauce was pretty good but the meat was slightly tough. Fries were thin cut, crispy, and not too salty.\nI really liked their profiteroles but they could have used a bit less chocolate sauce. It was drowning in it.",
                "datePublished": "2012-04-18"
            },
            {
                "reviewId": "ShK2yDdhUp8qSkyT_jHSog",
                "author": "Mehreen U.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I came here for my Dad's birthday and my brother had told us all to meet at 6, even though the place opened at 6.30.  So we got there and felt a bit silly that we were the ONLY people standing outside at that time!  But within 10mins, the queue had already started to extend around the corner!\nI like me a good tasty bit of rare steak.  And I like me some frites too.  Amazing food!  The sauce on the steak is very yum, and the steak was cooked perfectly.  Being pretty gluttonous I LOVE the fact that there are two servings!\nService is pretty rushed, but given the number of people they have to get to I didn't really mind.  However the staff were all nice and serving seemed to be carried out to military precision.\nI like the fact there's no menu, takes the burden away of studying the menu and making a decision. I'd definitely come here again,",
                "datePublished": "2011-07-24"
            },
            {
                "reviewId": "4RNNdoKDsv4GzKQvdlpkOg",
                "author": "H. W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "There wasn't a line at all when I went on a weekday around 12:30pm. The place was mostly empty with a few people dotted here and there throughout. Service was quick and efficient but not exactly warm and fuzzy. It did fill up in the next hour with people mostly there for business lunch and a few solo female shoppers with masses of shopping bags. \nThe meal itself wasn't bad. Steak medium was exactly medium, served with more fries than steak. The sauce looked mustardy and oily and tasted bland. I actually added mustard from the jar on the table to give it a kick. Walnut salad was iceberg lettuce drenched in a bland mustard dressing but had no walnuts. Baguette was near perfect though. A glass of wine came filled exactly to the pre-drawn line. \nOverall, this place was ok but I wouldn't wait any amount of time. Branches in other cities, including the original Paris location are fairly busy but there is usually no wait.",
                "datePublished": "2014-09-27"
            },
            {
                "reviewId": "h_rHgK053I3pM03-zK37jQ",
                "author": "Emily C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "No need to worry about FOMO here, or have menu angst - there is only one single thing you can order - steak and chips.  Probably a good thing there's no choice too as they want you in and out of there as quick as is humanly possible - ain't no time for dawdling! \nSo on first impression, I was wondering what all the fuss was about. We were rushed into our seats and order taken within 3 minutes (or so it felt!) There were no smiles or charm but functional swiftness.\nThen came the plate. It was tiny. My friend next to me actually said the words \"I think I'm going to cry if this is all we're getting.\" Fortunately, cry he did not, as actually, they give you a small plate initially, then give you a full top up once you're running low, so that the meat is kept cooked perfectly for you and the food stays hot. I've never seen this approach before and it's pretty cool I must say.\nThe steak comes sliced thinly, with shoestring fries and their special secret sauce on top. The sauce was unbelievably good. Between us, we couldn't figure it out. Somewhere between a gravy and a mushroom sauce with maybe a little bit of pesto thrown in?? \nMy only regret was that I ordered the steak as medium (they don't do medium rare which would be my usual order) They offer 'blue', 'rare', 'medium' and 'well done', so in future I would definitely go for rare.\nThe food really was excellent. It's just a pity you never really feel relaxed in there, and as I said, a smile wouldn't hurt. \nEither way, I'd definitely recommend!",
                "datePublished": "2013-10-21"
            },
            {
                "reviewId": "ET14Bce-RKKVyFZ8vGZuBw",
                "author": "Chloe N.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "It's salad, it's steak, it's fries. \nI've just come to say that I am a fan of what they do here and considering they serve only one dish, it's amazing how quickly the place filled up over the mid-week lunch hour. Since you can't book a table in advance, we were the first to arrive and be seated at around 12pm. However by 12.30pm almost every table was full of city workers and dwellers. \nFor around £21, you get a first portion of salad as your starter then slices of steak and fries, served with another portion of steak and fries. They're certainly hearty portions!",
                "datePublished": "2013-06-18"
            },
            {
                "reviewId": "doOFU2Rh-YVrRSh9U2nklA",
                "author": "Grace K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Steak is so juicy and good! I was hesitant with the sauce, but it was great. Didn't over power the steak...great compliment. I LOVE how they top up my steak serving after I've finished my plate! I have never experienced a \"refill\" in London! Well worth the price!",
                "datePublished": "2013-08-17"
            },
            {
                "reviewId": "TBgNxXs2N8cmhO3hI6b3RQ",
                "author": "Craig M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "For the concept, the food and the all round experience, I'm giving it 5 stars. To be honest, I really didn't want to give this place 5/5 as so many have before, it's almost a cliche.\nI can't add too much that hasn't already been said... get there early, the house red is tasty and great value, the secret sauce really is delicious.\nBut I don't think this place gets enough kudos for it's dessrts! Let's face it, apart from what you choose to imbibe, your dessert option is the biggest decision you'll make all evening! It's a long list and we plumped for 4 of them to share. Their cheese selection was very good and the profiteroles tag-teamed with the praline ice cream was a winner.\nLoved the unnannounced second serving too! I knew it was coming (Yelp told me as much) and I had a wry smile on my face when my fellow diners announced that the steak was good enough that they could eat it all over again. You should have seen their faces when our waitress started to pile more meat and frites on to their plates. \nTurns out that at L'Entrecote if you don't ask, you do get. I can work with that.",
                "datePublished": "2011-01-21"
            },
            {
                "reviewId": "csrKAsYgw2fJAtREX1AOBA",
                "author": "Rob T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Best. Steak. Ever.\nBest. Sauce. Ever.\nBest. Frites. Ever.\nAnd really good red wine. Entrecote, if you don't mind waiting in the cold for 30 minutes before hand, is a fantastic restaurant. You're only of course going to get steak here, plus the staff can be a little bit pushy if you take more than your unquoted but obviously allotted time but it really doesn't matter - the steak is that good. The sauce is incredible, and no matter how many times I go I still get excited and tell any newcomers that they'll be getting more steak than they think, with a conspiratoral wink.\nI've only been on Tuesday and Wednesday nights, but even then the place seems very busy, so I'd hesitate to say that 30 minutes is the longest you're likely to be waiting, but it really is worth it.",
                "datePublished": "2013-01-30"
            },
            {
                "reviewId": "XnjjVx6ZsIVhTASOPpsICA",
                "author": "Raymond F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "It is definitely \"as good as it gets\". I thoroughly enjoyed my meal from start to finish. And for reference, I ordered my meat rare, had a glass of bordeaux, and had creme brulee for dessert. Highly recommended!!",
                "datePublished": "2015-07-25"
            },
            {
                "reviewId": "EzS6yQMwTB7MX91bEN9eCQ",
                "author": "Natalie P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I went here a couple of weeks ago for a work lunch and I was very impressed - the only reason for not giving it a 5 star review is because this girl is not a huge steak fan, though I could perhaps be swayed with future efforts. \nOn arrival you are presented with bread and a simple, very simple salad. Then after choosing how you want your steak cooked, usual options, not long after it arrives cooked in the most divine - and secretive! - sauce ever along with a heavily heaped portion of frites. I highly recommend the house red to go along with this too, we loved it and it goes really well with the meal. When you are reaching the end of your meal, they come along with some more slices of your steak and even more frites if you require these! \nThree out of the five in our party chose desserts and we were all impressed, I had a lovely praline gelato which I recommend.  \nI would definitely recommend a visit here especially for a special occasion or a formal meal. The service was quick, efficient and friendly too making it even more of a winner. \nLocated on the very trendy / sauve Marylebone Lane, just off the High Street it is convenient for walking and / or public transport due to its close proximity to Oxford Street and Baker Street.",
                "datePublished": "2013-12-24"
            },
            {
                "reviewId": "MRXUTo8EHax5DB_Om58D0A",
                "author": "Maurizio A.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "It's been years people told me to come here, to experience their wonderful steak and their wonderful sauce and their wonderful whatsoever.\nDid I finally do it? Yes. Did I enjoy it? No. Plain. Simple.\nAs Everybody else said (and I mean every other 136 reviews), one choice salad, steak, fries. Stop. Strange, I was prepared for it, ok, Cool.\nThere is ALWAYS a queue in front of the place, on the weekend it could last for more than an hour, maybe even two. Luckily the place is REALLY crowded, otherwise there would probably a queue from there to Westminster. Ah when I mean crowded I mean SERIOUSLY crowded. I'm slim and I spent my whole time squeezed up in my seat, basically if you are more than 90 kg you'll have serious issues in finding a place here.. Maybe you are filling the place too much, you damn french business with an italian name!?!\nAh BTW, this is a french place with an italian name where most of the waitresses are polish, we had peruvian beer and english steak. Funny, for a place pretending to be french. Whatever.\nNow, the meal: first is the salad, well, wow, IT'S A DAMN SALAD WITH WALNUT AND WALNUT OIL, get over with! I mean why should I even care in having such a thing? It's just a basic salad, no preparation, nothing: the pieces are even a bit too big for a salad, and there is nothing interested in it.\nThen it comes the steak. Drum rolls, trumpets and bla bla. Well, nothing special. I mean seriously NOTHING SPECIAL.\nThe steak is good, but not that good (Wanna experience a serious steak? go to hawksmoore, THERE YOU'LL HAVE A DAMN STEAK). It comes as a \"tagliata\" (don't know the english name, sorry), basically it's already cut in slices, which is a very dangerous thing to do, as the meat will be cut somewhere and then put on the plate (actually it makes two movements after, from the cutting board to the tray and from the tray to the dish). Result: dry steak of course, as every bit of juice has been left over the two past surfaces. I mean there are serious errors, and they are making the strong points over that, how is it even possible!?!\nYeah theoretically the dryness of our tortured piece of meat will be covered by the sauce. Now, the sauce is said to be \"the best part\". No it's not. It's a bit blend, basically it's just a fatty buttery sauce with mustard and pesto, that's it. No inspiration, no soul, no feeling. Just the usual blend sauce you'll find next to the roast in any self service in every hotel in the world. Ouch.\nI don't even want to speak about the fries, they are just fries, whatever. My dog can prepare it. And I don't even have a dog.\nSo why the two stars!?!?\nRESURRECTION\nINSPIRATION\nHERE COMES THE DESSERT.\nYes baby, bring it on that juicy profiterole! Aaaah the profiterole , you bloody bastard! awesomely sweet on the inside, deliciously bitter on the outside, a real chocolate sauce covering splendid bigne' filled with creamy gelato. Awesome, just DAMN AWESOME.\nIf this place will even allow me to have just the profiterole avoiding that piece of boredom before, it'd deserve 5 stars. No, it'd deserve 6 stars, 7 stars, at least a galaxy.\nLONG LIFE TO THE PROFITEROLE. HALLELUJAH.",
                "datePublished": "2014-10-11"
            },
            {
                "reviewId": "EwX7xvJ3ysgdGcSzqKUcsA",
                "author": "Sam Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ordered: Steak and Pomme Frites\nPrice: about £30 including drinks\nReview: Gets to the business. Steak: Done. Chips/Fries: Done. Sauce: INSANE IN THE MEMBRANE! Get on it folks. The London L'entrecote and the Paris L'entrecote are a tour de force. Not the same style as Goodmans, Hawksmore, etc. But deliciousssss",
                "datePublished": "2013-08-05"
            },
            {
                "reviewId": "E0di0Jled5z8xDPP3kCbjQ",
                "author": "Jeremy H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Sometimes you don't need a lot of options one good option will suffice. That would be the case here, steak and fries but its amazing. Usually I would say getting steak in London is like eating sushi in Ohio However, these guys have a nice thing going.  I don't think they take reservations and I think you actually want to go when they are busy as they plan accordingly. \nI don't know when the line forms but its long and it takes a while so I wouldn't go if your in a hurry.",
                "datePublished": "2013-11-21"
            },
            {
                "reviewId": "FGeSeh7eGtNzdqq5-TL1GA",
                "author": "Natalie K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I came to this restaurant reluctantly as I am a vegetarian and L'Entrecôte is known for the steak frites. There is not a menu, you simply state how you want your meat cooked and that is all. I specified that I wanted a vegetarian order. And I'm not going to lie I was a BIT worried. I had no idea what was going to be on my plate.\nI was brought a simple salad with mixed greens, walnuts and a \"secret\" mustard dressing, which was delicious. Then they brought over the most massive, beautiful platter of assorted cheeses I have ever seen. I was able to select a bit of each cheese, which came out to be about 6 different cheeses, and quite large portions at that. From the brie to the roquefort, each one was DIVINE. Needless to say, I was the happiest camper. With my cheese, greens, and delicious glass of red, I was in heaven.\nAnd for those of you that do in fact eat meat, this is obviously the place for you. You do not only get one portion of steak, but they will bring you a second serving if you like. Their secret recipe for the green sauce that is put in the steak is incredible, I tried a spoonful. The chips are delicious too and are great for dipping in any of extra special sauce you have left on your plate.\nService is quite good here and they move rather quickly. Be prepared to shout, as the restaurant is quite loud. But it has a wonderful vibe and buzz to it. The puddings menu is quite extensive with tons of options. From rich crème brûlée to lighter sorbet options, there is something for everyone. \nSo all you vegetarians out there should never fear the lovely L'Entrecôte. It is definitely worth waiting in the que for.",
                "datePublished": "2010-07-24"
            },
            {
                "reviewId": "hHC0wGRZbexepEzY3WQTWw",
                "author": "Joshua J.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "OOOOOH ERIN L You're from Texas so you know steak so much better than Brits?\nWell ERIN, Texas is approximately 3 times the size of all of England, and they produce beef here as well (2 million heads per annum vs 6 million in Texas) and Texas is a big exporter of beef, but England consumes most locally so perhaps Texans aren't that much more fluent in cow than the English?  The numbers suggest there are as many cows per acre here as Texas -- that does sound wrong doesn't it?\nOk all that said, Texas steaks probably are better, but this is a grain-fed vs. grass-fed discussion, and reviewing a French restaurant is probably not the best place to do so. \nA meal at Le Relais is 50% food, 50% some schmuck tourist friend made me stand in a line for a restaurant that only does one dish.  I really enjoyed my last meal there, especially the salad and the fries.  Having recently eaten at 5 Guys, I don't think that is a fair comparison; McDs vs Relaix would've been more apt, as 5 Guys serve those skin-on peanut oil reeking variety which, lets be honest, are subpar to anyone that knows anything about french fries.\nI don't recall the room being so tight and the service being so snotty, but perhaps tight is relative to a Texan, you fat pigs -- JOKING, it is a bit tight in there, but as far as service goes, it depends on the server and how busy it is.  \nThe steak is quite good, though could be overly lean if one is splitting hairs, and I do enjoy the sauce.  That said, there are loads of great new steakhouses in London which might get my money before Le Relais.",
                "datePublished": "2012-10-15"
            },
            {
                "reviewId": "3z68gu50YDQ_k3PmYv3JdA",
                "author": "Jenny T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "It's very simple. There's only one thing on the menu. In fact, there is no menu.\nSalad, steak, and fries. That's it. \nAND MY GOD, IT IS AMAZING!!!",
                "datePublished": "2012-09-12"
            },
            {
                "reviewId": "C3S6HazpUakiszXEHhgW4Q",
                "author": "Lisa O.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "My brother- and sister-in-law brought me to this restaurant last week. As odd as the concept is - serving one thing - it really works. \nThe salad was just OK, but the steak and fries were divine. The house red paired well with it all. \nIt's a lively noisy place and they really pack the tables close together. I didn't mind at all. Good company, good food, and a little buzz from the wine. That's a proper night out if you ask me. \nThe lines goes at a fast pace, so don't panic if you see it snake around the side of the building.",
                "datePublished": "2013-12-03"
            }
        ]
    },
    "80": {
        "id": "ga_A83dfGW8VhNHQ5JLT3A",
        "name": "Le Relais de Venise L’Entrecôte",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Marylebone",
            "streetAddress": "120 Marylebone Lane\nLondon W1U 2QG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hLn4o8RhI6JbQDn5H1t_Ww/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7486 0878",
        "review": [
            {
                "reviewId": "w7AG0IsWLKogfXV7g1dHww",
                "author": "Nina B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Sometimes you want a Heston-type meal, prepared with all sorts of whizzy science-lab-like techniques plated with impeccable artistry on a piece of slate or a board or something that seems stylish at the time. And sometimes you want a well-prepared comforting meal on a plate.\nRelais does a good rendition of the latter, serving a well-crafted and comforting meal that always leaves me feeling like my soul has gotten a tiny bit of nourishment on top of the healthy meal I've just enjoyed.\nIt's decent value and for your money you'll have a good meal. You won't spend a lot of time pouring over the menu because it's basically steak. And frites. They're brought to you in two batches (so you don't end your meal with cold frites) with a highly addictive and mysterious secret sauce. The service could be warmer - they certainly don't aim to connect with you -  but the food itself always seems to tick the boxes, done exactly as it should be done, served in just the right amounts at the right time.\nFor those of you visiting from the States, I'll leave two comments based on previous reviews and I'll preface those comments by saying I also am from (Gasp! Horror!) Texas.\n1. This may seem like an expensive meal because of the exchange rate but actually by London standards it's not and is actually great value.\n2. You can't compare Relais to places in the states (or in London) that are or sell themselves as high-end. That's not what this place is about. It's a steak frites place, not the latest and greatest high-priced steakhouse. Will Relais serve you the best steak you've ever had? Nope. Will they serve you a well-prepared meal and bring you back for more? Yup.",
                "datePublished": "2013-01-19"
            },
            {
                "reviewId": "rB0Eku2X4jDt2GwSruv-fQ",
                "author": "Att A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "ZOMG a waiting line at 10p! That's 30 mins before closing time.\nHmm this will be hard to rate but here is my go at it:\n3* cut of meat. \n3* The green sauce, my guess, is a mixture of mustard and some green herb that reminds me of a tartier, more reduced curry mussamam for some odd reason. \n4* at my medium meat. Pink with occasional hints of red liquid.\n4* for menu choice. Can't beat \"the only thing you get to decide on is how you want your meat cooked\". Love the simplicity of it.\n5* on the way its served. The second serving with the 1/3 meat + fresh extra crispy frites is a great idea. I was getting full but the crunch of the fresh frites made me wanna finish my meal up.\n5* on the le profiteroles du chocolate- at my server's recommendation when I asked for something chocolaty thats not too sweet. Its thin choux pastry with vanilla ice cream, drenched in melted dark chocolate sauce and almond slices. (Note: my mouth is drooling as I am writing the description. I want it again!) The sensation of hot and cold in your mouth makes it extra yummy.\n6* for cute french maids in french maid outfits with matching cute personalities\n6* for service level and the way the servers handled drama. There was an overly boisterous drunk dude that stood up and started clapping at his table. Moments later he fell off his seat, hitting the customer behind me. 3 of the servers came and talked to him. One talked to him, the other two reassured the surrounding diners. 15 mins later, he started banging on the table really loudly several times and was extremely loud in his proclamations. My server went over to placate him. He instantly had his hand around her waist and as they talked, his hand went to her butt! She calmly finished talking to him and deftly maneuvered his hand away. I would have gave him a resounding punch or a kick in the groin if I was in her shoes. \nAnyway.. its a nice experience overall",
                "datePublished": "2013-04-10"
            },
            {
                "reviewId": "3Ej8eHJLEN5DpvizLCD49g",
                "author": "James N.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This place has focused on steak frites and it's great.  You get salad and bread for the starter and then you have a serving of steak and fries.  The only choice you have is how well you would like your steak cooked.  Then, when you have finished your meal, the waitress comes over to give you top-up steak and fries!  The sauce is tasty and I mopped up the rest of it with french bread.\nActually, there are times when you can have choices: the wine list and dessert time.  We had nice glasses of rose and red, but we declined dessert because we were nicely full of steak and fries.\nThere is a minimum charge of £21 per person, but this is conveniently the charge for the steak frites meal, excluding drinks and dessert.  With drinks, our bill was just over £50 for both of us.  This is reasonable for London restaurant prices and I think we will be back sometime.\nNote: you can't make bookings and we were able to get a table right away on Friday night because we got there at 6:30pm.  By the time we left, there was a decent line that turned the corner of the building outside.",
                "datePublished": "2012-04-28"
            },
            {
                "reviewId": "uXG_kQJ_mV_t72L_jFxuYg",
                "author": "Renee G.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I'd been dying to go here for weeks. Tonight all the stars aligned and I landed a table after only about a 10 minute wait. \nIn truth, I was a bit disappointed- I expected soooo much more. I suspect that it was my own build up based on reviews than their actual shortcomings. All in all, the steak was good, fries were tasty, and the sauce was interesting... sadly, it was a long way from the best steak I've ever had and odds are, I'd try another steak house before going back...",
                "datePublished": "2012-10-02"
            },
            {
                "reviewId": "EdN8g9Si6rt9S8jWFJikJw",
                "author": "Melanie Y.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "We never had steak and frites before and you would think that we would head over to Paris first to try it.  Hubby found this place on Yelp and since it was close to where we were heading, we decided to give it a try anyways.\nThe servers were mostly all french hence the restaurant's name and even though we came right around lunch time, we were able to be seated fairly quickly. \nJust like most of the reviewers, steak and frites is the only thing on the menu.  You let the server know how you want the steak to be done and in a few minutes, you see them bring over trays to the counter and our server started preparing our dish.  \nI thought it was interesting that after we were finished with our first dish, she came back again with the rest of our steak and frites to replenish.  It makes us feel like we were in a buffet but then realize that it was just the rest of our steak.  I think I would've been fine having them give it all to me at once but I guess it's the experience.\nMost of european restaurants now bring over a portable credit card machine to finish the bill transaction which is good IMO.  Definitely cuts out alot of CC fraud if any.  Although I can't say the same for this restaurant since we felt like we were robbed of our money when the bill came out to be $70 US for lunch.  That's the most we've ever paid for lunch and frankly, I think I would've been ok with a croissant sandwich in one of those takeaway restaurants. \nSo yeah, doubt we'll ever come to eat at this place especially when the pounds are so dang expensive compared to euro dollars now.  Oh well, live and learn. =D",
                "datePublished": "2010-06-10"
            },
            {
                "reviewId": "jBM0JAM1E9yhKeAqN7VUCw",
                "author": "Elise F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "We are huge fans of the Paris restaurant near Champs Élysées, so we were thrilled to go here in London.  Always go before they open and ljoin the queue.  We happened to be there on a bank holiday and they opened up at 6:30 instead of 6.  We made sure to ask for more sauce and bread to soak it up with, we are not shy- the sauce is so unique.  We ordered the profiteroles and several orders of vacheron.  The vacheron is hands down the best dessert ever!  The tower of ice cream, meringue and hazelnut chocolate sauce is not to be missed.",
                "datePublished": "2015-04-08"
            },
            {
                "reviewId": "hSCxNXmNegJxYw6qRr4p6g",
                "author": "Andrej Z.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "So I had lunch at this place the other day. I had eaten at the one in New York before, so I had an idea of what to expect.\nThe very first part of the experience was the worst part. We got there and saw a line out front waiting to get in. Unfortunately, everyone had to wait on it, both large and small groups. This was a bit disappointing since sometimes a party of two can get seated quickly in a crowded venue. Anyway we waited and it wasn't the end of the world.\nOnce we got seated, everything was great. There isn't much of a selection here as I think the only things you can get as a main are steak and fries. There could be other options, but we were both quite happy to have the steak and fries.\nBasically, the server just asks you how you like your steak and then brings you sliced steak and fries. It was quite good.\nAfter the main course we had deserts which were also quite good.\nThroughout the whole meal, service was great.\nI would definitely come back here, just not at a peak time. It might be a good place for a late lunch as there was practically no line to get in when we were leaving.",
                "datePublished": "2015-01-06"
            },
            {
                "reviewId": "3wpBNwoyKxLgxMOK3wiCtg",
                "author": "Ryan M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Hmmmm, let's see here. The only thing they serve here is beautiful steak (with a crack like sauce), frites, and salad for ridiculously cheap. Then they bring you a second helping. \nYeah, I'll wait in line for that. Again, and again, and again...",
                "datePublished": "2011-12-23"
            },
            {
                "reviewId": "9V-4Ugdk2E-_03-M634Ipg",
                "author": "Minnie M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "We made a reservation for Thursday evening, and thank goodness we did because the line was snaking out the door.\nOnce seated, we ordered the £21 prix fixe.  Bread and salad for the table were solid, but we all know we were really there for.  By the time we finished it, we were like sharks during feeding time- stalking the waitress at the corner of our hungry little eyes and hoping she would come around soon to feed our hungry little mouths.\nAnd 5 minutes she returned to the shark pen with plates full of crispy thin fries and six slices of meat doused in green sauce.  I mistakenly asked for medium and I think the medium was actually more medium-well, and the rare was actually medium.  Order rare when asked, please make your experience that much more worth it.\nBy the way I don't know what they put in that sauce, but it is in-sauce-xicating.  Pun fail, I think so.  I could drink that sauce.\nThe nicest part of this was that they come around with a second helping.  Surprise- more meat!  Can't complain about that, even if the meat was nothing mind blowing.  That sauce though, I'm coming back for you.",
                "datePublished": "2012-11-09"
            },
            {
                "reviewId": "lwlrf3eE4_MrUuLdZzLNqg",
                "author": "Miriam W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "When the paradox of choice leaves you wanting to opt out, trust Le Relais De Venise L'Entrecote to do the decision making for you. The only choice this restaurant will have you make is regarding the temperature of your steak. \nAs for wine, make it the house red; great drinkability at a decent price point.\nSoon after you place your order a pile of salad will arrive at your table dressed in a light mustardy vinaigrette with half a handful of walnuts strewn over the top. This salad tastes better than its homely appearance would have you believe.\nNext comes the steak, doused in a green sauce (don't ask what's in it, the recipe is highly guarded) and accompanied by a pile of fries. But this is only the beginning - one more portion of meat and frites is still to come! Who doesn't love seconds, right?\nIt's no surprise they do not have ketchup but no aioli either? Mustard was no stand in dipper for my frites and I was left wishing for a bit of mayonnaisey goodness. However, I soon realized that the secret green sauce did the trick. \nLe Relais De Venise L'Entrecote is a lovely little respite from poring over menus night after night in search of what's good. They serve one thing only and they do it very well.",
                "datePublished": "2009-11-05"
            },
            {
                "reviewId": "KtSZIdbTcxZMbj_xKiXz5Q",
                "author": "Deron R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Steak Frites!  Steak Frites!  Steak Frites!  That's all I heard from my local friend about this place.  \"We gotta go to steak frites!\"  I asked my friend, \"is the place really called steak frites?\"  \"No it's not, not sure exactly the name but we need to get there early to get in line- 5:30PM.  WTF!  \nAnyway, after watching the Chelsea/Portsmouth match at a local pub, which shall go nameless, we walked towards Steak Frites!  The build up to Steak Frites! was unbearable.  My friend Sean, kept talking about the one item menu, the salad, the sauce that comes with the steak, the top notch fries, how you can have seconds...etc....  I was salivating- unfortunately we arrived at 5PM and they were not open yet, but we were second line!.  \nThe brilliant part about this location is that if you get there early, you can go across the alley to the Italian restaurant (which is open), sidle up to the bar and order spiritous libations while you wait for Steak Frites! to open.  Double Jack and Coke, extra ice, keep 'em coming and thanks to Stacy for waiting in line while we went for drinks.  By the way, if you sweet talk the bartendress, she'll put your bev in a paper cup so you can go back across the street and relieve your compatriots.\nOK- finally, we were seated and this place was true to the hype.  Cute waitressess in French maids outfits, no menu, just how do you want the steak and how's your wine list- well done!  The salad with mustard dressing was devine.  The Steak Frites! were fantastic!  The sauce- nonpareil!  You will not find a better sauce.  The best part is they keep a second helping on the flame so you can have more-  then you build the perfect bite- a bit of steak, mashed into some Frites! and then dipped in their secret sauce and it is game on!  Fucking Delicious!\nHow can a restaurant serve just one thing and stay in business.  Well.... just go here and find out.  You will be rewarded!\nOh, by the way, they have dessert too.  Get it!\nGod bless this place and all the ships at sea!",
                "datePublished": "2010-07-09"
            },
            {
                "reviewId": "YsVW-SLCAxJdqSvzlbsq2A",
                "author": "mike j.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is one of those places with cult followings that you just have to check out. A little real London culture.\nIf you're reading this, you know everything awesome about this place. Yes, the sauce is that good.\nBUT HERE'S THE MEGASICKTIP: Generally there's huge lines. like, 1 hour and 15 minutes on a saturday at 7:30 kind of lines. But I found a mini loop hole: go for the first seating (they open at 6:30, so queue up before then) OR go on SUNDAY around 8. At that point there was no line at all.\n*NOTE: I saw that they actually do have vegetarian options. It's the regular starter salad, a more baller salad as a main, and a free dessert.\nCarry on.",
                "datePublished": "2011-10-30"
            },
            {
                "reviewId": "zXkScHR3a7lhHpkvoNX62Q",
                "author": "Chris D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Between this and the Canary Warf location. Come here. Between this location and Paris... Well. Hop on that train to Paris!!\nNot much can be said about Relais. It's a sweet n short menu that delivers some good comfort eats. I definitely recommend either medium or medium rare for the steak. And definitely try your luck at getting some extra sauce while you're at it! The desserts are the only part of the experience that you can probably skip on and find better options elsewhere.",
                "datePublished": "2013-01-20"
            },
            {
                "reviewId": "yQn75bHhr-2Pp45dd9exsg",
                "author": "Jalpesh T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Fantastic French steak resturant. Unique that it's a salad to start and steak and fries. That's the choice you have and you just say how you want your steak cooked. You must turn up early and wait in the queue. If you are there before it opens and happen to be around 2m round the corner you may just make the first sit in. If you are further then be ready to wait around an hour or so before you get in. So dress well and be prepared.",
                "datePublished": "2015-01-06"
            },
            {
                "reviewId": "yuLuk0IQ6m1_v4anhoxwrA",
                "author": "Qype User\n AnnieM…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "It's a cool idea to only have one thing on the menu as it makes ordering pretty quick, which is more than can be said for the wait outside. I normally REALLY hate queueing for food in London, as you're never normally more than a five minute walk away from another good eaterie. A twenty minute queue on a Wednesday night in November was a bit excessive in my opinion (but in spite of looking up alternatives on my friend's iPad we stayed the course).\n It was sort of worth the wait, as after a while you just think, we've waited this long we may as well stay. Would I do it again? Probably not.\n Steak was well cooked, the sauce tasty, the mustardy dressing on the salad was very mustardy and with two helpings, I was full.\n Profiteroles were yummy (although extremely cold fillings - not sure if it was icecream) and the tarte citron very good.\n I'm glad I went but for another twenty minute queue it would have to be super special.",
                "datePublished": "2010-11-25"
            },
            {
                "reviewId": "2Pdl5qLiE0mwCbFGAJYAzw",
                "author": "Isabel B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I had been meaning to go here for some time, and an impromptu dinner with an old friend meant I finally got my chance.. \nWith only a set menu you given the wine list  and desserts to chose from. The simple menu means that what they do cook they cook well, or medium should I say.\nMy l'entrecote steak was delicious, full of flavour and tender, cut into slices and smothered in a 'special green' sauce. Accompanied by chips that kept being refreshed, yum. The biggest and best surprise of the evening was when I was brought over a second helping of steak! What a place, and all included in the price of the set menu. \nI finished with a creme brulee which tasted just perfect!\nI would certainly return, although with wine our bill did come to £70- (for 2) so not somewhere I will be going every week. \nTips: \n1) Skip the starter salad, save space for chips and beef.\n2) Come early or you'll have to queue this place doesn't take reservations.",
                "datePublished": "2012-02-16"
            },
            {
                "reviewId": "MZvxNL4JyjFcVNfl7NsnYw",
                "author": "Norman S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I would call this place the McDonalds of steak. You get a fantastic deal on steak, salad, and fries. The food is good, but not amazing. \nI won't repeat what the other reviews attest to other than to confirm that: \n1) We waited about 45 minutes in a queue snaking around the corner.\n2) There is no main menu. Drinks and desert are extra.\n3) Vegetarian (cheese platter) includes desert \"free\".\n4) The green sauce is delish.\nEverything is rushed. The interior is loud. Waitresses in French-maid getups quickly serve you food in an efficient manner. Fries are \"pre-cooked\" (i.e., not made to order) and sit in a large tray waiting to be dished out to you. The house wine was pretty good.\nFor the steak itself, it is served in slices with green sauce. Americans who like their steak grilled will be disappointed. The steak reminds one of brisket. The steak is good, but again, not awe-inspiring. Don't expect Kobe beef.\nThe desert was disappointing. I ordered the creme puffs and my friend ordered something resembling stacked macaroons. The pastries themselves were OK, but they were slathered in chocolate. It's like someone got a bottle of Hershey's chocolate syrup and went loco. Not what I expect from a French restaurant.\nAll in all Le Relais provides a unique experience in that it efficiently serves a single menu item at a good price. Just don't be fooled by the long name of the restaurant, this isn't fine dining.",
                "datePublished": "2011-07-16"
            },
            {
                "reviewId": "gy-krGZozJW1AtscviH_yQ",
                "author": "Jaclyn M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I took my boyfriend here and he declared it his new favorite restaurant. No faffing around and you get a second portion without having to ask? Awesome.\nI'm not sure what's in that sauce (besides lots and lots of butter), but it was delicious on my steak, fries and bread. If I had something else to dip in it, I would have. Sure it's not the highest quality of steak, but that's not what you're going for.",
                "datePublished": "2011-08-24"
            },
            {
                "reviewId": "sxjjo-iDMxfdP8uBjPvUmA",
                "author": "Franck M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Not bad, steak-freedom-fries only, so don't go with other ideas in mind.\nStaff a bit cheeky and linguistically challenged.\nGood for a quick lunch Bistro style.",
                "datePublished": "2011-06-07"
            },
            {
                "reviewId": "gINRct6Z3YuyGTPLdOJtYQ",
                "author": "Anna L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This place is very simple and clear. you go there knowing what you will get in terms of food and how much you will pay. \nYou don't have to wait for long to check a menu then decide, it is only one dish plus salad\nthe service and food serving is very quick\nportion is just OK, and taste is good. \nIdeal for quick lunch",
                "datePublished": "2011-07-03"
            }
        ]
    },
    "100": {
        "id": "ga_A83dfGW8VhNHQ5JLT3A",
        "name": "Le Relais de Venise L’Entrecôte",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Marylebone",
            "streetAddress": "120 Marylebone Lane\nLondon W1U 2QG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hLn4o8RhI6JbQDn5H1t_Ww/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7486 0878",
        "review": [
            {
                "reviewId": "-hGH0Dvtg4GvpzDt8bgZ9Q",
                "author": "Sophie E.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "A very worthy sibling of Relais de Venise in the City (Throgmorton Street), this one has a ri-di-cu-lous queue starting from the moment it opens. Especially on Saturday evenings. \nThe secret is, of course, that it's open on Saturday, at least. The City one is shut.\nOh, and when you dine at either of them, keep your receipt, and you'll get 20% off your next lunch in Marylebone or dinner in the City. (there's a time limit of about a month or so)",
                "datePublished": "2012-05-11"
            },
            {
                "reviewId": "dQ1juLCN9oJnwiE0Sn3peQ",
                "author": "Fo B.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Not remotely worth £20.\nIf you advertise yourself as The Place to Go for steak frites, you had better be good. First the good things: the ambiance was noisy and convivial, the salad was excellent and the frites were spot on.\nThe steak, however, came in a roughly 6 ounce serving, drowned in a pleasant but nondescript green sauce. The meat under the sauce could just as easily have been mushrooms chicken or tofu. \nThere were seconds, which brought the total steak serving up to around 9 ounces.\nSo  £20 seems to me a lot to pay for a salad and frites, however good. Seldom has this happened, but I really felt ripped off.\nGo get a steak frites at your local, you will almost certainly get better quality at a better price.",
                "datePublished": "2012-06-03"
            },
            {
                "reviewId": "WNzoDqtnEV74wF81Rh9ZQg",
                "author": "Chuck W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Here's one American who didn't think this place was all that amazing.  \nBefore I get lambasted, here are the reasons why.  \n1) It was marketed to me as a great one-of-a-kind establishment, but it turns out they're a chain with locations all around the world.  \n2) Rushed service - since everyone knows what you're basically going to order, wine/bread/salad/steak/frites are essentially dumped out in front of you.\n3) I really hate it when waitresses ask you for still or sparkling, you say still, and they pop the cap off an expensive bottle of Evian.  Well, you won't get me again - I say tap water everywhere I go now.\n4) Nothing was that amazing.  The salad had this garlic dressing (in all honesty, it's been a while, the flavor might not have been garlic, but it was really strong whatever it was) that completely overpowered the rest of the salad, the steak had only what seemed to be a watered-down curry flavor, and the frites were tiny.  I also didn't love when they gave me more food.  Now don't get me wrong, I do love getting free food, but the way they present it has all the trappings of shoveling gruel on your plate.  The desserts looked amazing, and I ordered this macaroon tower, but they also failed to impress.\n5)  Finally, I realize they can do nothing about this, but does every freakin' person in the UK smoke?  Waiting in the 1 hour queue, we were continually blasted by smoke.  \nOn the other hand, the two people waiting behind us were a lot of fun - a great way to meet new people.  \nAnyways, if I ever want to eat here again, (and I don't), I'll just go to one of the US locations...no reason to go to a US chain when I'm overseas, and I won't be making that mistake again.",
                "datePublished": "2011-01-09"
            },
            {
                "reviewId": "NhaT3F5mhEBDnLnVfrcV9A",
                "author": "Zoe K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Such a simple concept, but one of the most enjoyable evenings I've had in a while. They don't take reservations so you start by queuing outside the restaurant, but with the heat lamps and company it can be quite an enjoyable wait. \nOnce you're seated you are presented with a fairly bland looking salad of greens, walnuts and mustard dressing accompanied by freshly baked French bread. But as I learned last night, looks can be deceiving. The mustard dressing is complex in flavour and makes the salad truly spectacular. \nYou are then given one choice, how would you like your steak cooked... rare, medium or well done. It's positively criminal to order anything other than rare. But don't worry, although rare arrives very red in colour, it does not bleed all over the plate. The steak is covered in a mystery green sauce. I have no idea what's in it, but wow it's delicious. And of course the steak is accompanied by piles of frites. Just when you think you're starting to feel full, a second helping of steak and frites are served. I ate the steak (how can you not?), but had to leave the frites so I would have room for dessert.  \nTo accompany our meal we had the house red, again it was fantastic, perfectly complementing the meal. Desserts are also delicious. I would recommend the profiteroles that are served with ice-cream instead of cream. \nAll this and just £20 a head + wine and dessert. Not a bad deal at all!",
                "datePublished": "2010-11-03"
            },
            {
                "reviewId": "put8SZkbWNv4QJNBGDQ6Jg",
                "author": "Emily M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Just found this place by accident. What a find!  The menu never changes -- but who cares?  It's a great one!  Delicious salad, steak with yummy sauce and perfectly cooked chips.\nBest to go early as a queue develops outside. Don't take reservations and won't seat you until all members of your party are present.\nThey do have a vegetarian option.",
                "datePublished": "2010-12-05"
            },
            {
                "reviewId": "gR_UjidZybbpgB8fi0-wXA",
                "author": "Courtney L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is quite the bizarre yet cute and cosy little place in Marylebone. I think that from over a hundred reviews it's obvious that it serves only one type of food - steak. I asked for my take to be medium rare and washed it down with a glass of red wine. It is as simple as that but the meal is truly worth it the long line that will surely wait for you no matter when you go. That being the main setback, consider the place a lovely dinner option and a real treat if you're a steak-lover like me.",
                "datePublished": "2014-01-09"
            },
            {
                "reviewId": "Sygt5RhOY7VL0A1X-AVkcA",
                "author": "Grant T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "After months of wanting to come here, but knowing about the queues, we were finally out and about in London and ready to eat right about the time they opened, so I figured it would be the perfect time to go (as no queue, right?) Luckily I was right and we got right in.\nThe menu, easy, steak and fries. And a salad to start. We get our salads and order our wine. The wine comes, the waitress opens it, pours a partial glass (for tasting I assume) and then sets the wine down on the table and walks off? What? Um, shouldn't you wait to make sure the wine is okay before you just leave in on the table and disappear. I mean, if it's not, I suppose we don't have to pour it and drink it, but given the servers come around practically never, that's really not an option. So I take a sip, and joking look over my shoulder, \"Oh yes, that's great thanks!\" Then the wine turns out to be NOT the wine we ordered. Luckily it was a cheaper wine, so we didn't feel so bad about drinking it, and it was quite tasty, but still, why can't the waitress remember what wine to bring? At this point I comment that perhaps they're going for the authentic French experience: rude waitstaff. Except that every place I've been to in France, they've been more than courteous and not at all rude, so clearly if that's what they're going for, they'd going for the stereotype.\nThe steaks arrived. They are arranged fairly unattractively on a small plate with a pile of chips on the side. It was decidingly unattractive and unappealing. You'd think a restaurant that does ONE dish would be able to do it in a way that actually makes it appealing to eat. It also seemed a bit small, but for some unknown reason (because it keeps the food hot maybe? I don't really know) they bring a second portion of the food around when you're done.\nThe food though, yeah it was good. The steak was cooked rare and the sauce was tasty. The chips were also great (and I used some of the mustard on them, tasty). Weirdly though, the steak itself was kind of chewy and not really that great. Again, you'd think a restaurant that ONLY MAKES THIS DISH would make it perfectly. I can cook a better steak at home. Who are the chefs that work here?\nWe get dessert: The other half orders cheese and I order the raspberry tart. I then get up to use the bathroom, and when I return, there are two strawberry tarts on the table. Um, I ordered raspberry. So I can see why they only do one dish now, because that way the servers don't have to remember what people order because clearly they can't. About five minutes later, the cheese finally comes. They serve my other half up some cheese (and it's a lot of cheese, be prepared if you order the cheese for dessert). I mention that they brought the wrong tarts. The server gave me the ugliest stare for even mentioning that it was wrong, but they said they'd bring me the correct tarts. Then they say they'll bring bread for the cheese. Afterwards, I turn to my other half and say, \"Hmm, I wonder which they'll bring first, the tarts or the bread\". Turns out I won, as the tarts turned up. I slowly start eating my tarts (which were quite tasty), and no bread shows up. Finally, I turn around and grab some random person walking by and say, \"Can we get some bread for the cheese?\"\nShe gets bread, then notices that they didn't bring a knife for the cheese (at least this one noticed), so she ran off to get the bread. The cheese turned out quite nice, but we paid the bill and left, and noticed the queue outside the door as we walked away.\nBottom line: The steaks were alright, nothing special. The desserts were good. It's worth the price, but not the wait, so go if you're planning on going early, but not if you're planning on waiting in the queue. The service is definitely not worth it (and given they only do ONE dish, you'd think they'd be WAY more organized than they actually are). And honestly, I had a better steak at La Petite Maison (and hey they actually take reservations, so you don't have to queue). I'm beginning to think that Londoners actually just really like queuing, regardless of the quality of product they'll be receiving (Monmouth coffee anyone?). Herd mentality, maybe? I don't know, but I'll be dining elsewhere for steak thank you.",
                "datePublished": "2012-08-20"
            },
            {
                "reviewId": "6M-xGFaTCWq6F4ojMKAznw",
                "author": "Gary Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Summary: Great steak, good fries, fun experience.\nCame on a weekday night around 9 PM - and there was still a 20 min wait to get in.\nSalad was good, but not spectacular. I ordered the steak rare, which it was. Fries were good when hot, but didn't hold their crispness throughout the meal, which was unfortunate. Seeing the servers and how they dealt with keeping the steak warm was interesting. I like the idea of keeping the meat warm - I personally think it's a waste to let a juicy, oozing piece of meat turn into a cold steak with congealed fat.\nWould come back again with a friend if they waned, but probably not by myself anytime soon due to the inconvenience factor.",
                "datePublished": "2011-04-06"
            },
            {
                "reviewId": "mYALjwkLiGFKPN7gOAOIeA",
                "author": "Duane G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Excellent.  Really fun place with a great but simple menu - salad, steak, chips and red wine.  Crowded, but worth the wait.  Friendly, authentic staff too.",
                "datePublished": "2014-02-07"
            },
            {
                "reviewId": "EkhmeYm1hSFsbxc-wzHy1w",
                "author": "Whitney N.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Salad. Steak. Chips.  That's it.  One set menu for a mere £19 - take it or leave it.  And people are taking it... queuing up for it in fact.\nI'm actually a vegetarian, so I've never dined here... but my friends *rave.*  They talk about how amazing the beef is... how the secret signature sauce is mouthwatering... and what a unique and impressive place this is to bring a date (provided they're a carnivore).\nThis London branch is a replica of the original successful establishment in Paris that's been a popular Parisian brasserie for nearly 50 years.  \nI love the simplicity of the concept, the secrecy of the sauce, and the established Parisan history... it all sounds so neat... if you're a beef eater at all, I highly suggest ye get thee here...",
                "datePublished": "2008-12-29"
            },
            {
                "reviewId": "E-51q86Ot0yMp_CteLDo6A",
                "author": "Erin L.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Perhaps it's a case of the Yelp curse- a well-rated restaurant with reviews that set your expectations so high, even a great restaurant couldn't possibly live up to the hype- but I wasn't all that impressed. \nIf you stumbled on this restaurant and had no idea what it was, you'd probably rate it 2 stars. Why? Let's see. After waiting outside (not terrible I must admit) you're rushed into a jam-packed restaurant, only to be sat at a table so close to the one next to it that it must be pulled all the way out before it's shoved back trapping you in the booth. Then you're met by a \"waitress\" who appears to be dressed for Halloween who asks only \"how do you want it cooked.\" At this point you had better have figured out you're there for steak, or you're screwed. They then scribble your preference on a paper table cloth and are gone. Someone else comes by less than 30 seconds later, throws a forgettable salad down and disappears. Five minutes later a different waitress returns, tosses down a plate of steak smothered in watery green sauce and overcooked, soggy fries and is gone. Sure you get two servings, but I'd trade quality over quantity any day. \nIn short:\nService? Non-existent, and my standards are low. \nSteak? I've had better off a George Foreman grill. \nGreen sauce? Seemed a bit watery and rather flavorless given all the hype. This can't be the best London can do. \nOverall? Not terrible, but certainly not five stars. I thought the meal was \"good,\" but certainly not exceptional. \nFull disclosure: I lived in Texas for a few years, so maybe I'm biased, but I've had better steak at even upscale chain restaurants like Ruth's Chris, and better fries at Five Guys. Go for the experience, if you must, but set expectations accordingly.",
                "datePublished": "2012-08-21"
            },
            {
                "reviewId": "En8Nu1bW6Bmd8wWVk5zdXA",
                "author": "Christie K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I need to come back here more often.  I always go with rare (equals to about medium cooked steak in NY) and the house wine is quite good.  I don't know what's in that green sauce but it is absolutely brilliant.",
                "datePublished": "2011-07-23"
            },
            {
                "reviewId": "lb36tx4NBjzQ3s3-P-7cmA",
                "author": "John S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Some places lose a step when they aren't busy, this place, with the high art that is the timing of fries and thin meat, loses about about 10. The salad is still great, but not overly generous. All this even after I got a free bottle of wine. Hmm?",
                "datePublished": "2013-10-29"
            },
            {
                "reviewId": "p9ftVrrIk4L6g0LpO0O7YA",
                "author": "Chris L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Find something simple and do it well.  Relais takes this formula and does it in spades.  Tender, flavourful entrecôte topped with mouth-watering butter herb sauce, perfectly cooked fries, and fresh green salad.  Being first-timers here, we were pleasantly surprised when our server came by to offer us MORE slices of juicy bovine after we had already finished our first portion of what I thought was a generous helping already.  The idea is they serve half first, then keep the other half on a warmer so that your steak never gets cold.  The atmosphere is bustling; the waitresses pretty and efficient.  Oh and a French family were gorging themselves next to our table so that's always a good sign.  Thumbs up!",
                "datePublished": "2013-01-30"
            },
            {
                "reviewId": "L1F5uejmdX0VUetYb2B1Wg",
                "author": "Rylan C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "So upon arriving at this restaurant, we realized that there was a line. What we didn't realize right away was that line went all the way around the block. My friend and I decided we'd go somewhere else. As we were about to leave, we saw them letting in 10 people so we turned back around and decided we'd stick it out. My point here is that the line goes at a moderate pace. We ended up waiting about 30-35 minutes until we were seated.\nThe concept is simple, you sit down, you get a salad and bread as a starter, french fries and steak as the main course. You can get a second serving of the steak and fries but that's it. No thirds. \nThe fries were delicious. I like the thin french fries instead of the thick chips they sell here in the UK. The steak was delicious and the sauce (bernaise?) was even better. \nI give them 5 stars for the food and 3 stars for their service. So....4 stars altogether.",
                "datePublished": "2011-03-02"
            },
            {
                "reviewId": "9sQqlCx3ycIxXQ4nTZt07Q",
                "author": "Michelle T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Excellent steak and endless fries! The special sauce is really delicious! It's hard for me to pin point what's in it. I've been here a couple if times and although its not cheap, I walk out very satisfied. It's a really nice place, the service is excellent and the steak is really perfectly cooked and served. The bread, salad and fries given are also very delicious and fresh. They have perfected every item that will be served up. Great place to take someone for something nice or for a small group of friends.",
                "datePublished": "2014-02-19"
            },
            {
                "reviewId": "jfkeYA7v_ZOogDzpLVJqCw",
                "author": ".Carl. A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Fucking amazing. Worth the wait, the line. Steak frites, meat baby ...yummmm.",
                "datePublished": "2012-02-21"
            },
            {
                "reviewId": "rdEcd_62Kx8yyjAwxmBFZA",
                "author": "Alex B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The meat they served was very well prepared (I got it cooked exactly as I ordered) and definitely of the good quality. Chips were good. However, the restaurant was very crowded and be aware for a long queue if u pop in at night.",
                "datePublished": "2014-01-08"
            },
            {
                "reviewId": "Fx4gcBdbBIcRyldFdNuzFQ",
                "author": "Constance L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Yes, I am a big fan! I love french food and really enjoyed my time here. \nThey start by asking how you want the meat, I took a star off cus I got medium and it was a bit too cooked. Next time I will get the rare. Other than that, the frites and wine were pure bliss.\nAND, for desert i had profiterol, and they were one of the most amazing desserts ever!! yum yum yum.\nIt was quiet pricey but well worth it when you have great company.",
                "datePublished": "2011-01-23"
            },
            {
                "reviewId": "BpgnLm0z7XdrylICBVEgYA",
                "author": "Anuj N.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I will be eternally grateful to my friend Aymen for introducing me to this place. The queue is worth it trust me. Just go and tell me otherwise. I thought about asking for ketchup and was quickly shot down. They take their food seriously here and so they should. The green sauce is amazing on its own,with the perfectly cooked steak and with the fries. The waitresses outfits are also cool ;)",
                "datePublished": "2013-07-16"
            }
        ]
    },
    "120": {
        "id": "ga_A83dfGW8VhNHQ5JLT3A",
        "name": "Le Relais de Venise L’Entrecôte",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Marylebone",
            "streetAddress": "120 Marylebone Lane\nLondon W1U 2QG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hLn4o8RhI6JbQDn5H1t_Ww/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7486 0878",
        "review": [
            {
                "reviewId": "ivAAOtQAcwfm0E2J3Yt3kQ",
                "author": "Jill R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Choice is over - rated, particularly when at the end of an over - stimulating day the perfect trifecta is a carnivore's dream served with a  heaping portion of crisp - to - perfection chips and a decent (drinkable) house red wine.  But wait, the surprise is in the second round of the same, so hold off on mediocre bread, and indulge in heaping round two. As you well know by the rest of these reviews, you are choice - less on menu options here, other than the temperature of the meat, and my advice  - just say bloody rare...\nI admit that I wasn't entirley oozing with love of the service or the 'all -business, no mingleness' of the server but it/she, like the food was reliable and uncomplicated.  It is yes, as it sounds - the perfect affair, ticks all of your needs, remains consistent and is never complicated.   I would say just who doesn't love a bloody steak and mound of perfect chips, but I imagine Jains, Jivamukti Yoga practitioners and Heather Mills might become irrational at this suggestion. If in fact you are of the few which like your steak trimmed and well-prepared, and your sauces basic, it is a simple must try at least once.\n8:30 on a Weds = queue which moves fairly rapidly, but be forewarned, if you want to eat with the rest of the neighbourhood consultants wear gloves.",
                "datePublished": "2010-02-10"
            },
            {
                "reviewId": "hlNxrcHlhOUrQhDFZYv1-A",
                "author": "Allen S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "It does what it says on the box.  Salad, steak, fries.  And an excellent sauce - something like anchovies, pesto, and more butter than even butter contains.\nFYI, I like the City restaurant more than the Marylebone restaurant since it's less busy and you never have to wait.",
                "datePublished": "2010-10-08"
            },
            {
                "reviewId": "sLrWbh2zrWO1Nw6I7eNMiA",
                "author": "Ed L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Set menu, starter and main. Really simple and really tasty.  Salad, steak and frites... what more could you want? Great for lunch.",
                "datePublished": "2012-12-10"
            },
            {
                "reviewId": "4kBn5Kp5hj29vDriNNSalg",
                "author": "Dori D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Set menu. You get a two course meal. First course: streak and frites. Second course: more steak and frites. You can have your steak prepared one of four ways: blue, rare, medium, well done. Don't even bother trying to deviate from one of the four options; medium rare is not an acceptable option and you will be scoffed at for the request. It's on the pricey side but definitely worth it if you're a steak fan. I am not a steak fan and I still enjoyed myself and the food. I'd definitely come back if I were in London again. Just a side note: dress schfancy.",
                "datePublished": "2013-03-02"
            },
            {
                "reviewId": "tCoVzzgnhGAPAxfeneBkYQ",
                "author": "Qype User\n little…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is probably one of my favourite restaurants in London. It is definitely fair to say that I agree with some of the poor reviews below but this is mainly down to fussy eating/not wholly realising the concept before going.\nOne thing to understand is that this is NOT a take your time over several bottles of wine place  the service is rushed and there is always a queue outside! The menu is fixed but if you are a fan of steak frites, this is definitely the place for you!\nI think £20 for a three course meal is pretty reasonable in London. Admittedly some wine included would be nice but hey, treat yourself.\nPerfect place to go if you want to squeeze dinner in before a show on the West End or have the evening sightseeing in London.",
                "datePublished": "2011-08-06"
            },
            {
                "reviewId": "GbtSkmhlH5X0ofaSo4IPsQ",
                "author": "Mairead B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Gorgeous place - wait in line (its worth it...) -get seated - quickfire the waitress arrives -eat salad with mustard dressing and walnuts and french fresh bread-  very nice fries and thin beautifully cooked steak in green sauce arrives - have a glass of wine- share your dessert - and go on your way .  They don't rush you ..but you know the deal ..take an hour have a great meal ..rare ?medium? well done? \nA lovely professional French experience, will go here lots and lots. Perfect for Sunday lunchtime or any evening you can't think where to go. Delicious , More professional restaurants please !! Love it !",
                "datePublished": "2010-10-17"
            },
            {
                "reviewId": "C3NcQIrwe8gmB2FmnejGZQ",
                "author": "Kate H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I'm pretty sure my husband would kick the world's cutest puppy just for a chance to go here every night of the week.  \nMe... well, I think it's pretty good, too.  Not kick-a-puppy-worthy, but very good.  Big fan of the house wine (it's well priced at 15 GBP a bottle), the waitresses in their cute little French maid outfits, and the prompt service.  The oft-dreaded no-reservations policy is a drag, but the line always moves quickly.  Do yourself a favour and get there at 18:30, and there won't be a wait at all!   It's really one of the best values in London, the land of over-priced everything.",
                "datePublished": "2010-05-17"
            },
            {
                "reviewId": "nQJ1qytNfxT4tiMZ9EkE0Q",
                "author": "blair k.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Sooooooo simple, yet sooooo good!!!! Even the salad!",
                "datePublished": "2012-09-08"
            },
            {
                "reviewId": "b5YLs916MK1EaHFXT7TdKw",
                "author": "Erin K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The best meal we had in London! Close seating like a Parisian cafe and efficient service. This place is a well oiled machine!\nThe food was great! No complaints at all, and I love that you get extra steak and fries :) We had the *delish* profiteroles for dessert even though I could barely fit them in my belly. Attentive, friendly service too. \nI thought it was a bit hard to find (being an outsider) so we took a cab- if you're coming from near Piccadilly it's only £6 and totally worth it!",
                "datePublished": "2010-05-30"
            },
            {
                "reviewId": "kv3FBZQEXAuBeu9d9s5goA",
                "author": "Rick B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I've long been a fan of the Relais de L'Entrecôte restaurants in Paris (3) and Geneve (1), but somehow until recently had failed to spot this one more on my own doorstep (all are run by members of the original founder's extended family).\nA simple concept - \"Steak/Frites Plus\" - but well executed.",
                "datePublished": "2010-12-23"
            },
            {
                "reviewId": "EnHx2KuEwpIeMFylyVLzVQ",
                "author": "Damien F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Let my forewarn you, dear reader, that my entire experience at this restaurant, as at so many restaurants, was spent in a very pleasant mental fog induced by copious amounts of alcohol imbibed over the course of a warmish English summer's day.  Thus this review is more of a hazy recollection of the overall sensory experience of eating at Entrecote rather than a blow by blow account of what was quite a good meal.\nI arrived at Entrecote in my customary style:  stumbling out of a cab and most likely leaving the bill for some poor sod in my company to pay.  It's easy to sum up my first impressions:  \"gee, that's a long line\".  Entrecote doesn't take bookings and so unless you time your visit cleverly you will have to hang around outside for 20 or 30 minutes.  The most observant readers out there may have noticed that I was the slightest bit sozzled and might have inferred -- correctly -- that I was not the sharpest tool in the drawer at this point of the night.\nThere followed a rather unpleasant minute or two in which I wondered how it would feel to be 20 minutes soberer in 20 minutes time, when my next alcoholic beverage could presumably be procured.  I was fortunately saved from the deep depression this sobering thought (excuse the pun) engendered by a rather wonderful group of lesbians in front of me who most ingeniously went to the pub across the street and came back with a tray of drinks!  This made the wait in the queue pass in a most agreeable fashion.\nSecond impression:  good atmosphere.  Third impression:  where's the menu?  Entrecote serve...well, entrecote and frites.  And salad.  And wine.  And bread.  I think that's about it.  Your only choice is how you want your meat done.  Being \"un snob bourré\" I of course ordered mine blue.\nFourth impression:  my plate is empty.  Fifth impression:  my plate magically refills itself!  This is the only restaurant I've ever been in where you get the exact same meal served to you twice.  Most innovative.\nThe food was pretty good, and from recollection was 20 pounds or so which for London seems OK value.  Of course our bill was far more than that due to the wine I kept ordering.  Following Hemmingway's maxim \"Any man who eats dessert is not drinking enough\", I didn't have dessert so I can't vouch for that.  I did have another bottle of wine though.",
                "datePublished": "2010-01-10"
            },
            {
                "reviewId": "04ucx3BJ668bTIULi7tzzg",
                "author": "Eric H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Really good steak frittes!  Got there right before the rush at 6:30.",
                "datePublished": "2012-03-01"
            },
            {
                "reviewId": "MKv87m5p2hrTVN8KoEFzbA",
                "author": "Beth P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Like all the other reviews so, this place is an obsession.  Found it by accident, was wondering why there was a line around the corner.  Great neighborhood location by the way.  We got right in on a weekday night.  Knew up front no menu. You get a green salad with a walnut dressing, steak, fries that's it.  They have wine and beer too.  The steak comes with this magical green sauce that they won't tell you because it's a secret recipe.  We devoured our steak and fries and then all of a sudden you get more steak and fries!  This place was so addicting and am so happy we have one here in NYC because I need to go back!",
                "datePublished": "2014-11-14"
            },
            {
                "reviewId": "xxW-ocJXtI0zK3VHuNV46A",
                "author": "Jon F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Good lord, this place is amazing.  I ate here back in November and honestly it's one of the things I remember most from my brief stay in London.  I can understand why this place is a chain, there should be one in every city.  As for the details - expect to wait in line. But it is worth the wait. \nI went on a Friday night and as long as the line was, it kept moving. The food, i.e. the one thing you can eat there, is really something. Steak and fries with the \"mystery\" sauce, that's it. I say mystery because apparently it's a pretty well guarded secret.  I've found from talking with coworkers that everyone has their opinions as to what's in it.  It's a fun game to play while you eat. After you clean your plate and reflect on the great meal you just had, the waitress appears like an angel with the second helping. \nThe house wine was decent and the price for the meal was well below the high quality of the food. We also tried a few of the deserts, which is crazy considering how full we were after the main course. It was worth the loosening of the belt.\nSeriously recommended!",
                "datePublished": "2010-02-06"
            },
            {
                "reviewId": "HebgNjd_HKcD8-kWgyyivQ",
                "author": "Lisa B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "If your in the Marylebone area, this restaurant is a must !  If u love steak & frites this is place 4 you!  Delicious ! Be prepared 2 wait ! No reservation.",
                "datePublished": "2014-04-06"
            },
            {
                "reviewId": "5pSLkhxP3kJCaIJDW4QYeg",
                "author": "Sarah J.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Perfect for a quick and tasty lunch, with a set menu starting with a tangy green salad, and then perfectly portioned slices of beef drenched in that yummy secret sauce that you'll crave even after being done with it, and a side of thin but flavorful french fries. There's a list of deserts you can end your meal with but I do especially recommend the crème brulé. The atmosphere can be great or dreadful depending on who you ask, being a loud, almost always crowded place can put off some but also, in the right mood, be quite fun! The lack of the ability to book before coming is unfortunate considering the queue that can go on for half an hour at times (though I didn't see one the last time I went), but you owe it to yourself to at least try that heavenly-sauce-drenched slices steak!",
                "datePublished": "2013-01-16"
            },
            {
                "reviewId": "L9AC9SpPZvEY2jeZDA8njw",
                "author": "Chris O.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Relais de Venise is a Parisian born phenomenon. Its original Paris bistro opened in 1959 by Paul Gineste de Saurs, who merely sought a place to serve his family's Château de Saurs wines. Opting for an especially short and traditional bistro menu of a simple salad (lettuce, walnuts and potent mustard vinaigrette), steak-frites with a butter-based secret recipe sauce of herbs, spices and condiments along with a few particularly moreish desserts (save room for the profiteroles!), the no nonsense bistro soon won fans for its quality over variety dining experience. It also won a reputation for its strict no reservations policy. Legend tells of married couples meeting on queue and of people securing their next job while waiting for their Frenchy meat and potatoes chow down.\n Based on my experience dining at the Marylebone Lane Relais (but without yet having the pleasure of visiting the flagship in Paris or their other London location in the City), I reckon the food's worth a bit of a wait. The flavoursome frites - made of Bintje potatoes from France that are hand chipped daily on the premises using a bespoke chipper to ensure a signature 7mm thin slice  are out of this world, and the much speculated upon but never revealed secret sauce is a most delectable accompaniment. Here in London, the bistros serve Donald Russell steaks from Aberdeenshire beef (supplier to HM The Queen) for their entrecote steak (which they'll even serve blue).\n An order of salad and main course is priced at £20 per person and yields a more than ample amount of food. Puds cost around £5. A glass of house red is £4.25. Vegetarians are welcome, and as a substitute for the steak a selection of cheeses is offered and a dessert is included for the same price of £20. Service is perfunctory and fast.",
                "datePublished": "2010-07-05"
            },
            {
                "reviewId": "ShVwfuBwv7HtUV9P8srusA",
                "author": "Stuart C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "When I've had a really bad day, I want to leave work and have a stress-free evening. This involves an easy choice of venue for dinner, reliably good food, maybe an affordable bottle of wine, and a food-induced coma putting me to sleep. For these nights, Relais delivers.\nThe two locations are convenient for me (The City, and Marylebone), and the food never disappoints. From the walnut salad to the expertly trimmed steak and decadent secret sauce, and just as importantly the very affordable, highly tasty house wine, it is a sure thing that always puts a smile on my face.\nNo reservations means the usual dilemma: (1) arrive before opening to beat the line, or (2) get in the queue and wait your turn. The line moves fast, and is expectedly shorter in the winter, so that helps, but in general, it moves very quickly. To facilitate this, though, you do give up some service during the meal, but as long as you have the right mindset going into it, that is manageable.\nAs for the price, at twenty pounds a head, its a little steep. But there's just nothing else like it, and when you see the demand, you can't really blame them.\nFour stars for delivering on ease, food, wine, and coma. I'll be here often!",
                "datePublished": "2010-08-10"
            },
            {
                "reviewId": "hAagvGwBUB8LXXtjWFMtrA",
                "author": "Jesse B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "when in Rome...or when in London really, L'Entrecote is the best place in London to get a bloody (quite literally) steak and fries.\nI'm a pseudo-vegetarian ie I love meat but try to avoid it\nhowever, I splurged a few summer's ago when I had a not-s0-fully-cooked steak here. The place has this whole old school feel, lyke all Victorian era and shizzle \nBasically you drink wine like it's ribena (its cheap) and pretend you're in France for a dinner.\nyeah the sauce is real good. real saucy.",
                "datePublished": "2009-01-31"
            },
            {
                "reviewId": "oEzKiacCFcrQaGQNLxFTLA",
                "author": "Chieh T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I wanted to go to the Paris-based restaurant, but the lines were always so ridiculous that I never made it out there in the four months I spent there.\nBefore coming here, I had spent the day eating half the section of Borough and having cake at Selfridge's.  Since my visiting friend INSISTED on going, I took a little digestive nap (if that even exists) and dragged myself over here, still digesting the raclette and oreo cupcake from 3 hours ago. \nOh my god I'm so glad I came. At first I kept grumbling about spending £20 on a set meal I wasn't even hungry for, but I killed this meal like it was my first in days.  You get the only choice of walnut/endive salad and choose how your meat is to be cooked.  When I received my first plate, I was a bit turned off by how small it was. But waiiiiiit, 2/3 way through I get a second plate. More meat! With some successful flirting by my friends, we get a massive dosage of fries.  The sauce is made JUST as sauce should be made in French steak de boeuf avec frites. I was so happy leaving here. SO disgustingly full, but so happy. \nIt does get very busy and you may feel a little rushed at times, but who cares. Go.",
                "datePublished": "2009-05-26"
            }
        ]
    },
    "140": {
        "id": "ga_A83dfGW8VhNHQ5JLT3A",
        "name": "Le Relais de Venise L’Entrecôte",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Marylebone",
            "streetAddress": "120 Marylebone Lane\nLondon W1U 2QG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hLn4o8RhI6JbQDn5H1t_Ww/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7486 0878",
        "review": [
            {
                "reviewId": "y6MFIdUN1uznxYIEwZLAyw",
                "author": "Tiny G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Don't you hate it when you have a favorite place that warrants 5 stars and some hater decides to say \"I don't see what all the fuss is about\"....after reading the reviews of this place I decided that I must try it (even if I have to go by myself)....well the boss decides to be a great guy and take us out for dinner and where does he take us????  To his most favorite place in the whole wide world....he was like a little kid on his way to a birthday party, practically drooling on the cab ride over going on and on about how we would love this place and that it was a \"surprise\"...well imagine my surprise when we got to the entrance with only 4 people in front of us.  Overall I had a fun time and enjoyed the food.",
                "datePublished": "2011-05-30"
            },
            {
                "reviewId": "M8itQJRKa0vpSZqdfgP5hA",
                "author": "Katherine P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The Steak is amazing and the sauce is simply the best I have ever tasted. Went to this place a couple of days ago and I know I will be visiting again.",
                "datePublished": "2012-12-02"
            },
            {
                "reviewId": "XehICYGjy-bX6BNt42a4Fw",
                "author": "Joanne L.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "deliiiiiiiicious, definitely deserves 5 stars for food, price, and venue.\ni picked this restaurant for a friend's birthday and was duly praised for my awesome choice. the queue wasn't so bad (thankfully his birthday was on a Monday), maybe 20-30 minutes? then we were seated and offered a very french style salad, you know the mustard/oil/vinaigrette sauce. then asked how we wanted our steak cooked. not only do they have one choice of menu, they also only have rare, medium, and well-done. i asked for medium rare on instinct and was shot down immediately. most of us opted for medium, with one brave frenchman getting the rare. the medium was great- more or less like the medium rare that i like.. success! \nwe ordered a bottle of house red on the recommendation of Ana H. that it was really decent wine, and upon approval of two frenchmen, decided it must be true (eyeroll). for dessert, we got the extremely decadent profiteroles. i got smashed for calling them cream puffs you can get at costco but i still think this part is true :P \ngood food, good wine, good company, topped with cream puffs.. 5 stars!",
                "datePublished": "2011-04-12"
            },
            {
                "reviewId": "_rl0BD050weiPr80_ePUaQ",
                "author": "Nick S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "One of my all-time favorites. Worth the long lines. Love the food. Everytime I visit London, i have to eat here at least once.",
                "datePublished": "2014-07-19"
            },
            {
                "reviewId": "L5HQxJnaiwD1J-1XM2Y4WA",
                "author": "grace m.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I meant to go to the Paris location when I was doing my internship in London but it was closed for the summer =( Luckily my friend, who had recommend the Paris location, knew there was also a London location and took me here on a date.\nIt's sort of hidden when I think about it since we came from Oxford Circus and had to go through all these different streets.  I remember her telling me that it was near the London Cordon Bleu Culinary School and magically remembered how to get there so that I could take my parents later when they came to visit me.\nI must say that even my father an avid steak snob, only succumbing to the likes of House of Prime Rib and places of that stature, was surprised how ridiculously fantastic the steak is here.  \nEach piece of steak is cooked to perfection and the 2nd and 3rd course are just steak and more frites!  If I could die and go to heaven I wish that L'Entrecote would be there.  It is worth every pound!",
                "datePublished": "2009-06-28"
            },
            {
                "reviewId": "adkr0c8Ers2-Hrmm5nzOog",
                "author": "Nathan L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This delightful steak only (yes - only steak on the menu) restaurant in Marylebone is pretty unique in London. There's always a queue outside, but when you finally arrive at the front prepare to be greeted by some stroppy French waiter/waitress ushering you to your seat and slapping a delicious salad on the table that you hadn't ordered. Let's just say the service isn't friendly here. Let's also say that they don't do medium rare or medium to well done.Let's also say they couldn't tell my coeliac mum whether or not their delicious green sauce had gluten in it as it's flown in from France and is a secret (what a load of tosh). Inspite of all this, their steak is really delicious. Served with fries (and only fries) you'll get a first helping, followed by a second one about 20 minutes later. You'll greedily chuff it down even if you are full. I've never made it to the dessert menu but I'm sure it's nice. Just don't ask the waiters for anything out of the ordinary or they might slap you.",
                "datePublished": "2013-04-19"
            },
            {
                "reviewId": "2-BruzeMJ1ROpbfFA2IKwQ",
                "author": "Zeta F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great food, and experience.  You can't book so if you go for lunch its best to get there as close to 12.00 as possible otherwise expect a wait.  The deserts are as good as the steak n chips set menu so save room.  My favourite is the prailine legiones.  No, its the profiteroles.  \nBeware the service is good but brutal.  Don't dither with your lunch orders and don't expect any leniency if you arrive towards closing time.  They are french after all.  Well worth a visit.",
                "datePublished": "2009-04-12"
            },
            {
                "reviewId": "7xZIiFKBide2G_Dw5ARAJA",
                "author": "Jennilee B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I was surprised by this place because we just kind of hungrily \"stumbled\" in the restaurant unknowingly. But I was in for an even greater surprise because they served two of my favorite things together- steak and french fries (or what the Brits call chips.) \nThis quaint restaurant situated near the ever-popular Marylebone High Street was bustling with people and servers dressed in \"french maid\" costumes. Very fitting I would say! \nThe whole concept of offering only a set menu of  steak frites and a green salad with mustard vinaigrette starter was a bit weird, but I liked the whole idea of not having to fuss over a French menu where I would have trouble pronouncing every other word. I enjoyed every bit of the whole entire dining experience from start to finish. The fries were quite tasty and the steak done either well or medium satisfied my insatiable appetite.",
                "datePublished": "2009-01-23"
            },
            {
                "reviewId": "KumZp64XpydkiKkTWg7Eqg",
                "author": "Mike K.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Fantastic spot - addictive food and underrated house wine.  By London standards, its a cheap meal out in an attractive location.  \nOnly knocks\n1.  Agree with the reviewer comment that its billed as a one of a kind and you travel around France and see these all over the place (twice walking around Paris, once in Bordeaux).\n2.    Compared to a good Paris bistro, the quality of the meat is pretty marginal.  \nThat said, great value for money and London needs more places like it.  Plus, I like fast service - it gets more people in the door,  \"strikeouts are boring.  Besides that they're fascist.  Throw some ground balls - its more democratic\"",
                "datePublished": "2011-05-30"
            },
            {
                "reviewId": "OWk4eQC77pgqc1F2KqcPrw",
                "author": "Aaron B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "What an awesome place on so many levels...\n1.  They don't take reservations - Awesome... I'm such a disorganised bloke that I never really think about booking until waaay to late for nice restaurants, so a 10 minute wait outside is a small price to pay for leaving a nice dinner out with my mum to the last minute...\n2.  There is no choice of mains - Awesome... My mum is sooo indecisive in restaurants that choosing from a medium sized menu can take most of the evening.  The fact that the choice is restricted to \"How do you like your steak?\"  severley cut down waiting times!\n3.  The place is packed - Awesome... There is a queue of people waiting to get in (I'd estimate between 10 mins to 45 mins whilst I was there), the tables are close together and the constant burble of conversation creates an ongoing ambience of people getting down to the no nonsense, serious business of stuffing themselves silly.  A proper unpretentious eating establishment.\n4.  The service - Awesome... Despite the busyness of the place, the servers are attentive and quick without being obtrusive.  At no point did I feel rushed, yet every time I needed something a waitress seemed to have read my mind and was standing there with what I wanted.\n5.  The wine - Awesome...  It was both super tasty (from the restaurants own vineyard) and very reasonable.\n6.  The food - You've guessed it... Awesome - The dressed walnut salad to start was delicious and the perfect size to whet my appetite without making me feel as though I was going to have to start eating the table.  The perfectly cooked steak with a divine herb butter sauce and heavenly fries were each simple, but together like all great meals far more than the sum of their parts.  NOTE: remember this is French, so if you usually like your steak medium-rare, go medium, if you usually go well done (philistine), then ask for it burned....\n7.  The price - Awesome... I see someone has had a bit of a whinge in one of the earlier reviews, but I reckon £20 for a two course dinner, paired with £17 fine wine (Making it around £60 for food and wine for 2) is damn fine value!\nI will definitely go again, the only question is whether I have to wait until I have an excuse to take someone or whether I will just pop in on my own the next time I walk past... It may well be the second!\nAwesome! Awesome! Awesome!",
                "datePublished": "2010-08-09"
            },
            {
                "reviewId": "Uh-RyUHKCecSqUBUPfqyQw",
                "author": "Ana H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "omg amazing. there are no words to describe. some people say it's a bit pretentious (they literally serve one thing: steak and fries) but its damn good. \ni've been here a few times, both with friends and my boyfriend. its just simply excellent. you sit down, they ask you how you want your steak cooked (rare, medium, well). they bring you a salad and french bread, and then bring your steak and fries in two waves.\na few tips:\n1.) you have to get here early. it opens at 6:00pm. if you are there before 6:45pm you are fine, otherwise expect to wait in line.\n2.) order the house red wine. it's good and the cheapest on the menu.\n3.) for dessert, i recommend the profiteroles and creme brulee and if you want an extra treat the dessert wine is also fab.\n4.) they do not take reservations so don't even try.\nlove love love this place.",
                "datePublished": "2010-11-23"
            },
            {
                "reviewId": "lF0FfYr2Ek_6-Nwm6oD4ww",
                "author": "Jonathan H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Novel steak frite joint built Parisian stylee... You have to wait in a queue that evaporates quickly enough.  If you're a group of two you can get in pretty quickly.  Excellent steak (but you can get better, see Goodmans or Hawksmoor), great frite and tasty side salad, feels good value for £20 and normally in and out quickly.  Highly recommended for something a bit different.  Good date place if girl/man/man/girl like meat.",
                "datePublished": "2010-10-17"
            },
            {
                "reviewId": "lkk4oFnpKSBN143RdQIsNQ",
                "author": "Qype User\n Sian…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This place is pretty amazing. There's a no booking policy, but they shift people pretty quickly (it's not the place to come for a long drawn-out romantic dinner).\n But OMG the steak. They only serve steak frites, but they do it very well. Best of all? Once you've eaten your yummy dinner, the come back with a second serving. Yep, steak frites twice! I don't know why, but having steak frites twice is going to improve my evening. And I was having a pretty great time as it was.\n They do demi bottles of wine, which is a good thing - if there's two of you, you won't get chance to finish a whole bottle before they're asking for their table back.\n The profiteroles weren't great (ice cream instead of cream) but when you're paying £19 for dinner and you get STEAK TWICE, who cares about the desserts?\n Did I mention you get steak TWICE?",
                "datePublished": "2009-08-20"
            },
            {
                "reviewId": "DUrXy5ldn_xszn51_kGdYg",
                "author": "Daniel M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great food. The sauces a the meat are definitely amazing. The single menu and the great house wine make the ordering process probably the fastest in London. The queue and the price a bit higher than the expected move it down to 4 star.",
                "datePublished": "2011-07-03"
            },
            {
                "reviewId": "PquFyUN8Xjwe5LwaNJ456A",
                "author": "Tristan C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is a great place to have a casual lunch whilst at the same time feeling like you're doing something special. This is of course courtesy of the set menu and the tastiness of the food. Of course casual is not in the pricing, but then again, neither is steak-frites with a mystery sauce.\nOn the sauce: it's good, but not mind blowing; it's not that I've had better, I just don't know if that's as good as it gets.\nOverall, nice ambiance, courtesy of the waitresses' uniforms and decor, and a nice place to get a special meal with family or a good friend.",
                "datePublished": "2009-05-25"
            },
            {
                "reviewId": "qsCoUN2TRL47ucTzo9D6xA",
                "author": "C A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "If you can't deal with a long line or only one choice on the menu, this isn't your place. \nBut if you love a proper steak frites served with a perfect sauce Diane and a yummy salad, a good wine selection, and many sweets to choose from after, look no further. \nThe food is impeccable and exactly what it is supposed to be. If you don't like it, then you don't get it.",
                "datePublished": "2010-11-16"
            },
            {
                "reviewId": "F6g04PJd0M1CDGJmY1BYwQ",
                "author": "Mark G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Le Relais De Venise is known for its steak, frites and walnut salad.  It's pretty simple but the special sauce is rich and decadent and you get two portions!  It's a very comforting meal.",
                "datePublished": "2010-09-30"
            },
            {
                "reviewId": "WjUtULlkeO8lcenIH-CvIA",
                "author": "Mark C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I have been going here for 5 years and its fantastic. If you like steak, chips and a fabulous secret sauce then this is perfect. Ok, the service is very French but overall, its a great place to go with friends, family, lovers etc. \nThe house red is excellent value and the best tasting wine on the list. Fave pud is the gateaux du relais (chocolate cake 2 ways) \nLastly, dont forget that if you want more sauce, fries or bread, they will gladly bring it to you as its all included.... if you can manage it!",
                "datePublished": "2010-02-10"
            },
            {
                "reviewId": "ZX4rhG7wR_U9XtDXSLjcXg",
                "author": "Bella W.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "I had high expectations of this restaurant since it was highly recommended by friends who've been to the original Parisian branch (which was unfortunately under renovation when I visited one Summer).\n Alas, I was rather put off by the service (snooty, impersonal French.. it's like being in Paris all over again!) and small portions.\n If you are a steak lover, you'll find the steak decent, but nothing to rave about. My impression was more of a factory production line, where the waiter asks how you want your steak done - medium rare, medium or well done. They then serve you from a tray of pre-cooked meats, rather than prepare your food individually.\n The result can be disappointing, as the meat is at times luke warm, and the standards can vary.\n I was rather incensed that the waiter served me a very small portion of beef, and gave a much larger portion to the couple beside me. We were all paying the same price! Not only that, when we were given the choice of a 2nd (and final) helping, my portions remained small! Call it bad luck, but I was NOT impressed.\n To be fair, they made very good thin cut fries, and you could have as many servings as you desired. But I was hardly there for the fries, and had not intended to fill myself with a stomachful of oily high-caloried potatoes!\n If you're after good steak, by all means try this venue since it's received a lot of thumbs up from other patrons. But I doubt you'll leave feeling much impressed - it's one of those been there, done that experiences. I won't be going back.",
                "datePublished": "2009-06-18"
            },
            {
                "reviewId": "RoDyXIb-KbMBoWPgKNk8sA",
                "author": "Anonymous P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "When I first lived abroad in Paris I had a challenging time finding, in two words, good grub.  Yo France, stop drowning everything in mayonnaise and cheese. What the hell?  So after munching on baguettes for a month I found three GO-TO places in Paris: a Lebanese restaurant where no one spoke French or English, a breakfast place called Breakfast In America (#1 and #2) and L'Entrecôte. \nI just had dinner at L'Entrecôte in London and it brought back all the fantastic memories of when I used to dine at the Paris location. \nThe menu is simple. Sliced steak and fries...and if you want, a second order of the same. A salad to start and wine. You don't have any real choices, which is great when you just want to eat. \nExpect a line, and it's really cramped quarters, but that's a part of the experience.  They don't rush you but expect to get mad-dogged if you try to hang out for more than an hour.",
                "datePublished": "2011-02-28"
            }
        ]
    },
    "160": {
        "id": "ga_A83dfGW8VhNHQ5JLT3A",
        "name": "Le Relais de Venise L’Entrecôte",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Marylebone",
            "streetAddress": "120 Marylebone Lane\nLondon W1U 2QG\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hLn4o8RhI6JbQDn5H1t_Ww/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 7486 0878",
        "review": [
            {
                "reviewId": "kcnl6GxT0ifpV39mimjZBQ",
                "author": "Andy M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "We got there in time to beat the lunch rush and were immediately seated. The salad was OK, but the steak and fries were spot on. And just when I thought I had finished a petite European lunch, the second round of steak and fries showed up, perfectly cooked to order. \nPaired with a few nice bottles of red wine, it was the perfect Friday break for our group.",
                "datePublished": "2011-08-12"
            },
            {
                "reviewId": "UABnpVCzkqBvju4N9COiNQ",
                "author": "Qype User\n Annatu…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I know the original in Paris and was excited to see that it made it across the pond. Lovely atmosphere. Great staff and the food is delicious. Definitely worth the long wait. The famous green mustard sauce tastes slightly different from the original in Paris but still very tasty. The red house wine is a lovely treat. And once you had one of those amazing desserts you know you are hooked forever.\nEnjoy!!",
                "datePublished": "2009-05-23"
            },
            {
                "reviewId": "TNWgqQP5qi90gKCHHX5zUw",
                "author": "Agi K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Words alone cannot express what a joy the food is like at this place. They say when you get older food replaces sex as as the main joy of life...I now know why.....this place should have mirrors on the ceiling....  the food is that good. The price is fair and the house wine is good also.....and oh my god they give you second portions.  I only go occassionally for fear that my love of the dining here may lead to over exursion or public indecency due to over stimulation of my taste buds.",
                "datePublished": "2010-02-15"
            },
            {
                "reviewId": "3BV4bCgYzaDtIo12oXXrew",
                "author": "Qype User\n jiamin…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "There's no menu at this place, they don't take reservations and only seat you when all of your party are present. But I've got no problems with that, because the food is so yummy. When you sit down, you get a starter salad with walnuts and some bread. Once that's done, you'll be served steak with some amazing sauce and seriously yummy fries. My favourite part is when they come back for a second round and give you more steak and slather it with more sauce. My kind of heaven. Dessert is where you can pick what you want, traditional French desserts like creme brulee, profiteroles or sorbet. I went with the Vacherin, a towering mound of meringue, ice-cream and chocolate sauce. You get lots of jealous looks too.\n Prices are fairly reasonable - all up I paid about £30 (includes 1 glass of wine and dessert). This place makes me a really happy bunny - I couldn't stop grinning like an idiot throughout the meal. Sooo going again.",
                "datePublished": "2008-11-24"
            },
            {
                "reviewId": "Vqx8e2uk1-S45tboqky_qg",
                "author": "Connie Y.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I came by myself for dinner! That's correct, you read that right.  All by myself while everyone else in line waiting outside for a seat were either in pairs or a group. Pft - yea it's awkward at first but you start to not care after a while. Plus I found this place through yelp..gotta try what my fellow yelpers recommended. It was pretty good..not sure what they hype is though. The salad was GOOD...very interesting wasabi vinegarette..i likey. So not much else to say, set menu for 20 GBP - salad, steak and fries (2 servings), dessert will cost u more than the set 20 GBP, but none of them were more than 5 GBP.  (I had good creme bruelee - perfect for one). The half bottle wine that I bought...not sure it's what everyone says it is..it's ALRIGHT..but not great for 9 GBP. meah.\nHey..my first London review! yes!!",
                "datePublished": "2010-03-05"
            },
            {
                "reviewId": "TAY08BlcOR6PxQwN_GLRKg",
                "author": "Qype User\n max_we…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Awesome and different. It loses one star for only letting you choose Rare, Medium and Well. No medium-well etc. But the desserts are to die for and it's a very unusual experience. Highly recommended.",
                "datePublished": "2008-09-22"
            },
            {
                "reviewId": "MSg2tOOPZpzmWuKoigXpKQ",
                "author": "Paul S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Wonderful.  Delicious steak frites and a green salad with a mustard vinaigrette are basically your only choice.  Service is business-like but not unfriendly.  It's an appealing setting and great food.  Well worth a visit!",
                "datePublished": "2009-02-27"
            },
            {
                "reviewId": "te0Wn2gPLWLX5Pdg2GFyNA",
                "author": "Qype User\n Stepha…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Original (no menu), good (decent meat in London), exotic (French), the deal is clear and most people will like it.\n If I may say:\n - £20 for steak should include a glass of wine. If they dwelve on their French style, the wine is missing.\n - it's not the best steak you can eat. Come on, guys, are you American or what ? It's good, not exceptional.\n - on Friday and Saturday evenings, there is a queue outside. It can take you more than half an hour to get in...\n Don't go there with your girlfriend, but with your mates :-)",
                "datePublished": "2009-10-08"
            },
            {
                "reviewId": "2cmHwub-__GpV6bDRXyz1g",
                "author": "Qype User\n honest…",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Having looked at many of the reviews I felt an urge to put fingers to keyboard. I lived in Marylebone for sometime and was always very surprised by the ques of people waiting to eat here. If you are a steak fan and looking for great meat this is not the place to go. The meat is ok, covered in a \"secret\" special source that I managed to knock up my kitchen 2 days later to as near as perfect. The service is ok, but they are a high volume restaurant, dont expect to stay to long! They do, what they do, very, very well but I still dont understand the endless Ques! What is more surprising is that directly opposite you have what is widely regarded as the best fish and chip restaurant in London, the Gun hidden behind the high street and the Autre Pied 2 mins away, which in my book knock spots of this place.... Oh and its not that im ignoring the providores its just that if you dont want to Que for dinner then I wouldnt go (sunday breakfast used to amazing, then the papers ran an article on it and you now Que for hour to get)... Start at the Prince Regent and have great night in my old manor!",
                "datePublished": "2011-01-21"
            },
            {
                "reviewId": "-iP7yZW2zKj7vAvdfos7Aw",
                "author": "Qype User\n orvist…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This place has the same business model as a restaurant in Geneva - Le Relais de l'Entrecote - and it seems just as popular. We went on Tuesday night this week and as the desciption says all they do is walnut green salad to start and then steak and frites for the main course. Its superb, served in two portions for £19. When we left they were q'ing out of the door.",
                "datePublished": "2009-01-16"
            },
            {
                "reviewId": "D9K1XQXuK-AtAg97IrFjXg",
                "author": "Nils A.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Average. 2 hour wait for small sliced up steak! I'm a South African and I know my meat....I wont be going back for it. Way too expensive.",
                "datePublished": "2010-11-28"
            },
            {
                "reviewId": "KaGuhMN9v5E4GQawaOUxlg",
                "author": "Qype User\n Yv…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "You cannot find better steak than at this restaurant. Although slightly pricey at just under £20 per head for a meal (not including drinks), it is well worth a visit or two or three! The staff are extremely efficient, sometimes friendly, sometimes not, but that doesn't matter when your meal arrives. There is no choice about what you eat. You start with an amazing green salad, followed by steak, chips and sauce, followed by seconds of steak. There is however a choice of puddings, all equally delicious. This has to be one of my favourite restaurants in London.",
                "datePublished": "2007-12-14"
            },
            {
                "reviewId": "ZUl95VUfG0WzB9o1tTduyg",
                "author": "Qype User\n jo_jo2…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "First you get a salad, then the only thing you tell the waiters is how you wish your steak to be cooked you are then presented with half of your steak and when you finish that your waiter brings the rest of it, this is complimented with chips and their authentic steak sauce. A beautiful restaurant right in the heart of marylebone village and a must for steak lovers!",
                "datePublished": "2008-01-21"
            },
            {
                "reviewId": "8xFQvlozOePqHY4tVHh-jQ",
                "author": "Qype User\n lbahos…",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "A very unique experience and food! No real menu, No reservations and only able to to be seated once all the party is present! You may think it will be a mistake visiting this restaurant, however, I can assure you the opposite is true!! You start with a decent Walnut salad but what really makes the visit more than worth while, is the Steak which is cooked in an amazing sauce, along with the best pom frites you can get anywhere in London! I promise, you will be licking your fingers afterwards!! They also have very tasty dessert list (alebit a small one) to finish of the evening with. This restaurant is simply the most addictive restaurant I have been to in London and there are only 4 of them worldwide, including Paris, New York and Dubai. I have also been to the one in Paris and it is exactly the same in terms of food testiness and set up! Cannot recommend highly enough!",
                "datePublished": "2010-07-27"
            }
        ]
    }
}