{
    "0": {
        "id": "ZxdgX8JgLADrhw_bymyF9Q",
        "name": "Balthazar",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Covent Garden, Strand",
            "streetAddress": "4-6 Russell Street\nLondon WC2B 5HZ\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media3.fl.yelpcdn.com/bphoto/FK11d_CYj43oFBmbrVnHwA/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 3301 1155",
        "review": [
            {
                "reviewId": "xSSsb3ZdGsBQeVbmTS3OkQ",
                "author": "Megan J.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "My husband and I ate dinner here before the Lion King show and had a fantastic time! \nThis French restaurant is clean, classy, and romantic. We were immediately greeted at the door and sat at a table. \nOur server, Ridas, went above and beyond to make sure that our dinner was amazing! He was such a hard worker and the restaurant is lucky to have him. \nWe started with the Burrata with tomatoes, olive oil and basil. Every ingredient in this appetizer was so fresh, kicking our meal off to a great start.\nFor dinner, I had the veal schnitzel holstein with green beans served with a fried egg on top. This schnitzel was delicious! The veal was tender and flavorful and fried to perfection--crispy and not greasy. The green beans and egg were done perfectly and added to the dish well. \nMy husband is allergic to onions and garlic and was super bummed out when they told him that the side of macaroni and cheese had his allergens. We wanted to split the mac n' cheese. Our server and the chef went ABOVE AND BEYOND to make this mac n' cheese possible for us. Ridas advocated for us and the chef made a special batch of mac n' cheese just for us. We were blown away and the mac n' cheese was so good! It was perfectly cheesy, not oily and the pasta was cooked perfectly. \nOverall, superb service, outstanding food, fair prices, and great ambiance! We will definitely be back when we go to London again!",
                "datePublished": "2018-10-10"
            },
            {
                "reviewId": "WT5NzK-Fy6-CH_zGvxBbSQ",
                "author": "Christine T.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "The hosts are very rude, it made me leave before even thinking about asking for a table, but we decided to give it another try later on. Hosts are still rude, so we just decided to grab drinks and a dessert rather than spending money here on dinner if it was going to be just as disappointing as the staff. Luckily, the bar staff is a little nicer. We ordered a carafe of red wine and dessert, which was not worth remembering the name. It was like a panda cotta with a creme brûlée top (torched sugar) which was unevenly torched, the middle too burnt and the sides left with raw sugar. I did feel like the flavors were wonderful, but the presentation was unimpressive. Overall, my experience here was not worth coming back. If you're looking for nicely done french food, keep searching. I will say the ambiance is aimed for a more romantic feel, but the decor is very similar to that of the Cheesecake Factory (an American chain restaurant.) \nI apologize for the not so great photos, the lighting inside at night is not ideal for photos and I didn't care enough to waste my time editing them.",
                "datePublished": "2018-08-07"
            },
            {
                "reviewId": "JPqwA7gr-wwdQBiyx2c4Ew",
                "author": "Quynh T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ordered take away from their bakery for a quick bite to eat! We got a sausage roll, mushroom & hummus sandwich and roast beef sandwich, totalling to £14.40. If you dine in, the cost of each dish is increased by about £1.50.\nThe sausage texture was soft like a minced meat. The roll itself was extremely oily but it tasted great (probably because of all the oil). The roast beef sandwich was great toasted, although it had too much bread and not enough sandwich contents. The mushroom & hummus sandwich came with a SURPRISE EGGPLANT. I feel like there was more eggplant than mushroom, and instead should've been called \"eggplant sandwich with mushroom and hummus.\" I'm not mad at it though because I love eggplant, but just a warning for those of you who are expecting mushrooms and hummus and end up with an eggplant too.",
                "datePublished": "2018-07-01"
            },
            {
                "reviewId": "lpXcwRVHVLlOKbj5aqQLZw",
                "author": "Jim E.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "My wife and I were just walking out of Covent Garden and spotted the restaurant. Went in and the atmosphere just felt right. The couple seated next next to us were finishing with some amazing looking desserts. So, we decided to split an entree (I.e., we are retired and ate lunch three hours earlier) and each have a dessert. The beef stroganoff was some of the best we have had anywhere. The desserts were great. Service was attentive and done as a team. This was the best meal we have had in London in over one week.  Will do our best to return again.\nBack again after two years. Still good food. On Thursday evening, it did seem noisy but still at a level where conversations could be held.",
                "datePublished": "2018-06-07"
            },
            {
                "reviewId": "OfFqEHsC9jzSJiIR-HMGnA",
                "author": "Halley D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "**Review is for the Boulangerie** \nFound myself daydreaming about food (surprise, surprise) - specifically Balthazar's hazelnut rocher. \nIt's been a while, but I still think back to my halcyon summer of snagging a fresh lemon tart or fluffy croissant each morning. Balthazar (the restaurant proper) and their adjacent Boulangerie are stationed in bustling Covent Garden. The restaurant remains woefully out of my price range, so the bakery became my preferred haunt. Grab one of their canary-yellow boxes, load up on some heavenly carbs, and resist the urge to eat them until you arrive at your dining location. \nThe shop has great versatility - everything from fresh loaves of French bread (served with giant butter pats) to whimsical, fist-sized meringues. The bread is good stuff. Full stop. Soft, warm, and perfectly crisped. Grab a loaf, head to a market for some cured meats or lox, and make some causal tartines in a local park. I've never regretted doing so. \nMy favourite desserts were the chocolate hazelnut rocher and their lemon tart. Likely in my top 5 pastries ever consumed to date? The richness and texture of the rocher's mousse was remarkable. Think a Ferrero Rocher but ten times the size, softer, and far more rich. Needless to say, the first time I tried one I was back the next day for a repeat experience. As for the lemon tart it has a thick, eggy curd. Many tarts I've had in the US suffer from that artificial gelatine-based filling (you can't even really call it a curd), but Balthazar's tastes like true sugared lemon. Their oversized macarons - almost comparable in size to a hamburger - are adorable, but just a tad saccharine for my tastes. The flourless chocolate cake sphere was like pure cocoa magma and sensationally rich. It's heaven in there. \nDidn't know there's a sister location in NYC, so my mouth is watering at the prospect at having some Balthazar bread and sweeties within (conceivable) driving distance.",
                "datePublished": "2018-01-14"
            },
            {
                "reviewId": "SrinkGsOrw8Oxjbalj2jxQ",
                "author": "Anand P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Visited Balthazar at around 10:30 PM after watching \"the women in black\" at fortune theatre. Really nice Ambience. Huge french restaurant.  Helpful and decent staff. Quick service. \nMust visit restaurant. \nThey have a good veg options too. \nNearest underground station- Covent Garden.",
                "datePublished": "2018-06-07"
            },
            {
                "reviewId": "bxPsnsAmjlGJ2EHgl8y1Cg",
                "author": "Donald A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Stumbling along with no food plans we came upon an offering of a NYC favorite. Same menu, oddly lower prices, great service and packed as any of Keith McNally's places are.",
                "datePublished": "2018-07-11"
            },
            {
                "reviewId": "I2Ytb6JAgGNVS8v4xmd-vw",
                "author": "Joanna C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I'd been meaning to go to the NY location for ages and was excited when my friend suggested we grab dinner here. We got here around 7 PM on Friday and there was no wait at all, perfect. Our server was super nice and patient! We hadn't seen each other for years so he let us catch up a bunch and was nice about the fact that we hadn't even opened our menus the first two times he came around. \nI had the Rocket and Spinach Agnolotti as an entree. Loved the bitterness of the arugula and the simple flavors worked well together. The hazelnut also added a nice tough. It seemed unnecessary oily though and felt heavy in my tummy. My friend and I then split the Creme Brulee. Good thing we did because it was massive. I enjoyed the sugary crust but the rest of it was just okay. It could've been creamier and more flavorful.  \nWe left around 10 PM and there were way more people than when we got here. Guessing it attracts the post-theater crowd. Good vibe and nice service, but mediocre food.",
                "datePublished": "2017-07-27"
            },
            {
                "reviewId": "-sE3EVSGSNR2Ir5fv2doHA",
                "author": "Richard C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The food was good, not great...but we finished our plates ;-)\nThe service by our main waiter was good, but was overwhelmed by training a new assistant/ busboy...who was in waaaay over his head. That made the wait for our dishes to be cleared as long it takes to walk Covent Garden and back... we feel sorry for anyone's first day on the job, but between hearing the manager berate the waiter, the waiter berate the busboy, and the busboy sinking hopelessly, we were all to exhausted to enjoy the meal. \nTo bad, different circumstances, I'm sure it would've been much better for this quaint and well appointed French restaurant. Only a 1 Star minus. Give it a try!",
                "datePublished": "2018-09-13"
            },
            {
                "reviewId": "9tCfYTHVaOHqV0KB6NgE0w",
                "author": "David H.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Nice French restaurant right outside Covent Garden.\nThe steak tartar I had was authentic and perfect.  But the pre fix menu was just ok.\nSteak was about 4 oz and was cooked well done.  Not much flavor this the need for brown sauce. Cream brûlée was freaky but the crust was thin and clearly pre made.\nRomantic place but brasserie quality you find in Paris.",
                "datePublished": "2017-05-30"
            },
            {
                "reviewId": "975zc-7GEqfYsTsMRcIEiQ",
                "author": "Aiko S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love the NYC location so I had to try this one while I was in London recently. It did not disappoint. I had the chicken Paillard followed by profiteroles for dessert. Everything was excellent and the service was great too. As soon as I sat down the waiter asked if I wanted a glass of wine and he gave it to me on the house! The restaurant itself is in a nice area and the inside looks just like the New York location. It also wasn't overly expensive which I appreciated since I was on a business trip. Remains one of my favorites!!",
                "datePublished": "2018-09-07"
            },
            {
                "reviewId": "nA7dY55LFuQUESDptJZ1NA",
                "author": "Yonnie C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "My husband and I came here in March 2017 for dinner one night during our time in London. We had reservations (which were relatively easy to secure) and arrived to our table. The restaurant is packed and busy on a weeknight. We ordered:\n1) Ribeye steak - my husband ordered this and was underwhelmed. maybe his expectations were too high but he said it was only OK\n2) duck confit - I really enjoyed this dish and felt the flavors were tasty and just right.\n3) onion soup - my husband ordered this too and again, he thought it was just \"eh\".\nOverall, the service was friendly although they were so busy that it didn't feel as welcoming. Even though this place has high marks, we left feeling like the experience was only mediocre.",
                "datePublished": "2017-05-17"
            },
            {
                "reviewId": "_F9gPyJ-Ger239RqaB7UTw",
                "author": "Bailey M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Nice decor, friendly service.\nThe tables are too close together. I felt I could have easily joined the conversations next to us.\nI had the chopped salad. It was very good. There were more toppings then actual lettuce which was weird but I enjoyed it. \nMy fiancé had the full breakfast. Great portion size and good food.",
                "datePublished": "2017-05-21"
            },
            {
                "reviewId": "9-6sPUIsokeTOkQgTnS4iQ",
                "author": "Jennifer R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The short: you can expect a solid meal and great service at Balthazar. \nThe longer: I came for a weekday breakfast business meeting, and was greeted by a kind hostess who coat checked my coat and umbrella. \nWe had a round booth table, the restaurant was beautifully decorated with tons of staff. Our waiter immediately got us water, coffee and iced tea. \nI ordered poached eggs with smoked salmon. The homemade English muffin was delicious, the salmon was fresh, and the eggs were perfectly cooked. I was able to get the hollandaise sauce on the side. \nOverall, great meal, excellent service in a prime location.",
                "datePublished": "2017-10-10"
            },
            {
                "reviewId": "JGMsWozuJkZVLmYubNlZBA",
                "author": "stephanie a.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "We visited this French Brasserie after seeing Mama Mia.  Very vibrant atmoshere and the food is stellar!  Cool vibe, amazing food, and open late. Perfect for after show or just late night bite to eat!",
                "datePublished": "2018-08-06"
            },
            {
                "reviewId": "Jm6NPbGoXkhofeZvQOhvQg",
                "author": "Jim P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "These guys saved me from the ineptitude of the corner bakery, just down the block, who couldn't seem to handle 2 customers at once.  Being familiar with the patisserie and restaurant in NYC, I knew I could find quality and service here.\nThey came through with my Americano, and small almond loaf, that was just enough to take the edge off my jet-lagged feed cycle, before lunch.  Two pleasant young ladies waited on me, and chatted with locals.  It wasn't crowded in the 5 stool interior, and it was just a nice and relaxing respite.",
                "datePublished": "2017-01-17"
            },
            {
                "reviewId": "QIzNL_oykAqq1gAOFfe12w",
                "author": "Deric C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I passed by a week ago and find out they do a good deal of prix menu and promised will treat myself for that. Glad that i booked the restaurant to secure our table for lunch. When i walked in...the interior look so grant with high ceiling with hanging fans.The prix fixe menu is simple and has a good selections and inexpensive. We has three courses only cost £22.50. Lovely Starter including soup of the the day, squid ink risotto..and i love the main course..roasted pollock..thick cod with peas. Desserts of the day look creative..it has peach with creamy white chocolate shell. The meal taste good and we really enjoy it.",
                "datePublished": "2017-08-06"
            },
            {
                "reviewId": "FPObqb1SbYa80XTncHNDdw",
                "author": "mick m.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Still good after a few years, but maybe showing its age a bit. We managed to walk in without a reservation, at around 8 pm on a Monday. We've eaten here before, as well as  dining at the original NYC location, and have always had a nice time and decent food. The scallops were a fine starter, and the onion soup was classic. Both Lamb and steak frites were tasty if perhaps unmemorable. Service is fine but can get a bit thin if the place fills up. We prefer to sit at the banquette tables overlooking all the action ( there wasn't much this visit ), though the padded seat is getting a bit lumpy. Many diners prefer the closer together tables in the middle of the classic bistro space. We have spotted the occasional celebrity here but most diners are having pre and post theatre dinners. \nGreat Covent Garden location.",
                "datePublished": "2018-06-29"
            },
            {
                "reviewId": "fg_hgXkQq00IFPQn9uEHPg",
                "author": "Keith D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "What a wonderful evening -- I owe virtually all of it to the wonderful barman who attended to me. The check says \"sam p\" was serving, so I'm going to say it was sam. \nFirst, he made an absolutely impeccable martini, and even paused to inquire about my preferred dryness. It was wonderful. I noted the wonderful lemon presence, and he cut a fresh lemon peel and squeezed it over the back of my hand to show me the freshness of lemon oils and the difference they make. Then, when I expressed an interest in the vermouth he used, he very enthusiastically shared their house blend (cocchio + standard dry). \nI mentioned I'd never heard of cocchio, and what followed was a tour de force of making a guest feel special -- he personally walked me through the different kinds of vermouth cocchio makes, their characteristics, their history, their relationship to other aperitifs like Lillet -- and then he gave me a taste of each. \nI mean, not only did I have a great time, enjoy a spectacular martini (and a perfect rare steak frites), but I actually learned something that I can bring home with me. \nI will consider my next trip to London incomplete without a visit to Balthazar for a drink with Sam. \nSam, you are a gentleman and a scholar. Thanks for a great evening!",
                "datePublished": "2018-02-27"
            },
            {
                "reviewId": "G7lWQE0fP6589uT-xVyUxA",
                "author": "Cathy C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Classic brunch food with a lovely atmosphere. Good portion sizes and if you get the bread basket they give you four different types of jams/spreads for the bread!",
                "datePublished": "2018-02-13"
            }
        ]
    },
    "20": {
        "id": "ZxdgX8JgLADrhw_bymyF9Q",
        "name": "Balthazar",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Covent Garden, Strand",
            "streetAddress": "4-6 Russell Street\nLondon WC2B 5HZ\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media3.fl.yelpcdn.com/bphoto/FK11d_CYj43oFBmbrVnHwA/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 3301 1155",
        "review": [
            {
                "reviewId": "Z32S5sSphM0WhlrCBMlpiw",
                "author": "Margaret N.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I've been the the NYC location and had high expectations already going in. And let's just say, I was not disappointed. \nFrom the friendly service to the food- thumbs up!  Ordered the traditional English breakfast and it was worth every bite. The bacon is not fatty like the one back in the states, the sausage was soft (not chewy), the beans weren't as sweet (which was nice), the fried bread was interesting (not my cup of tea, but nice to try), and my eggs were prepared to perfection.\nThey also had green juice, which I desperately needed after eating such a heavy meal.",
                "datePublished": "2017-12-04"
            },
            {
                "reviewId": "QIww1XRzoRlNwsffBBxwaQ",
                "author": "Jake T.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great breakfast. Loved the omelette and my friends loved everything else on the menu. Great Food and service. Definitely reccomend.",
                "datePublished": "2018-06-19"
            },
            {
                "reviewId": "nTLU-YRvux6JmgS-5R0Ppg",
                "author": "Raeya D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Yummy! Balthazar is a popular choice for me! I usually go in New York, and this was my first time at the London location! It is the same typically as the NY location, but I still love it! The food is great, the staff is friendly, and the wine is flowing! ;) I love it here and it's so yummy! Get the steak frites!!",
                "datePublished": "2017-02-21"
            },
            {
                "reviewId": "C5irYyiqr47CO58rPMtGCQ",
                "author": "David K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "This is my current favorite place for afternoon tea in London. Just don't plan to eat dinner on the same day. Our tea service included 10 tea sandwiches, 4 gorgeous and huge scones with Devonshire cream (of course) and some of the loveliest jam ever, and 5 beautifully crafted and extremely tasty pastries. Oh, there was tea, too. If you're anywhere near Covent Garden, don't miss it.",
                "datePublished": "2018-03-20"
            },
            {
                "reviewId": "ROLCOWp_0gO2VEROrn_jCg",
                "author": "Ron T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Wonderful restaurant, excellent food, wasn't overly heavy. They have an economical 2or 3 course fixed price option with limited choice.  Wine by the glass had a reasonable selection and moderate price",
                "datePublished": "2017-10-12"
            },
            {
                "reviewId": "04pSwBU2SsvbsvvShw5OeQ",
                "author": "Mark P.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Pretty Disappointed with this place.  The service was decent and the staff was nice so I have no complaints there.  The steak tartare was pretty good.  Sad to say it was all downhill from there... I had the baked cod and my girlfriend had the lobster spaghetti.  While the pasta was properly cooked the seafood in both entrees was brutally overcooked.... Not just a little over done, I mean absolutely terrible.  At over 80 pounds for a lunch I would expect much better.",
                "datePublished": "2018-03-13"
            },
            {
                "reviewId": "w6PgCB0UVvwoFU2jejszTw",
                "author": "Roxana Q.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Meh...\nMaybe I'm just a hard sell but my steak could have been more blue and the fries were semi soggy.  The latter was especially disappointing because they are supposed to be really good fries. They were even on \"the best thing I ever ate\" on Food Network as Bobby Flay's pick.\nThese were not the best thing I ever ate.\nLike the New York location, it's crowded (even on a weeknight) so you should definitely make a reservation unless you don't mind sitting at the bar.\nWould I go back in London? Probably not. There are better places to eat.",
                "datePublished": "2015-10-17"
            },
            {
                "reviewId": "YTRMcCkzEoxWk2NwjOeakA",
                "author": "Safina Z.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "As good as the ones in NYC. Great environment, yummy dishes and good service. What else can you expect from a restaurant? A strong recommend to whoever is looking for a good combo of everything.",
                "datePublished": "2018-02-21"
            },
            {
                "reviewId": "puUDbAXqs-VanXamopcTcA",
                "author": "Dee F.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I had the fortunate experience to enjoy this spot with cousins friends and sisters.  Two separate reservations but the kind hostess was able to put us side by side to accommodate the group of 8.      For starters we ordered Burrata (fresh and amazing)  Beetroot Apple and goat curd salad, not a fan of goat cheese (Fiona and Deb loved )  Pumpkin Agnolotti and scallops were devoured by the second hungry table....  MARY DALE MAUD AND Christine AKA CHISSY ..Our waiter Steve was so kind professional and very accommodating !    We had the pleasure of meeting the manager,  Dominik Powroznik, a gracious host!!",
                "datePublished": "2017-12-11"
            },
            {
                "reviewId": "ZNqHFub4wNXyw5kGeLDYog",
                "author": "Zacharias P.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A fabulous restaurant with classic decor, and tucked away in Covent Garden. I met a friend here for a late breakfast and catch up and we were not disappointed. We were promptly shown to our table, the waiters are very attentive, and the food came out quickly. My friend had avocado on toast with poached eggs, and I had the scrambled eggs with Cornish crab. Both options were delicious. Tea is served in a large pot, and our water was topped up continuously. They didn't mind that we stayed for a couple of hours talking. This is a good place for intimate dining, though the tables are too close together and you sometimes feel as though the people at the next table can hear everything you say. I would definitely return here.",
                "datePublished": "2017-05-31"
            },
            {
                "reviewId": "p6R28DIWQPGSFExXglWdnw",
                "author": "Nola G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The Balthazar Bakery is located next door to the fabulous restaurant Balthazar. There is a beautiful selection of artisan breads, sweet pastries such as cakes and tarts, sandwiches, and salads that you can either take away, eat there, or have delivered which is free within the WC2 area.  The majority of the bread and croissants are made in house. The shop is small. This is a traditional French bakery...quality not quantity.  Everyone and everything was as wonderful as the restaurant. If you order any fish dishes, ask them to debone the fish...unless you prefer the bones left in the fish.  We had the Daily Special...it was too much work and it ruined the dish and the experience for one of my friends.  \nbalthazarlondon.com",
                "datePublished": "2017-04-24"
            },
            {
                "reviewId": "4cJ1WxL_RU4_FiUi170YDA",
                "author": "Meryem C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "While planing to have breakfast in somewhere around Covent Garden we came across this place. In NY Balthazar was in our list, but we did not have time to visit. So without checking the menus outside we just entered in! \nFor breakfast, menu is quite extensive but nothing special in comparison to other French cafes/chains/restaurants/bistros. Ah, maybe more expensive! For single eggs royale in Balthazar, I can get eggs royale (w 2 muffins) and drink in my fav places with same price. \nI must note that the waiter was so attentive. I was not sure about to order Le panier -selection of mini pastries and bread basket - he brought the basket to show us what we would receive. Pastries were a bit hard but I liked homemade jams and marmalade. \nAnother note is tea pots are big that you can almost have 4 full cups. Nice! \nNice ambiance, tasty food, I will arrange my next visit soon for dinner.",
                "datePublished": "2016-09-04"
            },
            {
                "reviewId": "I8cUfF-PGXnBmlHUMwb-qg",
                "author": "Shantel T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I knew coming to London I had to try Balthazar's. I wasn't able to make it to the one in NYC, so why not? We made a reservation for 8pm and when we got there it was packed! We ended up waiting for about an extra 20 minutes for our table. The restaurant kept apologizing for the wait and were kind enough to offer a bottle of champagne while we waited for our table to clear out(bonus!).  I was just surprised and pleased in a way with the profuse apologies...Not used to it in America! Ha.\nI ordered the steak and fries (go figure) that they are known for and everyone else got the special of the day which was a pork belly dish. We also ordered the burrata.  Get the burrata if you love cheese!! Even if you're lactose intolerant, I'd still highly recommend it ;) Don't let me forget to tell you about the fries. Omg. Actually, I take that back. I can't tell you. You just have to try it for yourself. You will seriously feel like you're being whisked away into the clouds while sitting on a bed of fries. That was me.\nBesides the wait, I loved it all, and would come back. Great service, awesome decor, and delicious red wine with amazing people :)",
                "datePublished": "2015-06-03"
            },
            {
                "reviewId": "2o2LZhb02w2aTguy_xARFQ",
                "author": "Bill W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "French restaurant with great food and superb service. I had the Duck Sheppard's Pie and my wife had the filet. Food and service were top notch. Super attentive staff. Tables were close together but that didn't bother us at all.",
                "datePublished": "2017-07-21"
            },
            {
                "reviewId": "a-TYcTlmkpCmW5KI33sxfQ",
                "author": "Dana N.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Went here with a group of 8 people for dinner on a Tuesday night. Service was attentive and patient with our rowdy lot. We were given bread for the table with some nice tasting butter to accompany it. We started with the oysters which were superb along with ceviche and steak tartare, both delightful. I ordered the sea bass as my main, which I highly recommend! From the silence after we were served, I take it that everyone else enjoyed their meals as well! We ended the night with a few desserts including my fav of the pick which were these cream puff type things filled with ice cream instead of cream...amazing!",
                "datePublished": "2017-05-07"
            },
            {
                "reviewId": "JBy4JekPHAlDOUyvl1O2Dg",
                "author": "AM B.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "So many good eating choices, keep looking. The menu was not very exciting. The food was so full of pepper, it was inedible. The cheese plate looked like it was sitting around for a while. The bread was delicious. Servers were busy, the nicest person in the restaurant was the guy who took our credit card.",
                "datePublished": "2017-02-13"
            },
            {
                "reviewId": "ekewxrCYHzQ4WfkYrpBw3Q",
                "author": "Aaron R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "For breakfast, this place is hard to beat.  It is very similar to the NYC restaurant that it is spawned from; in fact I really felt like I was in New York.  The portions were very American sized, without sacrificing the quality.   I would happily come here every week for brunch.\nI tired the English Breakfast and was only able to get through about 2/3 or it so make sure you come hungry.",
                "datePublished": "2016-01-13"
            },
            {
                "reviewId": "AKVOv1psMxc-kQxiLqKCww",
                "author": "Sarah V.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I love a poached egg, and they don't come better than at Balthazar! \nThe staff are very friendly and attentive, and although we were initially told it would be a 40 minute wait (we arrived at 11am on a Sunday without a booking), we were seated within 15 minutes. The food took a little while to come but when it finally arrived it was DELICIOUS. I had poached egg & avocado with a side of bacon, the portions were very generous and filling!\nIt's a little pricier than your average brunch spot, but well worth it. The atmosphere is that a  40s Parisian diner, it definitely injected a hint of sophistication into my Sunday morning hangover.",
                "datePublished": "2016-02-02"
            },
            {
                "reviewId": "sl0MHWVxVkOhM4JzYrVBhA",
                "author": "Bethany W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I stumbled in here when looking for somewhere to grab a bite on my lunch break. Not realising where I actually was I ordered the French onion soup and a chicken BLT. \nIt took me a few minutes to realise that this wasn't your typical cafe. Bread lined the walls, the cakes on display looked ridiculously good - especially the donuts - and everyone (the staff) was speaking with a French accent! I still haven't sussed if they were real or fake accents yet...\nThe price for a soup and sandwich was costly (£11!!) but at this moment SO worth it for a warming lunch having been out in the cold for so long. The French onion soup was everything a French onion soup should be and you could tell it had been stewing for quite some time. It also came with some large cheese croutons for dipping - a nice added bonus. Highly recommended.\nThen to my sandwich. I was actually rather full from my sandwich so I saved half for Jody but I must say it was a pretty decent sandwich - the bread, as with those hanging on the walls, was fresh and tasty and the fillings distributed well - no sandwich gaps, woo (big pet hate of mine)!\nI finally realised, after stuffing my face, that this was the cafe section of infamous Balthazar (which I am yet to visit)... Definitely worth a visit for a nice alternative to the hustle and bustle of Covent Garden and a much cheaper option than the main restaurant itself.",
                "datePublished": "2015-11-18"
            },
            {
                "reviewId": "uGZPJS6i3cG8q0FT6Nbm4w",
                "author": "Mohammed O.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Awful service. Poor customer experience and utter lack of customer care. Arrived at 11:15 after calling ahead to be told that the kitchen would actually not take orders after 11:15. Awful.",
                "datePublished": "2018-03-28"
            }
        ]
    },
    "40": {
        "id": "ZxdgX8JgLADrhw_bymyF9Q",
        "name": "Balthazar",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Covent Garden, Strand",
            "streetAddress": "4-6 Russell Street\nLondon WC2B 5HZ\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media3.fl.yelpcdn.com/bphoto/FK11d_CYj43oFBmbrVnHwA/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 3301 1155",
        "review": [
            {
                "reviewId": "d0GicB_8zda7WlaeLoNI2A",
                "author": "Maciek D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "My search for a late breakfast led me today Balthazar Boulangerie just moments from Covent Garden. Pleasant vibe of the area is continued inside with the relaxed yet elegant interior. As a bread lover I had to try their bread selection which was presented in a generous basket (Le Panier in the menu). Alongside the baguette, white and dark bread and a variety of croissants came a choice of small jam jars and some delicious butter. The overall quality was very good and coupled with the pleasant vibe there is really no reason to give less than 5 stars.",
                "datePublished": "2016-09-03"
            },
            {
                "reviewId": "QYOxN-OCvv_3h8YgML9mTg",
                "author": "Nicole K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Love the vibes of this spot right off of Covent Garden! It's a must hit while in London. They have a yummy breakfast selection and great coffee. Both the English Breakfast and Eggs Royal are delicious. Don't forget to try a pastry!",
                "datePublished": "2017-03-21"
            },
            {
                "reviewId": "ahS6Qc1sL--hzKQl9RjEjw",
                "author": "Rosana L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Came here a few times, though the last time was certainly memorable. As my friend was visiting from abroad and wanted to book a fancy afternoon tea. After trying to balance showing her a good time and me not falling for my usual go-to's including Sanderson and Sketch, I decided to opt for their specialty Bobbi Brown themed experience, since my friend is a huge makeup fan. \nUsually I try to avoid too touristy cliche French Restaurants that attract people for 'impeccably luxury feel' service and overly prices carbs slapped with sauce on a plate. However Balthazar lives to it's reputation with good service and impeccably classic setting and dishes. The themed afternoon tea brings a little more 'edge' and quirkiness to their concept of elaborate dining. \nThe restaurant very much reminds me of Cheri in Barcelona. With cloudy yellow lighting to create intimacy, mirrored walls and monochrome marble floors give it that 'socialite' feeling of you being in an occasion spot in Paris in the 1920s. The formally dressed staff just add to the classic feeling of being served in something a bit more exciting than you typical urban bistro full of design enthusiasts with their macs. \nThe afternoon tea menu's included savory sandwiches with classic ones such as the cucumber, which is my guilty pleasure. The scones were nearly perfect with a lovely light and airy texture, sweet clotted vanilla team and classic blackberry jam. The highlight of the themed experience were the sweet pastries that were shaped in lips, eyeshadow palette and a mascara. My personal favourite was the yogurt mousse in the shape of lips. The rhubarbs shaped into an eyeshadow in a chocolate cream tart was also a close hit. \nOverall I think this afternoon tea is wonderful quality, considering the price with the perfect atmosphere of fancy dining and being a hot-spot in Soho. It's amazing if you're looking for something in central that offers the traditional afternoon with a themed twist, though nothing overly strange nor experimental. The unlimited offer of tea, cakes and sandwiches available also to take home was a big plus. The professional staff service and atmosphere makes this place a go-to for any fan of French cuisine.",
                "datePublished": "2016-10-21"
            },
            {
                "reviewId": "ks1XrLgp4PEQE3EKhaXarQ",
                "author": "Gab G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Despite living in NYC, I've never actually visited Balthazar in soho, though I do delight in their sticky buns as often as possible. Anyway, we happened upon this location in Covent Garden and decided to dine here. Of course I had the steak frites, and it was sooo good. The meat was a little on the rare side but I like it that way, and the French fries were perfect. I also ordered the salad with butter lettuce and hazelnut - delicious. Great ambience and the staff wears old-fashioned uniforms. Plus, I think the menu was priced less expensively than the NYC one, even with the conversion!",
                "datePublished": "2015-11-28"
            },
            {
                "reviewId": "B8DAkZkN0_IHpPODzqlvEw",
                "author": "Vi W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "grilled langoustines (yabbies) with green tomato salsa, chives and aromatic oil served with Jacob's Creek Reserve Adelaide Hills Chardonnay 2013 - a very light white wine that makes it a great companion to shellfish and white meat seafood - I think I just came up with the term, white meat seafood. I am thinking sea bream, bass, monkfish and halibut. Probably mackarel and tuna would be too strong and cloud the taste of the wine. The wine has also a very strong oak aroma and smoky bouquet that is not present in it's taste. I was glad otherwise it could all be a little too much. \nhot smoked duck with cherries, beetroot and braised lettuce accompanied with an Adelaide Hills Pinot Noir and cherry sauce served with Jacob's Creek Reserve Adelaide Hills Pinot Noir 2013 - with some serious buttered vegetables together with the layer of fat in the duck was, to some, delightful. I only managed one and had to take the other two off because it was just too much. The meat was a little tough and chewy but the intensity of the deep dark cherry sauce was very nice. The wine was easy to drink, very mild tannin that brought out the gameness in the duck.\nkangaroo with pepper, cabbage, pancetta and carrot with Barossa Shiraz sauce served with Jacob's Creek Reserve Barossa Shiraz 2013 - It was the best kangaroo meat I've had but I can only compare to Iceland supermarket's frozen kangaroo meat (there, I said it!) and I thought that it was a slightly unfair comparison so I referred to a true Aussie foodie that was there that night. She confirmed that it was very good indeed; so lean and cooked to perfection. It was good with the suggested Barossa but I thought that it was equally good with the Pinot Noir too.\ndark chocolate sphere with mint, eucalyptus and a hot chocolate sauce served with Jacob's Creek Reserve Coonawarra Cabernet Sauvignon 2011 - after seeing so many media videos of chocolate desserts melting when sauce is poured, this was my reality moment. But chocolate sphere did not entirely melt and the waiter was not going to wait for my silly phone camera to come on. Shame...\ntea, coffee and petit fours - macaroons, lemon meringue and chocolate were delicious. The cold coffee was not great but these petit fours, especially the lemon meringue, were delicious! I had the last sip of my Chardonnay Pinot Noir Brut NV with this sweet tangy dessert and to mark the end of a wonderful evening.",
                "datePublished": "2015-08-05"
            },
            {
                "reviewId": "77UHCRuAN-rGav_J2ILgaA",
                "author": "Brittany S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Quick Review:  A French brasserie with an old school steakhouse type of feeling.  Standard dark wood traditional restaurant with great tasting food. Great service, set menu for large groups\nFOOD\nEscargots (w/ garlic butter): it came with about 6-8 pieces but its a very rich dish so I would say a good enough portion for 1, maybe 2 if you just want to taste.  Shell is included, a little weird if you are not accustomed to eating escargot but very good.\nSteak Frites:  the meat was cooked perfectly and the frites were just as tasty, it was VERY well peppered which I didn't mind at all.  \nVanilla Creme Brulee:  yummy custard goodness.  Cracked the torched sugar is always my favorite part of eating creme brulee.\nSERVICE\nExcellent!  We had a group of 8 very hungry women.  Though we had a set menu (standard for parties over 6), we were still indecisive but our server was a good sport.  He was french and gave his honest opinion about the menu which I can appreciate.  We each got our own dessert but they also brought macarons for the table to share, such a nice gesture.\nAMBIANCE\nQuaint Parisian restaurant.  Clean, with a good amount of space.",
                "datePublished": "2016-06-30"
            },
            {
                "reviewId": "B8in_dbP2C5O-CTaRvXanw",
                "author": "Alexandra T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Had dinner here on our first night in London. We split pate w/crostini and french onion soup to start. Both were delicious! For main courses, we ordered the beef stroganoff (not traditional with noodles, but served with white rice) as well as the gnocchi with artichokes. We also split a bottle of granache wine. Was't crazy about the beef stroganoff but all other dishes and wine were great! Service was also very attentive and friendly.",
                "datePublished": "2016-10-09"
            },
            {
                "reviewId": "1eps-JRSCMqheYMvvL_1wA",
                "author": "Jonathan D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Balthazar is always solid.  The Chicken paillard was super thin and very flavorful.  The baked scallop appetizer was also great and they have an excellent wine list.",
                "datePublished": "2017-11-12"
            },
            {
                "reviewId": "otlABUM-gGaBMS9hXzoQnA",
                "author": "Mark B.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Main reason for the mediocre review is I felt really rushed though my meal. I can appreciate wanting to ensure I made my show time (reservation at 6pm, show at 7:30), but still I had an appetizer and my main in front of me by 6:20pm... and that was after leisurely looking through the menu! Also, the restaurant itself gave a very cramped feeling. So much so the couple next to me and I commented on it.\nThe appetizer (octopus, tomato, basil) wasn't exactly flavorful. The main (stone bass) was more up to par with a delicious artichoke purée. \n \nThe bottle wine list was very extensive with plenty of French wine to choose from. The wines by the glass had reasonable selection.\nAll-in-all, I'd say a touch above average for this caliber of a restaurant. If someone brought me back here it'd be ok, but I would seek out another place for myself.",
                "datePublished": "2015-11-06"
            },
            {
                "reviewId": "4XB8HXvvl4yZcU1rOPm80A",
                "author": "Ben B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Amazing....Beef stroganoff.  It's been a long time since I can remember a meal that got better bite after bite. It was so good I didn't want it to end.  The place appears to have a perpetually long wait (unless you have reservations of course) but I got right in by sitting at the bar.  Wait staff was incredibly responsive (unlike many English restaurants where you have to flag them down).   Very highly recommend.",
                "datePublished": "2017-04-22"
            },
            {
                "reviewId": "wipZhL5uAB1LgvfCWObABg",
                "author": "Judy C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Living away from the US has really made me miss brunch, so one of my agendas in London was to eat brunch (it is no joking matter). As I missed out on going to the SoHo restaurant while I was living in NYC, I redeemed myself (a little bit) by checking out Balthazar in Covent Garden.\nTo me, the interior is expectedly like an \"Americanized\" French brasserie, and the open dining space with many chatting diners/busy servers made the atmosphere very warm. We were lucky to get a table immediately on a Saturday early afternoon, followed by quick service.\nWe started with the chicken liver & foie gras mousse as starter. My friends described that it was smooth like cheese spread. We then proceeded with scrambled egg & cornish crab with a side of mushroom fricassée, sweetcorn fritters, avocado on toast with poached eggs, and hazelnut waffles. All the entrees were delicious, and we devoured our dishes in no time.\nI am glad that I got my brunch fix.",
                "datePublished": "2014-04-08"
            },
            {
                "reviewId": "3DLhykPEo8_HSizgDZzp2A",
                "author": "P C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great ambience and food. Reservations highly recommended. Wine list was considered a bit pricey by somebody in our party, but had good selection. (Or so I was told).\nWent for a work function, but seemed like a great date spot, girls night out, or celebrating a special event.",
                "datePublished": "2016-09-18"
            },
            {
                "reviewId": "NG7bRDL1li-Sr0XcezDK6Q",
                "author": "Kate G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I had breakfast here with a friend while we were in London. Great location, easy to find. Lovely restaurant, very upscale. The food was really good. We shared the pastry basket which had more pastries than we could eat. I had the caramelized grapefruit which I'd never tried before. The caramelization took any bite the red grapefruit ya have had, it was very good. The only problem I had in eating it was they didn't provide a grapefruit spoon to dig out the fruit with so it was something of a trial to eat. My friend had the full English breakfast which looked wonderful and she said was terrific. The hostess and wait staff were superb and we lacked for nothing, and didn't have to wait for them to assist unlike most places in Europe. This is not an inexpensive place for breakfast but the prices were reasonable considering what you receive and that London prices are very high anyway. Overall I highly recommend Balthazar's for breakfast or brunch. Next time I'm in London I plan to give it a try for dinner!",
                "datePublished": "2017-11-04"
            },
            {
                "reviewId": "bOFee1WOJECIrANtvzeu4w",
                "author": "Lisa C.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Another solid London brunch destination. It's a French brasserie, reminding me a lot of Colbert on Sloane Square and some of my favorite brunch places in the US (Parc in Philadelphia and Left Bank in San Jose, CA). The location could not be better (it is right off the Covent Garden Piazza), and the venue is grand and beautiful, with enormously high ceilings and loud jazz music playing throughout. We had a reservation for 2 people, which we managed to get by emailing the restaurant, despite no availability showing up on the online booking system. This is the second time that I've been able to get a reservation this way, so I would highly recommend it if your desired times are not showing up at first glance.\nThe food and service were also stellar. It was actually just like being back in America. I ordered scrambled eggs & Cornish crab, which came served on a piece of toasted sourdough bread and with a side of creme fraiche. The eggs were wonderfully creamy and the crab was plentiful and just perfect. I could not have been more pleased with it. One piece of toast doesn't seem like an awful lot, but I was so full by the end. My friend got the avocado on toast, but managed to switch out the poached eggs for mushrooms and tomato, since she doesn't really eat eggs. She also asked for some goat cheese, which the staff happily obliged, even though it isn't a standard menu item.\nI was very impressed by the whole experience. No complaints about Balthazar and would definitely come again... the rest of their menu looks equally amazing.",
                "datePublished": "2015-04-19"
            },
            {
                "reviewId": "StI0f_bQttG7gmmQEmEO0A",
                "author": "Lily H.",
                "reviewRating": {
                    "ratingValue": 1
                },
                "sentiment": "negative",
                "description": "Although greeted and served by very friendly staff, we found the food ever so disappointing, despite hearing great things about Balthazar London. \nCrammed in between very noisy small, darkly lit tables, our food came out suspiciously fast - within two minutes of ordering. \nThe spinach in my eggs florentine was wet, bland and a rather small portion, definitely not worth £13.50, for a bit of bread, veg and hardly any sauce. Sadly nothing special, overpriced and overrated. I could definitely think of better places for brunch in London.",
                "datePublished": "2016-04-17"
            },
            {
                "reviewId": "Y5ZT_1xtjlrGV0SJ7E4NWQ",
                "author": "Alex P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "It is a pleasure to review a restaurant like Balthazar.  In a nutshell, the food is excellent and the service is impeccable.\nHere are the details:\n- Bread - I simply have to start with Balthazar's homemade bread. Every single kind of their bread is spectacular, but I'd like to single out the sun dried tomato olive buns.  5 stars all the way. (Btw, their butter is great too).\n- French Onion Soup - very good. Savory, beefy and with a healthy amount of gryere, very intense.  One minus - too much bread in the actual soup, which sucks up a lot of the liquid, making the soup a little dryer than I'd like to.  That said, still a solid 4.5 star dish.\n- Escargots - very good, garlicky, buttery and just yummy.  5 stars.\n- Garlic Shrimp - the shrimp is good, but the sauce it comes in is out of this world.  It has a slight kick due to the addition of chili peppers.  5 stars.\n- Mac & Cheese.  Very creamy and not as intense as I expected it to be.  Made with gryere. It deserves 4.5 stars, and the reason I'm not giving it full 5 stars is because it was the least memorable dish I had.\n- Burgers - Very good burger, cooked to a perfect medium rare but not the best burger (not even in the vicinity) I ever had.  The meat was excellent quality but underseasoned.  Two other major issues: 1. Bun - too big and 2. the patty is on the smaller side.  For that size of the bun, the beef patty has to be at least twice that size. 4 stars.\n- Beef Tartare - Excellent! Prepared \"au couteau\" (hand cut), well seasoned with the slightly higher note of acidity.  Add some hot sauce a freshly ground black pepper for a heavenly concoction. 5 stars.\n- Moules Mariniere (mussels) - great.  Fresh and fenomenal. 5 stars.\n- Rubharb Souffle - WOW! With a side of creme anglaise this was the home run of the evening. 5stars and it doesn't do it justice.\n- Small dessert pastries - every single one was better than the other.  The macrons, the cream filled dark chocolate  and the chocolate filled cookie cups. 5 stars!\nI hope you'll enjoy Balthazar as much as I did.",
                "datePublished": "2016-03-27"
            },
            {
                "reviewId": "4gdUDPZTz-9qBwzs2B7IbA",
                "author": "Celia R.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Best. Eggs. Florentine. Ive. Ever. Had. \nGorgeous french looking brasserie. Although an american chain, so included a special 4th july menu and of course pancakes, this is actually supposed to be a french brasserie. With great choice of french dishes. \nHad the eggs florentine - and honestly best ones ive even had! And ive tried quite a few places! Everything was perfect - the spinach, the muffin , the poached runny eggs and that hollandaise sauce!!\nDefinitly want to go back and try more things, if everything is as good as those eggs!!! Miam miam!!",
                "datePublished": "2015-07-18"
            },
            {
                "reviewId": "aQX-pp6LDdu5HIJV0JazDw",
                "author": "Kristen C.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "You know, I expected it to be better, much better.\nI've been to the one in NYC and it is an institution so was looking forward to trying the London version of this cosmopolitan French styled bistro. It looks very much like the one in downtown New York, but much bigger and along with that it loses some of its intimacy. What was imported across the pond was a good helping of New York type attitude. The service was a bit cold and always seemed to be bored with whatever was said or asked for. Our waitress could barely be bothered to help with the wine when I asked if they had a Bordeaux by the glass she seemed confused. There also seemed to be the bare minimum of interest shown while just getting the job done properly. \nThe food was good but not amazing. You would think that a pretty straight forward Steak Frites with Bearnaise would be delicious in a place like this.  It was fine, but lack luster. Starting with the meat which was not cooked the way asked more medium than medium rare, and also not the best cut of meat. The Bearnaise was a bit thin and vinegar-y, overall just a bit off and not what you would expect. Dessert of Tarte Tartin was delicious though.\nNice enough, and for Covent Garden Piazza a bit of an oasis if you want something a bit more upmarket. The bar makes a great place for pre opera drinks.",
                "datePublished": "2015-04-14"
            },
            {
                "reviewId": "zwIWU_tS2zJKUafiSpEDUw",
                "author": "Robbie B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Comes close to their NY restaurant, offers a good vibe to eat in, fairly loud but not too loud you have to shout. People eat there late so the room is well filled. Food was good, had the raw seafood tower and the steak. Only slight negative was the service which was good and friendly but seemed they could have had a couple less tables to cover to provide a quciker response. All in all, this restaurant is good place for a date or drinner with friends/family.",
                "datePublished": "2015-11-18"
            },
            {
                "reviewId": "b4na00tvaJMg1dL-8HoYOg",
                "author": "Natalie H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I came here for a solo lunch on a Tuesday afternoon, with no reservations, and I was seated promptly. \nI had half a dozen oysters to start, which came with a choice of two salsas/vinaigrette to spoon on the oysters, but I asked for Tabasco anyway. Oysters were fresh - no complaints. I do wish the bread they served prior was freshly baked...\nI asked for a recommendation for my main, and oh boy! My waiter recommended the plate du jour, which was vaguely described to me as pork belly. I do love a good pork belly so I went along with it. Goodness gracious me! The pork belly arrived, on a bed of poached greens, with the skin crispy and slightly sweet, and there was additional pork crackling on top, and blood pudding on the side. They didn't forget a sauce, and to go with all that goodness, puréed apple was hiding somewhere to complement the pork perfectly. Despite the sheer amount of pork elements on the plate, it wasn't overly porky and there was a lot of difference within these elements to wow me. Party in my mouth, it was. \nLoads of places can do a decent pork belly. But not many places can combine it with other pork elements, and do the classic pork and apple combination to a T. I didn't get dessert because I was stuffed, but I thoroughly enjoyed my lunch here.",
                "datePublished": "2014-09-07"
            }
        ]
    },
    "60": {
        "id": "ZxdgX8JgLADrhw_bymyF9Q",
        "name": "Balthazar",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Covent Garden, Strand",
            "streetAddress": "4-6 Russell Street\nLondon WC2B 5HZ\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media3.fl.yelpcdn.com/bphoto/FK11d_CYj43oFBmbrVnHwA/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 3301 1155",
        "review": [
            {
                "reviewId": "sqvM7yZ2eqTWoSqes4DnLA",
                "author": "Naila M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "A beautiful large, French bistro in Covent Garden with tablecloths and waiters in uniform. Service is attentive but the waiters are particular about their respective areas so you can't call on a different waiter even if yours is busy.\nWe went here for lunch: grilled salmon on warm spinach, walnut and lentil salad; club sandwich with frites; basket of warm fresh bread. All delicious and fairly large portions. Very quick to bring to the table. Maybe we didn't order the right things but they weren't particularly special. The chips were very bright yellow which made me the think the oil may not have been the best. I enjoyed the club sandwich despite it falling apart in my hands because of the soft French sourdough loaf bread used. Two lunch mains for £38 is a bit steep but good if you're in the area and looking for somewhere fairly refined to eat.",
                "datePublished": "2014-08-19"
            },
            {
                "reviewId": "C3pHE0KoNv0zN_6wOecPbw",
                "author": "Linda J.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "It was date night and my husband and I have been wanting to try Balthazar in Covent Garden.  Balthazar was a classic in NYC and I was very excited to try it here in London.\nFood: We started off with the onion soup which was ok and the escargots which were top notch.  For our mains we ordered the lamb rump and the moules frites.  Both were good.  I also had a side of onion rings (why not!) and they were delicious!\nDrinks: We ordered one glass of champagne and one glass of white wine.\nPrice: 100.69 GBP for two people.\nAmbiance: The restaurant feels just like NYC.  Bustling with energy.\nService: You felt a good vibe as soon as you walk into the door.  Everyone from the hostess, the bartender, and to our server was friendly and attentive.  One of the guys dropped a few plates at our table and about five different people came to apologise.  They brought us two glasses of champagne which I thought was a nice gesture for the broken plates.\nWould I go back?  Definitely, especially for the escargots.  They have so many great things on the menu that I already know what I want to order next time.",
                "datePublished": "2014-12-27"
            },
            {
                "reviewId": "DxazgPIgrNDlFOqHGFeASg",
                "author": "Tazmin B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "really good brunch menu. everything tastes fresh. friendly service. i would definatily go back.",
                "datePublished": "2017-04-23"
            },
            {
                "reviewId": "fyN2rPs0i_rGpqJcT3MgkA",
                "author": "Menaal M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Brilliant brasserie! Had some epic brunches here. The wine list is broad and the service is great. Definitely recommended.",
                "datePublished": "2017-02-22"
            },
            {
                "reviewId": "Vwa_y5ZgZXz7NiDerj8ACA",
                "author": "Tim D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Although the food is terrific and delicious, the\nservice is spectacular. Waiters and bus boys are\nSuperb. It is a treat to meet delightful people\nfrom a variety of countries. All were fluent in\nEnglish but we enjoy using our limited language\nSkills in French and Spanish. Tonight will be our\nthird meal this week! My wife Caro' will return\nnext week for an encore!",
                "datePublished": "2016-06-07"
            },
            {
                "reviewId": "kOntc6zKqjxqXJ6rrOPfVw",
                "author": "Gurpreet S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is a popular spot at all times of day. Great spot to catch up with friends. Atmosphere is lively, classy but not overly pretentious. \nVisited in the lead up to Xmas so the festive decor was up but even without it it has a dramatic grand appeal. \nInitially tried to get a table for lunch without a reservation but nothing was free. Turned up again, hopeful, two hours later and got a table for four easily. \nFront of house was great and waiters were perky and professional. Toilets were very clean but a bit tricky to reach, staff were on hand with helpful directions. \nFood ranged from usual French options of onion soup to extravagant veal. I opted for a macaroni and cheese dish which was just right. My friends ordered steak and cheeseburger meals all very tasty. Terrific place.",
                "datePublished": "2014-12-12"
            },
            {
                "reviewId": "4rbk6nD8Kxmp2UDSsD_dUw",
                "author": "Nathalie H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I really liked the atmosphere and interior design in this restaurant. My friends and I went for brunch, so I ordered pancakes and some poached eggs as a side. Both were delicious. The service was good, not great, but we had a nice time regardless. I look forward to returning for lunch or dinner sometime.",
                "datePublished": "2016-10-21"
            },
            {
                "reviewId": "nwkLpY9jabOKWbsiJbRFHQ",
                "author": "Fabio Y.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "It is just like in New York. They have this French decoration with a really nice food and beautiful decoration..",
                "datePublished": "2014-05-03"
            },
            {
                "reviewId": "srU-85hhV7DxEvG65xMFQQ",
                "author": "Briana S.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I came here for brunch to meet a local friend. After a 9 mile (15km) run, I was HUNGRY.\nMy friend beat me here, and had a reservation. When I arrived, the place was bustling, and I was quickly shown to the table. \nService was friendly and helpful, but not overly so.\nI had the duck shepherds pie. The shredded duck was perfectly tender, and full of flavor. If I hadn't just done such a long workout, I probably could not have finished, but I was pretty famished, and I ate every bite.\nMy friend got the avocado toast, which looked amazing. \nGreat ambiance... high ceilings, large windows which bring in a lot of natural light, and well decorated.\nThe bathroom is up a steep flight of stairs, but has room for several people.\nIt seems pretty busy, so I would suggest a reservation.",
                "datePublished": "2014-09-28"
            },
            {
                "reviewId": "KJCwQOY6jipl3T_0qlPtbw",
                "author": "Linda T.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Balthazar is so difficult to book for dinner and brave it by trying to get a table for walk-in. We ended up waiting ovee two hours for a table! So i do recommend to get a table booking. Was it worth it? Well I wouldnt do it again but since it is one of those place I have been wanting to try ever since it open then of course it was worth it for the first time!\nAs a French brasserie you will find steak, French onion soup and one of my favourite Escargots. There are not many places in London that I have tried that does it well. Balthazer escargots was nice and better than other place. But it just does not compare with ones I had at Galvin bistrot de luxe which comes in a wonderful garlic butter sauce that you want to scoop off with bread.\nBalthazar serves two different pie including a duck pie which is very rich in flavour. The one I recommend and the dish that I give a big thumb up has to be the Fish Pie. This was true comfort food and an indulgent to have for dinner. It has to be my best fish pie I have had in London.\nYou can not leave with out ordering the soufflés. It is £10 each but they are big enough to share between two people. The waiter who was serving was friendly and a laugh. Even before our soufflés arrive he explain how to eat it - make an indentation at the top and pour the creme in to it. Then you ready to enjoy a light raspberry soufflé. I have to say that this was the only reason I have been wanting to visit Balthazar!\nFish Pie and Soufflés is what I would want to visit Balthazar! Delicious!",
                "datePublished": "2015-06-11"
            },
            {
                "reviewId": "PgtyxZwSI7ZSZ5RHYrRdWw",
                "author": "Ada C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Solid food and friendly service. \nI had the steak frites which came slightly overdone from medium-rare but it's a minor detail. It was tasty and the fries were very good. \nMy friend ordered the sea bass en papillote which was perfectly cooked. \nWine was delicious and reasonable. We got glasses of the Corbières for £6.50 each. \nIt's a lovely setting to have a meal. They took a lot of time with the decor from the low lightening and distressed mirrors in the dining room to the awesome tiling in the bathroom. It makes got a decadent experience!",
                "datePublished": "2014-04-22"
            },
            {
                "reviewId": "7ipXzh5vOnwuvW18Prxcvw",
                "author": "Alexi S.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Good service, nice milieu, and above all great food. I had chicken parfait for starters and ox cheek for main course. Both were nearly perfect.",
                "datePublished": "2016-04-13"
            },
            {
                "reviewId": "muOChZsog3E0aYJ4nAaukw",
                "author": "Erica U.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I loved you in NYC and I love you in London....\nI started off with the Escargot and loved it, but then again, its just a vessel for garlic and parsley. Nom.  And my husband had the Onion soup which must've been amazing because he ate it before I could get a taste in. He said it was the best he thinks he's ever had. Trust... he's had many. \nFollowed by the FILLET DE BOEUF AU POIVRE with pommes frites and spinach, it was downright great! So peppery, perfectly cooked. Just splendid. My husband had the grilled salmon which he wasn't too happy about. He was expecting grilled marked but it looked more like steamed than anything else and also was lacking in salt n pepper. \nFor dessert I had the most incredible party in my mouth thanks to the Apple Tart Tatin.... OH MY GAWD! I will have to go back just for that. its so good. \nSo good!",
                "datePublished": "2014-03-05"
            },
            {
                "reviewId": "YsOeW9QZ4VfdhdzHNbmssg",
                "author": "David M.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Food mediocre.  In our case Wiener Schnitzel just horrible.  Wine by the carafe reasonable. Service only OK.",
                "datePublished": "2017-05-02"
            },
            {
                "reviewId": "T7UeOEhUGB9oQTqAFuF5iw",
                "author": "Najma K.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "After searching for a place to have brunch in both Angel and Convent Garden with no luck whatsoever, my friends and I decided to try balthazar as it was 1:20pm and hungry. Although we waited for 15 mins (to be fair we were told it would be a 20 mins wait) we got seated and ordered. I opted for the eggs royale but was told by the chef via a waiter that it contained alcohol which i'm allergic to. I was told the chef would try to create a sauce but it didn't go well - again, i was told. I honestly tried the dish and it tasted dry as it needed hollandaise sauce to give it that special oomph. My friends could see my distress and garnered the attention of a staff and I was given the menu to make a whole new order. I opted for the \"avocado and eggs\" dish as recommended by the chef. The tomato salsa was to die for and hopefully I'll get to recreate the dish as everything worked undeniably well.\nPS: To the staff at balthazar, sorry if I came off rude but I was extremely famished.",
                "datePublished": "2016-01-01"
            },
            {
                "reviewId": "EIvziJRTIQVAD9i53bczBw",
                "author": "Lindsey A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I have finally tried Balthazar after lusting after them for some time now. I came late night with no reservations and they where able to squeeze a party of 2 in with only a 20 min wait. The Porn Star cocktail was beautiful. I was not starving so I didn't go for a heavy plate. I ordered the Moules Frites. I feel like I can't give it 5 stars as mussels are pretty easy to make and a place that can't cook Mussels and French fries probably shouldn't be in the food business. It is pretty hard to ruin that dish. \nI did try a bite of my friends Beef Fillet Stroganoff and it was devine! I have never had Stroganoff before as the name alone never appealed to me but wow! what have I been missing out on?!? I also tried her Chocolate Fondant, I don't even like chocolate but wow! Just wish they served more vanilla ice cream with this dish as I have never seen so little ice cream on a plate. Overall this place is a solid 4 stars in my book!",
                "datePublished": "2015-05-17"
            },
            {
                "reviewId": "RzO7SoJK7yogWu5a5Tcn6Q",
                "author": "Cailin M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This is for the grab and go side which had a beautiful pastry display (wanted it all). Had a Chelsea roll which was delicious. Really friendly staff as well.\nParticularly love the NY'ers asking if this was the original location. Speaking to the great branding on balthazars part.  the staff very politely informed them NY was the original.",
                "datePublished": "2014-03-23"
            },
            {
                "reviewId": "U8ZirN3-tv0YKUiZdLhqUA",
                "author": "Craig F.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "This was one of my top choices when my partner and I visited London. Overall, I was not disappointed. The restaurant, decked out for the holidays, was bright, cheerful and bustling with an energetic crowd (bar was packed). \nWe arrived 20 minutes early and the hostess, without asking, graciously arranged for us to be seated 10 minutes sooner.\nStarted with the French onion soup, which I had read, was highly recommended. The gruyere  cheese was bubbling and browned and when my spoon broke through its lovely surface, a flavorful (but not at all salty) broth with plentiful onions and bread awaited. I would have been satisfied eating just this, but I had to try the steak friites, which also did not disappoint. Fries did not overwhelm me, I must confess. They were a little undercooked and not seasoned enough, but the steak itself was fantastic.\nOf note was also the side of green beans with shallots. I devoured them with the steak. They were the perfect accompaniment to the steak.\nWe did not save room for dessert but the plates looked great we saw going to other tables.\nLondon has definitely become more of a destination for dining in recent years and this restaurant is one that helped to turn the tide. I look forward to checking out the New York location and will definitely return to this one next time I am in London.",
                "datePublished": "2015-01-03"
            },
            {
                "reviewId": "6Ccz-gYI7jIbToo4vb848g",
                "author": "Goetz B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Despite being in the hustle and bustle of Covent Garden, Balthazar provides a relaxed and friendly environment for a delicious meal - and they even serve decent coffee.\nIt took me quite a bit until I made it to Balthazar in Covent Garden, but one afternoon I finally managed to go there. A few months ago, I read a rather interesting article about the New York company and ever since wanted to gain some first-hand experience. Usually, Balthazar was always very busy when I considered visiting, but on this late Sunday afternoon, it was easy to secure a table.\nSupposedly, the London branch is almost a 1:1 copy of the New York venture. I cannot  verify this, but I can tell you that the main dining room is huge and grand, with heigh ceiling and some vintage coolness. The rose-inspired lamps hanging everywhere are cute, while also pretty kitschy. And in case you want to know, the toilets are beautiful, too.\nI started my late lunch with a lemonade. And what a lemonade! It was kind of a bespoke service, freshly pressed and delivered with a supply of cold water, like a do-it-yourself drink where I could decide how much water or sugar I wanted to add. The waiter was overly friendly and I instantly liked the place after this great start. He and his colleagues continued to impress by topping up my water seamlessly throughout my stay.\nI went for the cheese burger with fries and crispy bacon. It was a mighty and pretty messy beast. After I had removed the tomato, the gherkin and the onion, the burger became much more compact and shrank down to a size I could handle. Still messy, but manageably messy.\nInitially, I wondered why I was offered no condiments. As I ate my way through the massive burger, I noticed that all kinds of delicious juices  and sauces were oozing out and my plate quickly became the right place to dip my fries, no need for additional condiments. \nThe fries also deserve a separate mention. The thin-cut potato strips were golden, crispy, superbly spiced and overall delicious.\nTo complete my meal, I ordered the profiteroles. This dessert was surprisingly big, packed with lots of ice cream and a dark, strong chocolate sauce.\nAfter all this food, I felt really full and decided to do something about this and concluded my visit with a coffee. I was happy when I learnt that they use Monmouth coffee - a staple choice in the London coffee landscape, and they are almost neighbours in Covent Garden. \nI must say, that I was very satisfied with the food and service at Balthazar in London. Really a place I can recommend, even though the location makes it come across as a tourist trap.",
                "datePublished": "2014-12-11"
            },
            {
                "reviewId": "AWqEqkALCgAtEqPrppVsJg",
                "author": "Matija A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Great restaurant with many mouthwatering options on the menu. Could be tough to get a table at dinner time, so make sure you make a reservation. I was dining alone and a seat at the bar was perfect. Its not a place where you need to dress up...but don't show up in a t-shirt, you'll just feel out of place. Very friendly service.",
                "datePublished": "2015-03-24"
            }
        ]
    },
    "80": {
        "id": "ZxdgX8JgLADrhw_bymyF9Q",
        "name": "Balthazar",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Covent Garden, Strand",
            "streetAddress": "4-6 Russell Street\nLondon WC2B 5HZ\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media3.fl.yelpcdn.com/bphoto/FK11d_CYj43oFBmbrVnHwA/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 3301 1155",
        "review": [
            {
                "reviewId": "Gmi6SSKBnEtu8E5RfxKE6g",
                "author": "Kate S.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Sat at the bar which I was happy to get as a walk-in on a busy Sunday.  But I don't recommend it. The bar is particularly uncomfortable mostly because the counter does not extend out enough to get your knees under it properly.  Also no hooks for bags and purses so where are you supposed to put those things? Wayyy down on the floor is where.  You will also be jostled by people waiting behind you as you eat. I had the fines herb omelet which was fine and came with a side salad that was unmemorable and an equally unexceptional pain au chocolat. All in all a big \"meh.\" I might return and sit at a table and have something at which excel.  Maybe.",
                "datePublished": "2016-07-10"
            },
            {
                "reviewId": "e4rqFXfXGUBnA24gQbhu-A",
                "author": "Chad E.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "One of my favorite NYC restaurants and the hype of 'designed to be identical to NYC' we had to check this place out and make our assessment as loyal NYC patrons. \nResult: Pretty Damn Amazing. When greeted at the door our jaws dropped and we were impressed at the likeness of the NYC look and feel. The gentleman host said to me the only difference you'll see is outside there are black cabs instead of yellow ones and then he offered to paint one yellow... now that's service. LOL\nOn 2 March we were transported to a mini-NYC at Balthazar after tapping redial 24 times we were about to feast! I can appreciate my fellow yelper, Kate H.'s experience of 137 attempts to get a table. I realized I needed to modify the reservation which resulted in 67 calls. CRAZY but this was a must-try for myself and some special New Yorker friends.\nEverything was great and aside from a few opening hiccups (all places go through them) the staff gave us a great night. I started off with the winter kale salad followed by the linguini \"Fruits De MeR\" and both were quite good. There were 8 of us and we had two reservations since they were only taking a max of 6 per table. The staff was so kind to try and seat us close together however we ended up with a round table and managed to get everyone seated cozily in the same place. There were many great dishes served up at our table, rock oysters, salad niçoise, côte de boeuf, duck and stone bass. One person's only minor complaint was the stone bass was already deboned. (personally I find that a bonus) However he prefers to demonstrate his skills of removing it as one piece before enjoying and like I said minor thing. Each person said they enjoyed their meal and would recommend it.\nDue to the newness of everything serving times were a tiny bit delayed but when you have great company it doesn't get noticed as much. So after bottles of champagne, red wine, fabulous food and yes, dessert followed by dessert wine our time at Balthazar came to a close. The restaurant is beautiful and the food was very good. I'm sure with time their service and delivery times will improve. One of the managers was kind enough to drop by and chat with us. She was visiting from the NYC restaurant and helping get London on track. I look forward to my next dining experience at Balthazar and I'm almost certain you'll enjoy it as well. Cheers to a little piece of America right here in London y'all!",
                "datePublished": "2013-03-26"
            },
            {
                "reviewId": "pIQQuAJwzq6ytNxYl5ktMQ",
                "author": "Luca B.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I've been to Balthazar last Sunday for a quick brunch with my love and I've been immediately surrounded from the elegant atmosphere, It has been a pleasure taste the rich and elaborate food they served in elegance and accuracy. Share the experience with my love it was great. I really suggest the place for also the accurate list of alcoholic and non alcoholic cocktails they have. Thank you again.",
                "datePublished": "2016-07-08"
            },
            {
                "reviewId": "nvgH-aaIJ1_h1T2rH9h1mQ",
                "author": "Emma M.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I loved the New York version of this restaurant when I lived across the pond, so I was really interested to try out the London version that seemed to be years in the making. I met two friends with whom I had been the NY version - just so we could compare notes! \nWalking in, I thought I was back in New York. It is almost identical! \nI had the snails to start with - they were delicious (well, they were unbelievably garlicky - which is about all you want from snails really). I actually swapped a snail or two for a couple of my friend's oysters - also really really scrummy (the oysters, not my friend. although she is pretty hot to be fair). I then followed up with Chicken Paillard, which was damn near perfect. \nYou know what I like most about Balthazar though? It's French cuisine, in London, run by Americans. This means that the food is exquisite, I can get to it without boarding a plane or an international train and the service is bloody excellent. Really, they can't do enough for you - which is such a pleasant change when ordering French food!",
                "datePublished": "2014-04-24"
            },
            {
                "reviewId": "YerN7AzxOce_37GDZyd5Ag",
                "author": "Lars B. F.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "This is a fancy food factory. The dining room is quite nice, but there are two main problems with this place:\n1) The service: everything goes too fast. It is very clear that they have been instructed to get as many seatings in as possible. You barely get to sit down before someone is there to take your order, the main course comes directly after the first course, and they start clearing the table before you have finished. That being said, the staff are all very nice.\n2) The food: I got a steak which wasn't bad, but not something very good either. The chips which came as a side was like McDonald's chips with less salt. An with that came a bernaise sauce which isn't really worth mentioning.\nI have had far worse dining experiences, but it doesn't change the fact that this is tourist trap although of the better kind.",
                "datePublished": "2014-06-29"
            },
            {
                "reviewId": "5E4Xd_Y6jNLyj6YBucNc9w",
                "author": "Namita A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "we had brunch at balthazar and enjoyed our time immensely.  our friend was a  wee bit late so we started with the champagne and OJ (ok less OJ), and had the chicken liver pate, which was delicious and smooth !  We then went on to order the crab and scrambled eggs, delicious and fresh as well as the duck confit -- OMG that was the star -- fall off the bone yummy!! \ndecor was great -- loved the distressed large mirrors -- beautiful!  and the SERVICE! they were so great --  gracious and welcoming.  Love that place :)",
                "datePublished": "2014-05-29"
            },
            {
                "reviewId": "cWNlyR-RVEc9ReMGu1bjWA",
                "author": "Katy G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "So swanky, so glam - the attempted Shoreditch hipster in me was waiting to find something wrong at Balthazar.  A lot of the staple London must-eats have disappointed in times past. But alas. This was the real deal.\nMy partner booked us a spot for my Sunday Birthday lunch here. We received a perfect corner table tucked in, in the middle of the restaurant - a perfectly romantic setting.\nDespite the restaurant being full - of families, couples, etc. the acoustics were great and it was easy to carry on a conversation. From a service perspective, everyone was really attentive, providing space to enjoy our meal but always coming over to keep the champagne flowing.\nFor food, my partner went for the eggs benedict and I opted for the eggs norwegian. We shared escargot to start. The eggs were made absolutely perfect, in fact I'm now convinced that almost every other brunch place I've ever been to needs a lesson on \"how to make the proper egg\".  Once our plates were delivered, we opted to have some bread from the bakery with our meal (as opposed to the basket which just seemed like too much food with everything else) - and yes, save space for the bread if you want a little taste of France with your meal.\nThe escargot in garlic butter was pretty much one of the best starters I've ever tried. I've attempted to now order it (thinking it was my new thing) at other restaurants since, but nothing has compared. Highly recommended even if you don't fancy yourself and escargot eater, or are trying it for the first time (though be warned...it will never be the same after). \nIn short, make a special occasion with someone special and go!",
                "datePublished": "2014-07-22"
            },
            {
                "reviewId": "taU1a9B-yRl1nACxvRzCfg",
                "author": "Ally W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I went to Balthazar years ago in New York and really like it, and I was happy to find in in London right at the heart of Covent Garden. You get that French Bistro feel as soon as you walk into the restaurant. They have a lovely display of fresh seafood: lobsters, crabs, shrimps and, of course, oysters. \nThe menu here is big and quite French, so if you are in the mood for steak tartare, escargots, duck and steak and frites, you have come to the right place. Since the restaurant is in London, you can also have some British flair, like a duck shepherd's pie. We must not forget the daily specials. The evening we went was a Sunday, so I went for the ox cheek bourguignon, because the server highly recommended it to me. It was adequate but not great. The sauce was way too heavy and instead of the flavor Burgundy wine, I just tasted salt. However, the meat was well cooked. I think next time I will not ask for the waiter's recommendation and just stick with steak and frites.",
                "datePublished": "2015-01-01"
            },
            {
                "reviewId": "HMtJM0E3Y0Rr2cPHYf9U4w",
                "author": "London Foodie Mam A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Balthazar is a french brasserie set in the heart of Covent Garden. Lovely atmosphere and decor - great to take a date or your visiting guests from abroad.  The food is of a high standard - the duck confit was as good as we have sampled in France.  The afternoon tea was good value at £25 compared to the high end hotels such as the Ritz or Claridges; scones were delightful and the patisseries beautifully presented. The sandwiches were rather average and dry though.\nDuring the day, the venue is casual enough for children however the acoustics of the room means it gets very noisy. There were large groups of ladies-who-lunch, sipping their tea and we felt slightly out of place in the grand settings.  Highchairs available, tables a little tightly packed to house buggies. Staff were extremely helpful and friendly - top marks there. \nlondonfoodiemama.wordpre…",
                "datePublished": "2015-04-17"
            },
            {
                "reviewId": "BZoyAkYGUdRrWw8fGW1CXg",
                "author": "Mark W.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I just had the perfect Bloody Mary. Never mind how insanely great my breakfast was (which it was). Perfect Bloody Mary. I've never even considered that there could be a perfect Bloody Mary. It's just the brunch drink. But swear to god, first sip of this and the entire world brightened up.",
                "datePublished": "2016-03-03"
            },
            {
                "reviewId": "VwuKe-Hjq04lBdphuxRC7Q",
                "author": "Sar P.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "The London balthazar is even better than the new York balthazar!! I had a soup, sandwich and chocolate tart a SD they are delicious! I had a quiche (was not a big fan) and another chocolate rocher and that was awesome! They have mint water which is refreshing!",
                "datePublished": "2014-10-20"
            },
            {
                "reviewId": "7y4ac9mKVakiYVW9oPOgyQ",
                "author": "Thalie A.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I was so keen to try out Balthazar in London, as I'm a fan of the NYC Original. I was not let down either.\nThe only blip was slightly slow service between the starters and entrees otherwise, this is a solid 4 star place.\nThey have managed to capture the NYC buzz within the restaurant, likely courtesy of it being in the middle of tourist central or as I also suspect, it's the damn good food and service in here.\nThis is an exact replica of the NYC original and we were seated promptly. I needed to try the Escargot since it's been a while since I had them - queue NYC Balthazar. DELISH!! They were so lovely, I thought each was cooked individually - not one chewy mollusk in the bunch.\nOnto the scallop & courgette risotto...creamy, morish goodness. The scallops were melt in your mouth goodness. The vodka cocktail washed all of  it down nicely.\nMy mates had a variety of dishes and all were tucking in heartily too. Not an empty or unsatisfied stomach among us. Compliments to the chef, the helpful and friendly waitstaff and our lovely waitress.\nIf you haven't been and need a NYC or faux Parisian fix of coolness get in there!",
                "datePublished": "2013-10-28"
            },
            {
                "reviewId": "rPiSxexqtKJz9TilgrUW2g",
                "author": "Courtney G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Delicious brunch. I had the scrambled eggs with sourdough toast and Cornish crab, which was absolutely divine. It's not the cheapest, but certainly not too expensive. It's a popular spot so quite busy, but we still felt like we had our privacy. Bonus points for the posh bathrooms. Would definitely go back and highly recommend.",
                "datePublished": "2014-10-11"
            },
            {
                "reviewId": "yURZiKpu9weJWnL5B6BcEw",
                "author": "Rich M.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "This was in all likelihood going to be the review that got away. I've spent time in the original Balthazar and had some lovely lunches but, especially in a white hot, can't get a table for love nor money, opening period, I'd resigned myself to forgetting about the London branch. And anyway, who really wants to go to the London branch of a slavish New York recreation of a traditional French bistro? I could be on the Eurostar before they'd answered the reservations line.\nAs it goes, it's reasonably quiet, even on a Thursday lunch, and therefore the perfect spot to slide into a banquette opposite the International Man of Mystery. He's never sure which city he's in at any given point in time, so this level of high class generic internationalism is perfect for him.\nIt's not cheap, their range of French classics, but if you've come here deliberately you know that and are comfortable paying £24 for a plate of Steak Frites and £17 for a burger. If you're a wall-eyed tourist who has just stumbled across its prime Covent Garden location then congratulations. You're going to be fleeced, but in a much more pleasant way than if you'd wound up in the Angus Steak House.\nGet a back wall booth if you can, perfect for people watching amidst the monied buzz and much, much more room than on the cramped banquettes filling the centre of the room.\nAfter being spoilt by their homemade bread, the ceviche starter was utterly underwhelming, a few rings of squid or octopus in a vinegary coleslaw of mandolined bell peppers and onion. From a distance it looked perfectly pleasant, but ended up being pushed around the plate.\nConfit duck on the other hand was perfect. Rich and unctuous, it fell off the bone like a dark brown silk dressing gown sliding from a dressmakers dummy. Definitely a contender for comfort dish of the year, though at the price it bloody well should be.\nIt's a lovely cavernous space, with decent food slightly over-assiduous staff (that'll be the New York influences rather than the French) but for the money, the ambience and the attitude, I'd much rather be in Zedel, sucking down champagne with the money I've saved on my steak. If it's a power lunch that I need, then I'll be back at the Wolesley first.",
                "datePublished": "2013-09-28"
            },
            {
                "reviewId": "sQaWuc_BzS5SB3eqMgyu3A",
                "author": "Amanda D.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "On a freezing night in November, some friends and I stepped in for what we thought would be one beverage. \nThe ambiance is warm and the wait staff was knowledgeable and enjoyable, so we ended up sticking around for hours. \nWe sat in the bar area so I don't have insight on the food, but I was served good whisky and great conversation. \nTip: the bathroom is upstairs and tricky to access with anyone else, so it's not recommended to travel in packs.",
                "datePublished": "2014-09-18"
            },
            {
                "reviewId": "OjyRtvDYuTPQ0-MfxS_f4w",
                "author": "Ingrid H.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Went for Saturday brunch.\nCoffee was great, but my meal was blasé.  No one else at my table seemed to be all that jazzed about their meals, either.  I ordered the New York pancakes and, to be clear, these pancakes are not 'New York' pancakes, nor is there any such thing, for that matter.  They are, perhaps, an attempt at American-style pancakes, but that's about it.  In any event, this New Yorker who arrived with an appetite for some heavenly pancakes wasn't impressed with the effort.  Folks who enjoy more of a Dutch-style pancake (mmmm, lekker!), for example, would also be greatly disappointed in this effort.  They just weren't good pancakes in any regard.  Fairly decent pancakes are just so easy that to get them all wrong speaks volumes of a restaurant's kitchen.  \nI also ordered a side of scrambled eggs, and the eggs arrived barely above room temperature and, as with the pancakes, were fairly bland and disappointing.  Again, eggs are not astrophysics in the world of culinary arts, so c'mon Balthazar.  Get it together.\nAs a side note, I'm really tired of these otherwise fabulous U.S. restaurants and businesses (Balthazar, Shake Shack, Whole Foods) opening up spots in London, getting a ton of business from their reputation in the U.S., but then half-@ssing it over here in the UK and getting away with serving sub-par dishes that would make most of the kids back in the States grimace, and certainly the New York crowd.\nIn sum, Balthazar London is just no match for the New York location, and not even close.  In fact, I don't think that Balthazar would have ever made a name for itself if the dishes flying out of its New York kitchen were as boring as those at its London location.  Such a shame.",
                "datePublished": "2013-10-12"
            },
            {
                "reviewId": "dFA6pz_Ha_DIuRlxWN68Gg",
                "author": "E J.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "I'm a big fan of Balthazar in New York, so was over to the moon to hear one had opened in Covent Garden. While the look and feel of the restaurant is similar to the original in NYC, it's lacking a little something that I can't quite put my finger on.   While the food is nice, it can be a little bland - the burger for example, at £17 you'd hope for something with a little more pizzazz. But it's a cute little stop off if you fancy grabbing a coffee and one of their lovely pastries. You can sit in a little area by the bar, do some people watching, not break the bank.   The real winner here is the bread & desserts (not at the same time) - which I know may sound odd, but it's certainly one to try. The Pavlova is lovely.",
                "datePublished": "2015-09-22"
            },
            {
                "reviewId": "7nLvXg4OYEu4yTGWTE2qzA",
                "author": "Caren H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "I love the fact that this place was totally abuzz at 10:45 on a Friday eve.  Most places in London are shutting down and shooing you out, but not here.  Here we were welcomed in with open arms to be served and fed and not rushed out even as they were closing.\nGreat traditional French menu and wine.  Bring on the escargot, steak tartare and dauphinoise s'il vous plait!",
                "datePublished": "2014-07-19"
            },
            {
                "reviewId": "d_GEHzDDLIOu4QpWaTmIng",
                "author": "Minnie M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "With Shake Shack, 5 Guys, and Balthazar all in the same area, I wouldn't be surprised if American restaurants slowly infiltrate Covent Garden the way Chinatown did to Little Italy in Manhattan.  Bring over Trader Joe's, and then we'll talk.\nDespite the quick seating and the fabulous service, I never really understood the hype of Balthazar in New York either.  I loved its baked goods, but I was never blown away by their food.  Same with my experience at Balthazar in London.  Bf's Balthazar Bar Steak (16 quid) was tender and juicy, my 22 quid bouillabaisse (a special only on Friday) was delicious, but it's definitely more of a place to be seen and checked out, rather than a place you'd go for your anniversary.\nDo, however, get the 10 quid raspberry souffle, even if it takes 10 minutes to make. I would skip the clafouftis as it was pretty dense.",
                "datePublished": "2013-07-15"
            },
            {
                "reviewId": "ArP_CLBJ2-WKvLLW1uhPOA",
                "author": "Johanna G.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Came to their cafe in search of some awesome baked goodies for lunch -- and walked away thrilled!\nI had a sticky bun and the salami/mozzarella/tomato (or something like that) sandwich on a potato-onion roll -- loved both of them. The sticky bun is both dense, chewy, and perfectly flaky, with rich flavor and texture. The sandwich was also quite flavorful and the bread certainly unique! \nA friend bought a scone box (which was actually rather well-priced) and I've a mind to go back to try it later.\nStaff are very friendly and seem to really enjoy working there (and like interacting with the tourists). Definitely go!",
                "datePublished": "2014-08-07"
            }
        ]
    },
    "100": {
        "id": "ZxdgX8JgLADrhw_bymyF9Q",
        "name": "Balthazar",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Covent Garden, Strand",
            "streetAddress": "4-6 Russell Street\nLondon WC2B 5HZ\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media3.fl.yelpcdn.com/bphoto/FK11d_CYj43oFBmbrVnHwA/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 3301 1155",
        "review": [
            {
                "reviewId": "zTYsGD9AhVoYUYKTZShA7g",
                "author": "Erica L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Came in on a Monday evening 7pm with 3 other girlfriends without a reservation. We were seated promptly without a wait-- we're off to a great start! Our waiter was knowledgable about the specials and was helpful without being too pushy. The restaurant itself is grand. High ceilings, chandeliers, wine bottles were lined up on the wall of the bar, and a plethora of fresh oysters and shrimp were displayed on ice. \nI started off with a chicken liver/foie gras appetizer. Very generous portions and tasty. For the main, I ordered the grilled dover sole and it was perfectly cooked! My friends ordered the lobster spaghetti, salmon, and steak frites and they all enjoyed their dishes as well. If I wasn't a broke college student, I would have ordered the chocolate souffle for dessert-- it sounded divine!\nBalthazar is a great place to people watch and treat yourself. The ambience is ornate, the service is wonderful and prompt. A little pricy, but I'd definitely come back!",
                "datePublished": "2013-07-23"
            },
            {
                "reviewId": "ooS5wIef77TX-ee1Zsd6tw",
                "author": "Shaun D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The plan was to come here for a late Saturday Brunch and get some eggs. We arrived to find a queue but had looking booked, so we went straight through. After we walked in and were seated I managed to glimpse so amazing dishes which made me think twice about the original plan. I ended up going for the burger. Cooked to preference, with a great homemade sauce and bun. It also came swimming in a sea of French fries. Normally I wouldn't complain but maybe it was a bit too much as I don't like to waste food. My partner stuck to the original plan and got a cheese omelette. I tried this also but it was overly cheese and quite small. Coffee was also top notch. Staff were very friendly, attentive when needed but let you get on with your meal in peace. (Visit - 09/05/2015 Lunch)",
                "datePublished": "2015-08-07"
            },
            {
                "reviewId": "AXMoWenT3N3R2skbTRdNsg",
                "author": "Freya C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "*Bolsheviks beware, seriously bourgeois review is brewing along with the coffee*\n______________\nSometimes I just love being bourgeois.\nFrothy coffee and pricey pastries quelquefois, really is the only way to start the day, darling.\nIf, like myself you were sheepishly excited at the expansion of Keith McNally's faux-Français New York establishment into exciting new territory (London), yet were NOT terribly thrilled about the prospect of hitting redial on the phone every minute for three days in vain expectation of securing a dining reservation (I mean I have so many better things to do with my precious bourgeois time, right) the Balthazar Bakery located right next the the restaurant proper may be a nice solution for a coy little indulgence - experience the atmosphere sans the wait.\nHaving lived a block away from the original restaurant-bakery duet in Soho NYC (I know, how bourgeois), I was of course excited to relive my (occasional) self-spoiling mornings and thus decided to breakfast à la Balthazar aujourd'hui. I was not disappointed. In fact, I was exuberantly delighted to sample their twist on a classic croque monsieur [soused in béchamel-sauce finished with Lea-and-Perrins lacerations]- the textural experience was sumptuously akin to that initial and rather glorious creme-caramel fracturing moment. I'm afraid biting through the crispy, grilled bread surface into the soft layering of jambon et fromage interior, is simply worth the excessive £4.50 it demands.\nBien sûr, the usual boulangerie window-pageant of baked goods is certainly inviting, and the gleaming white-tiled walls bedecked with cursive 'B'-inscribed wholemeal loaves exude a constructed charm one only thought possible in a Hollywood studio (you have ACTUALLY been to Paris, yah). Though I would even be so bold as to suggest that the B-B London even trumps its NYC predecessor in terms of the open space and ability to convince its patrons that they are actually there to shop (market-style) rather than just queuing for a costly caffeine and butter-filled petit déjeuner, distributed in a somewhat nonchalant and brusque manner (although that would probably be the most authentically French thing about it).\nBon appetit, comrades.",
                "datePublished": "2013-03-20"
            },
            {
                "reviewId": "hY5iVbSwgwNsnHspdW4J_A",
                "author": "Evan C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Had the Chopped Salad along with onion rings, my other guests had the Salad Nicoise and the giant Mac and Cheese. The Mac and Cheese was particularly awesome. Great way to transition back from great French vacation food to good US fare...",
                "datePublished": "2014-09-01"
            },
            {
                "reviewId": "zG9Uygf_ebsEvPtEmYMeQg",
                "author": "Honey N.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "We had such a positive experience here, I can't wait to take the rest of our family back. My daughter and I were shopping in Covent Garden and we stopped for lunch at the bar.  I had a delicious chopped salad and the manager and bartender were so kind to chat with us and make a special crepe for my daughter who was hoping for the pancakes.  I lived in NYC for 7 years and used to love going to Balthazar.  This one is equally as great--fabulous atmosphere, staff and food--a few of the people at the bar were clearly regulars and it felt like Cheers--where everybody knows your name.",
                "datePublished": "2013-10-29"
            },
            {
                "reviewId": "zGK3UlRmYuvmUC9dRE0E8A",
                "author": "Kate H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Happy dance for one of my favorite NYC staples making its way to London!\nFor the entire three years that I've been living in London, I've been hearing rumblings of the prodigal son, Keith McNally bringing his French brasserie juggernaut across the Atlantic. And with much fanfare and panache, the will-he-won't-he speculation finally ended last Monday evening. They're currently only open for dinner service, but brunch and lunch service is coming soon. \nAfter 137 tries (thanks, iPhone for keeping track) to get through the booking line last Friday morning, my fortitude was rewarded with an opening week dinner spot. So, last night we sat down for an early-ish dinner, that is very much what I remember from back home. \nThe staff is an eclectic mix of London's restaurant service elite; NYC Balthazar linchpins; and an eclectic mix of French servers representing the best of The Hexagon's diverse regions. It's an impressive bunch! \nThe American hospitality smacks you in the face as soon as you walk through the door. At first blush, it can be a bit much for those of us used to the cold shoulder presented at so many London establishments. But we acclimated almost immediately--it sort of made me miss home. Sigh.\nWater appeared via busboy -- what!?. Our Breton waiter brought us expertly made cocktails (Brian and Tom were both poached from other top London cocktail establishments). Fine de Claires on-the-half-shell were ordered and brought in a flash. Briny and fresh, I was in heaven. Bread from their boulangerie next door was devoured with French butter (of course). \nI started with the onion soup, which was unctuous and just a little bit sweet. The hubs had a small portion of the beef tartare, which he figures is some of the best he's ever eaten--and he eats it a lot. Another member of the waitstaff recommended a bottle of red from the Jura, her home turf, that was one of the more interesting bottles of wine I've ever had. Slightly effervescent and light in color, it takes a couple of sips to fall in love, but amazing once you get there.\nIt accompanied the whole chicken for two very well. The chicken itself was roasted to perfection and served with jus, a mix of veg, and velvety potato puree. By this point we were stuffed to the gills, but dessert was needed--for research purposes obviously. I ordered the tart du jour, lemon with a raspberry reduction. Lemon tart is my Achilles heel as of late, and this one was very good. Although, it was more of a lemon mousse with crust, than a lemon tart. Even so, still delicious! My partner in crime had the cheesecake. It was a small portion, but it was so rich, there was no reason for more than they served. He nearly licked the plate clean. \nMy only complaint at this point is the timing is a bit off. The coffee came before we had finished our dessert, and after presenting us with the whole chicken, it went back into the kitchen for plating for what seemed like an eternity; I think it was actually more like 15 minutes in human time. But it's their first week, so I imagine things will get smoother with time. \nFor those of you who've fallen for the New York Balthazar, you'll recognize the room as an almost exact replica. Other brilliant American aspects include walk-in seating at the bar, the seafood tower, and a true New Yawka working the door. Did I mention the busboys? Oh, and how could I forget? It's reasonably priced; I mean, for Central London anyway.\nYes, as my husband said, it seems like the universe is finally throwing us a bone on the London dining scene. I think a standing weekend reservation may be in order.",
                "datePublished": "2013-02-23"
            },
            {
                "reviewId": "d-b3DB2XYbWrt0pzMeklOw",
                "author": "Anna G.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "In a word, the breakfast I had here was incredibly underwhelming, and the other people in my party said the exact same thing.  The service was not bad by any means, but the servers did come off as a little bit scattered.  My waffles were quite dry on their own, and the fact that they gave me no syrup with them really did not help.  One person in my party ordered scrambled eggs, and they were essentially in liquid form.  It was actually quite disgusting, even to look at, let alone eat it.  I know that this place has a good reputation, especially the NYC location, so I was disappointed by the experience.",
                "datePublished": "2015-04-01"
            },
            {
                "reviewId": "HlBLl1kV0UbjJYyUaGuDRw",
                "author": "Fabrizia R.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Everyone was talking about it so I decided to check it out for lunch. I must say I have never been to the NYC one.\nThe decor is respecting what the americans probably think it is (or was?) a french posh restaurant, a  bit \"ville lumiere\" with a lot of big mirrors and lamps.\nthe food is good and the service is good and polite. My dad and I had a big steak with french fries, while my mum had an omelette. We were satisfied. \nI kinda like the place, probably will come back since I have heard that the brunch is very good.",
                "datePublished": "2014-03-16"
            },
            {
                "reviewId": "esEJWW7cWIAQXAYTc1wOgA",
                "author": "Lazaro D.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "As far as brunch spots go I'd say this place is a safe bet. The service was good and the food was tasty. The eggs Benedict was good but didn't come with a side so I was left hungry. A half order of the NY pancakes finished me off and rounded out the meal. \nThe meal was expensive relative to what you get. That could be a function of the location being next to covent garden square (great place to grab a cup of coffee and listen to the street performers. Exactly what I'm doing as I write this review) or London being expensive...full stop.",
                "datePublished": "2014-05-24"
            },
            {
                "reviewId": "8069NIwJxh3M7rG2W5-55g",
                "author": "Lorrie Z.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "As many of my fellow Yelpers have said, it's the perfect Americanized French brasserie brunch spot.  Very NYC in Londontown.  Very good service, very good eggs, very good champagne.  Amazing soufflé, worth it if it's just for that alone!  It was the perfect way to celebrate my birthday before catching the matinee performance of The Book of Mormon.",
                "datePublished": "2014-05-05"
            },
            {
                "reviewId": "OgKJl2LqxMn8AH-P-tMZRQ",
                "author": "Sanj M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The American influx of Central London eateries continues! My mate had to book weeks in advance to scoop a Friday night reservation and the place was buzzing. Uber prime location with cool interior that lets you pretend you're in NYC (or at least that Sex and the City ep it appears in!). Very much a place to see and be seen with a price tag to match; the food is just 'ok'. Service is top notch though and left me with a smile on my face, even after a disappointingly squishy chocolate soufflé.",
                "datePublished": "2013-09-03"
            },
            {
                "reviewId": "JVVaLHCZPB429K14hUX29w",
                "author": "Derwin B.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Setting: This restaurant is big and airy and it really feels like you could be in a mid-20th century French brasserie. The atmosphere is very relaxed and is great for brunch. Even the bathrooms are big and bright. Being in Covent Gardens this is a great location to meet someone from the other side of the city for brunch.\nService: The service was excellent. The staff were attentive, friendly and helpful without ever being overbearing. I really enjoyed this aspect of the experience.\nFood: I had my first ever Escargot here and despite my hesitancy over eating snails they were delicious. As brunch goes I wold recommend the Moules Frites. The mussel portions are very generous (I was full before I got to the fries). However the fries are more crunch than substance and a thicker cut (if going off the french fry vibe a little) would make them even better. I definitely want to try the rest of the menu and would come back.",
                "datePublished": "2014-06-01"
            },
            {
                "reviewId": "SXvLDa-ZNlRR5s2-TQ1bZA",
                "author": "Ésa K.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "It was really just ok....and I cannot understand the hype of this establishment other than the fact it's from New York and therefore that MUST mean we should all love it for the ''New York chicness'' or whatever.......\nThe decor was very French bistro, the lighting all soft and yellow toned so you felt as though you walked right into an instagram photoshot. I'm sure it would be a very ''chic'' place, there is no other word but chic for this place, to hang out for brunch on Sundays. But I was not impressed with the food selection nor the quality of the seafood. \nThe chairs also had no cushions on them so you were sat in this hard wooden chair for the entire evening which makes your bum sore and your skirt sticking to the back of your legs. The tables were tiny and they tried to squeeze as much cutlery, bread plates, bread baskets, glasses and what have you, on this tiny (again hard topped) table. \nThere were also A LOT of tables crammed into the whole place, as if the proprietors were trying to simulate a cosy, vintage style, café atmosphere....but actually, to me, did nothing more than to increase the noise levels and made everthing appear very messy.....\nVerdict - dislike!",
                "datePublished": "2013-04-22"
            },
            {
                "reviewId": "yWP7Y3GWSDipE-Tu-7uKag",
                "author": "Denis B.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "visited Balthazar London after a number of visit at Balthazar New-York - same menu, different currency! food was excellent, as expected, although in London they have quirky hours . Seemed that the pricing was significantly higher than NYC - Why?",
                "datePublished": "2016-01-10"
            },
            {
                "reviewId": "9PLrgTrV3-gEYVMarqUEVQ",
                "author": "Jane G.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Visited this bakery a couple of times now for lunch. They do really tasty sarnies, and normally I'm not a huge sandwich fan. The bread they use is really good and the fillings are quite interesting - I've tried the roast beef and celeriac slaw in a focaccia and the ham and butter baguette - it has hidden tiny gherkins! Yum! They sell salad boxes and lots of different yummy looking cakes (unfortnately haven't sampled any yet).\nThe bakery has a couple of counter style seats inside but not many. The place is quite pricey for a bakery but I would say worth it if you need a lunch time treat to brighten your day!",
                "datePublished": "2013-09-05"
            },
            {
                "reviewId": "htvb9PSg8625RnOYGkKAgQ",
                "author": "Georgina H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I come here for brunch at the weekends or for lunch when I'm not feeling well. Sometimes when I dine alone I receive a complementary glass of sparkling wine, which definitely helps me to feel better. \nThe brunch pancakes are superbly well balanced with fruit, syrup, and creme freche. And for lunch my favourite is to have the skate wing, which is cooked just like my Mum used to. Whatever I have I find the flavour combinations to be perfectly balanced. Unfortunately the price is a little higher than I would like so I don't come as often as I want.",
                "datePublished": "2015-05-05"
            },
            {
                "reviewId": "g05Qz7kNetkYBaQmSces3Q",
                "author": "Punam D.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Came here last night. This is a lovely traditional looking French restaurant with American features. I was bewitched by the interior and by the very good service. They put a rush on for us when we let them know we had a show to get to, but it didn't affect the quality. I had the garlic prawns to start with the most delicious olive bread. The sauce was rich with the aroma of prawn and fish; very moreish! I then moved on to the steak frites but I found the sirloin a bit tough. I had someone else's fillet and that was perfectly seasoned and tender. Don't go for the house sparkling white unless you prefer it less brut. The champagne was much better. We also had a Pinot noir which was excellent. I had a brilliant evening in this vibrant and buzzy restaurant. Truly I can't wait to go back!",
                "datePublished": "2014-09-26"
            },
            {
                "reviewId": "7NdPziFowKv8WBzIpWZXXw",
                "author": "Hani A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Been going to the New York one since the the 90s, never had a bad experience, the one in London is a copy of the NY one intern of atmosphere, service quality, and quality of dishes.. Few dishes are different in the menu in London.  Very good wine list reasonably priced.",
                "datePublished": "2013-10-19"
            },
            {
                "reviewId": "p7CXWwXlpb1FJp_liic5GQ",
                "author": "Thomas A.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Well get that dialing finger at the ready because you're going to need to book ahead. This isn't a 'let's wander around Covent Garden and see what we find' kind of place, but once you're in, you'll be glad you did. \nThe service is very American, which is lovely and refreshing at times, it's nice to be a bit catered to by an army of staff. The decor, like everyone has noted, is a replica of the NY one with loads of French charm. We did a brunch and aside from one of the best bloody marys I've had, the food was pretty epic. An eggs benedict that will not leave you feeling peckish afterwards.. oysters, baked mac & cheese, soufflé... you can easily go overboard with the decadence meter but you'll have to do it sometime, no?\nThere's a bakery attached where you can take away some of the tempting sweets and fresh breads. It's a must stop for anyone that loves eating, you'll agonize over what to order and end up getting the entire menu like we did. It's not totally overpriced either, for what you get it's actually quite reasonable.",
                "datePublished": "2013-05-01"
            },
            {
                "reviewId": "oo0WrwTdI_-HtmPtbIjWZQ",
                "author": "Taymour Q.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Wow. What lovely bread. The new salad of beets and carrots with burnt orange dressing  is just out if this world. The steak au poivre was just perfect and the service top notch.  I'm coming back.",
                "datePublished": "2015-03-11"
            }
        ]
    },
    "120": {
        "id": "ZxdgX8JgLADrhw_bymyF9Q",
        "name": "Balthazar",
        "category": "french",
        "servesCuisine": "French",
        "priceRange": "£26-45",
        "address": {
            "addressLocality": "United Kingdom",
            "addressRegion": "Covent Garden, Strand",
            "streetAddress": "4-6 Russell Street\nLondon WC2B 5HZ\nUnited Kingdom",
            "postalCode": null,
            "addressCountry": "GB"
        },
        "context": "http://schema.org/",
        "image": "https://s3-media3.fl.yelpcdn.com/bphoto/FK11d_CYj43oFBmbrVnHwA/ls.jpg",
        "type": "Restaurant",
        "telephone": "+44 20 3301 1155",
        "review": [
            {
                "reviewId": "Z-DQiTFmarLqFdsDhzdaqQ",
                "author": "Alex C.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "Sadly this was a let down and isn't a patch on the NYC one. I suspect the location in London is one of the issues as it ends up being full of tourists and almost feels like an Angus Steak House!\nOur waiter knew diddly about the menu and when i asked for a standard drink - fresh lime and soda, he got a proper sweat on and then told me they didn't stock that cocktail?! \nThe actual brunch was so so but nothing special.",
                "datePublished": "2013-07-30"
            },
            {
                "reviewId": "K8gJnmQ0_llV9PBQ8BkeZw",
                "author": "Qype User\n Harv-m…",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Yum! Had read negative professional reviews in the papers and was hesitant to try it, but so glad I took the plunge.\nPros: Lovely ambiance (similar to Delaunay), excellent front of house staff, excellent waitstaff. Asked to have table changed during a busy lunch hour as wanted more privacy for a lunch meeting and was accommodated immediately and gracefully. \nPlats du jour are an excellent deal. Food is consistent, menu is varied, pricing very reasonable for quality of food. Balthazar house salad had just the perfect touch of truffle oil and seasonal ingredients. Mains are superb. Even the bread basket offers a step up from the standard dry baguette that one finds elsewhere. And the takeaway bakery next door is charming.\nCons: Forced to come up with something, simply that there can be a bit of wait it seems others have discovered this gem as well!",
                "datePublished": "2013-05-21"
            },
            {
                "reviewId": "WwxJwYTWJmInMn-JFmSmnQ",
                "author": "Ben W.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Done the NY one. Enjoyed the buzz. So when it opened here in London we thought we should give it a try.\nBut getting in at a reasonable time is a different matter. All booked up.\nJust so happens we had tickets for Charlie and the chocolate factory at Drury Lane on Thursday. 7.30 kick off. Balthazar right outside. Why not try a pre-theatre raid.\nA 6pm table of 3 was duly booked. We got there on time and the place was already busy. The bar was full and three quarters of the tales were taken. Bags were swiftly taken and we were at our table.\nBalthazar London feels exactly the same as New York. Loud. Thronging. hot. Nicely decked out in authentic French brasserie tiling and furniture. Serving staff whizz round all over the gaff and there is a big seafood bar at the back to whet the appetite. This is proper tourist London stuff, and I don't mean that in a bad way. Slap bang in the middle of covent garden and full of hip things out for a good time. It feels great.\nThe menu is what you'd expect from a good French brasserie. Nice bread arrived to munch on, plenty of it. Followed by a good moules et frites which was lifted by the inclusion of caramelised fennel. The boy had macaroni cheese sans the bacon and the missus had a skirt steak that was full of taste. \nMy chip were a little soggy was my only complaint on the food. But it was pretty expensive for what we got I thought.\nHowever, you're paying for the great atmosphere, not the food. And for a bit of a treat if you're painting good old London Town red, it's definitely got it. Go there and show out. It's fun. Not perfect food and a bit pricey but great fun nonetheless. Not quite a 4 but a high 3 stars well earned.\nNb If I did theatre reviews I Would give Charlie and the chocolate factory 6 stars. It was truly brilliant. And I hate the theatre.  Book it. And try Balthazar before for a proper night out!\nThe place was heaving by the time we left at 7. So do book.",
                "datePublished": "2013-10-04"
            },
            {
                "reviewId": "lijXzvp_N3hTOUpuZ8d2SA",
                "author": "Guven H.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Popped into the small takeaway section next door to the main restaurant, greeted promptly by the very friendly staff, purchased a selection of fresh bread (you can ask for half a loaf if you require) this time I got a spelt, white and an olive ciabatta. The olive ciabatta is one if the tastiest I've ever had, loads of flavour and full of olives! \nGood selection of fresh sandwiches and small cakes to tempt you.\nLocated very close to the piazza.",
                "datePublished": "2013-11-03"
            },
            {
                "reviewId": "Z3QRMIKTODne-l7ENuFs5A",
                "author": "Jim W.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Well priced for what you get. Superbly cooked sharing steaks and sparkling service from our supremely rude (in a naughty way!) French waiter who's grasp of innuendo was second to none. Desserts were also pretty good and was overjoyed that they resisted the urge to put a f***ing raspberry or dome such in the bottom of their creme brûlée (a pet hate of mine and all too common these days)",
                "datePublished": "2014-08-01"
            },
            {
                "reviewId": "0cTLXcykIGwBVKWn7GlAhQ",
                "author": "Alexandra E.",
                "reviewRating": {
                    "ratingValue": 5
                },
                "sentiment": "positive",
                "description": "Thank you for our lovely meal, pre and post opera. Food delicious, service excellent. Staff very knowledgeable and kind. Thank you.",
                "datePublished": "2015-10-19"
            },
            {
                "reviewId": "X2jlorjlpqQnNwLAjw1kRQ",
                "author": "Britt X.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A Near exact replica of the famous SoHo location in NYC, i have to love this spot as it reminds me of home. With classics like moules frites, steak tar tar, the seafood platter and excellent bloody marys, this is the perfect brunch spot for any event.",
                "datePublished": "2013-09-16"
            },
            {
                "reviewId": "HYjvqocF8yIze-a9lvX0TA",
                "author": "Jason E.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "The bar is very impressive.  This is the sort of place the word über was invented for.  The wine list is great, the bar menu is great, it isn't cheap and doesn't feel it.  I was only here for drinks and snacks.  If you're in Covent Garden and haven't decided on where to go this wouldn't be a bad place to start.",
                "datePublished": "2013-12-28"
            },
            {
                "reviewId": "hSTxhOsZRD2kC1FWZ0U5Bw",
                "author": "Paul C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Impressive dining room,  nice for a special treat. I've been for breakfast twice now and had the avocado on toast with poached egg. Lovely. They have a private dining room now for larger groups.",
                "datePublished": "2014-03-04"
            },
            {
                "reviewId": "YO9OQAsxZFmPSHkLsEErcw",
                "author": "Rahul K.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "On a recent trip, went to Balthazar with a friend who had great food at Balthazar in the past. Possibly this was the one-off day but the food was very average. We both essentially got a steak and it wasn't great. The wine though was brilliant - we got recommendation from the sommelier and it was a great suggestion. Will visit again though since it possibly was just a busy Friday eve.",
                "datePublished": "2014-04-09"
            },
            {
                "reviewId": "ALQLO4ZzaJ-CFJXjdsJRUA",
                "author": "John M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Spent an enjoyable afternoon over a classy bottle of beautiful tasting wine and a bowl of mussels and fries cooked to perfection, what more do you want in life. The ambience is great, the staff are attentive and understand how to look after the customers. Great place, priced accordingly but worth it.",
                "datePublished": "2015-08-15"
            },
            {
                "reviewId": "-UwSFoSfzaqjeUwaQlFKPA",
                "author": "Sara L.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "I had to wait for my friend so I spent about 45 minutes in the bar area. I love the bar! Great selection of wines and friendly bartenders. Food was excellent. I had the beetroot dish for a starter, the salmon with spinach and lentils for my main, and chocolate for dessert. Service was excellent. I actually felt like I was in New York in this restaurant, they've definitely captured the NYC buzz.",
                "datePublished": "2013-12-11"
            },
            {
                "reviewId": "WVoVHZR1IcjxVnxcvDH1Zg",
                "author": "Joni P.",
                "reviewRating": {
                    "ratingValue": 3
                },
                "sentiment": "negative",
                "description": "Went here last night with 3 friends, good atmosphere although very noisy (we were in a nice semi-circular booth but I could hardly hear my friend across from me). Started with a cocktail, nice but at £10.50 a little steep for a small glass with a lot of ice. Food was tasty, I had fish pie which was rich but delicious, packed with fish, then the lemon posset for dessert, which was fine but nothing special.  Overall I came away with a bill for £50 (including a glass of wine) and felt that for the quality of the meal (and the wine), although good, it was a little overpriced. I had been expecting more because of the hype. Service was excellent. I probably wouldn't go again, too many amazing choices in London!",
                "datePublished": "2015-07-25"
            },
            {
                "reviewId": "uroJ1gveQBF2p2xaQu_LkQ",
                "author": "Elizabeth G.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Ambiance: perfect, busy, cute French bistro restaurant!\nService: friendly, helpful, and a little slow. ( which you should expect from the French, they like to take their time)\nFood: perfect menu. Lobster, cooked perfectly, oysters, nice selection shucked just right, French onion was ok, nothing to ride hoe about. \nReason for a 4: Balthazar in NY is better. They have a better selection of seafood. In NY, you can order jumbo prawns that are a true jumbo.  Also the baked bread in NY is fresher.  I still enjoyed the London restaurant and would highly recommend it.",
                "datePublished": "2013-10-06"
            },
            {
                "reviewId": "xtn5U6M81i1gjhDijzQE3Q",
                "author": "Aly H.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Nice ambiance, great service, but definitely overpriced. Ordered the spaghetti with lobster--expected the meal to be a lot tastier. Overall, a good experience; I'd go back to try something new.",
                "datePublished": "2013-07-22"
            },
            {
                "reviewId": "sCyYq-Wq9SzNha73dldyJg",
                "author": "F M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Great bakery (haven't tried the restaurant). One of my fav stops in Covent Garden. Try the delicious spinach and mushroom croissant. Lovely presentation too.\nSuper friendly staff and classic European (French) look. The classical music soundtrack is a bit old-fashioned but frankly better than some of the pretentious affect-pop one might hear in the more hipster coffee shops.\nA place that makes one feel good. If prices were a little lower, I'd give 5 stars (but they're within the norm).",
                "datePublished": "2013-11-25"
            },
            {
                "reviewId": "kTrXeOqhd9GsQXmpCtPnmg",
                "author": "Al J.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "A \"New York\" brunch never quite had the perfect venue in London. There were a number of places that came close: Breakfast Club, Automat, Tom's Kitchen all came close in my books... but none ever truly captured the essence and food (read: pancakes) of those Saturday and Sunday mornings that I used to spend in Manhattan. Balthazar, which looks and feels identical to her sibling across the Atlantic, fits this niche perfectly. The food is well executed (the Huevos Rancheros were delicious during my visit this weekend), the staff attentive, the room well decorated, the sound level loud without being deafening. Balthazar is a place I could see myself returning to for dinner, for a drink... and certainly for another weekend brunch with friends.",
                "datePublished": "2013-03-24"
            },
            {
                "reviewId": "vB6N3_LqdQBGHzsVY5EIWg",
                "author": "Elena M.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Came here for breakfast. Familiar with Balthazar from New York and was eager to try a traditional full English breakfast. it was yummy and didn't disappoint. My husband got some selection of pastries and jams. Carb overload but he enjoyed it. Overall, it was as expected: good food, a little pricey, and a little crowded. Not sure if I would even consider returning here for dinner as it seems to get booked up and there are tons of amazing places to have dinner in London (*cough cough Great Queen Street *cough cough*).",
                "datePublished": "2015-04-09"
            },
            {
                "reviewId": "TZEUMZs0RV3_4VkUFT9hLQ",
                "author": "Kate S.",
                "reviewRating": {
                    "ratingValue": 2
                },
                "sentiment": "negative",
                "description": "We booked Balthazar for a pre-theatre supper on my birthday. First impressions were great as we arrived early to have drinks at the busy bar. It had a buzzy atmosphere at 5pm and we ordered drinks whilst we waited for our table. I had an Aperol spritz which was watery and rather expensive for 9.50 but we perused the menu which sounded good and got shown to a nice corner table. This is where it all started to unravel. The wine list is ludicrously expensive and we ordered two half bottles as the house wines did not appeal. I ordered saffron risotto to start which had 1.1/2 (!) scallops on the top. It arrived with a skin on it so had either been sat waiting to be served or had been microwaved to high heaven. My boyfriend's game pate was not pate, more like a thick over seasoned terrine. Bread was a little stale and butter ice cold. My main was 1/2 a lobster which arrived served on a bed of ice with no fork or cracker to open it. Every time I tried to get some flesh out it was submerged in a slushy, icy bath and it felt like I got an 1/8 of a lobster! Pretty revolting and served with what appeared to be Heinz seafood sauce. My boyfriend's duck shepherd's pie was greasy, small and swimming in fat. All in all the bill came to £160 which we certainly anticipated, but for this price range you would expect high quality French food. We will not be returning, considering brasserie Zedel is not too far away and has a far more spectacular ambience for half the price I cannot believe Balthazar gets away with the terrible expensive food it has to offer. Please save your money and go elsewhere! London has so much more to offer than this overpriced mediocrity!",
                "datePublished": "2015-04-22"
            },
            {
                "reviewId": "QV-uY4lQWtJ0gaYXhJjhZw",
                "author": "Fabian C.",
                "reviewRating": {
                    "ratingValue": 4
                },
                "sentiment": "positive",
                "description": "Very attentive staff made our first visit to Balthazar easily enjoyable. We didn't have a reservation but were promptly seated. Girlfriend had the eggs royale, I had the eggs hussard both of which were absolutely delicious. \nAfterwards we shared the waffles which were a bit dry and didn't come with enough berry sauce to make a difference. Staff very helpful again though and brought a generous serving of chocolate sauce on the side. \nMenu a bit boring but exactly what you would expect from a bistro brunch. \nGreat service. Most food excellent. \nHighly recommended.",
                "datePublished": "2013-05-17"
            }
        ]
    }
}